-- -*- M2-comint -*- {* hash: 569070133 *}
--warning: function parametersInIdeal redefined

i1 : sgr=matrix({{1,2,3},{4,5,6},{7,8,10}})

o1 = | 1 2 3  |
     | 4 5 6  |
     | 7 8 10 |

              3        3
o1 : Matrix ZZ  <--- ZZ

i2 : writeNmzData(sgr,1)

i3 : nmzFile=setNmzFile()

o3 = nmzM2_28070

i4 : get(nmzFile|".in")

o4 = 3
     3
     1 2 3 
     4 5 6 
     7 8 10 
     1


i5 : rmNmzFiles();

i6 : 
