-- -*- M2-comint -*- {* hash: 793307396 *}

i1 : setNmzFilename("example"); -- to keep the files

i2 : sgr=matrix({{1,2,3},{4,5,6},{7,8,10}})

o2 = | 1 2 3  |
     | 4 5 6  |
     | 7 8 10 |

              3        3
o2 : Matrix ZZ  <--- ZZ

i3 : writeNmzData(sgr,1)

i4 : get(setNmzFile()|".in")

o4 = 3
     3
     1 2 3 
     4 5 6 
     7 8 10 
     1


i5 : rmNmzFiles();

i6 : 
