-- -*- M2-comint -*- {* hash: -1163741525 *}

i1 : R = ZZ/32003[symbol a..symbol d]

o1 = R

o1 : PolynomialRing

i2 : inL = {c^4, b*d^2, b*c, b^2*d, b^3}

       4     2        2    3
o2 = {c , b*d , b*c, b d, b }

o2 : List

i3 : L = {c^4-a*d^3, -c^3+b*d^2, b*c-a*d, -a*c^2+b^2*d, b^3-a^2*c}

       4      3     3      2                  2    2    3    2
o3 = {c  - a*d , - c  + b*d , b*c - a*d, - a*c  + b d, b  - a c}

o3 : List

i4 : weightVector(inL,L)

o4 = {8, 8, 3, 1}

o4 : List

i5 : groebnerCone(inL,L)

o5 = (| 0  0  |, | 1  0 |)
      | 0  0  |  | 0  1 |
      | -2 -3 |  | -2 3 |
      | -3 -4 |  | -3 4 |

o5 : Sequence

i6 : initialIdeal({8,8,3,1},ideal L)

               2        4   2    3
o6 = ideal (b*d , b*c, c , b d, b )

o6 : Ideal of R

i7 : initialIdeal({5,5,2,1},ideal L)

                    2   4      3   2    3
o7 = ideal (b*c, b*d , c  - a*d , b d, b )

o7 : Ideal of R

i8 : 
