-- -*- M2-comint -*- {* hash: -996785396 *}

i1 : R = ZZ/32003[symbol a..symbol d]

o1 = R

o1 : PolynomialRing

i2 : inL = {c^4, b*d^2, b*c, b^2*d, b^3}

       4     2        2    3
o2 = {c , b*d , b*c, b d, b }

o2 : List

i3 : L = {c^4-a*d^3, -c^3+b*d^2, b*c-a*d, -a*c^2+b^2*d, b^3-a^2*c}

       4      3     3      2                  2    2    3    2
o3 = {c  - a*d , - c  + b*d , b*c - a*d, - a*c  + b d, b  - a c}

o3 : List

i4 : weightVector(inL,L)

o4 = {8, 8, 3, 1}

o4 : List

i5 : groebnerCone(inL,L)

o5 = (| 0  0  |, | 1  0 |)
      | 0  0  |  | 0  1 |
      | -2 -3 |  | -2 3 |
      | -3 -4 |  | -3 4 |

o5 : Sequence

i6 : I = monomialCurveIdeal(R,{1,3,4})

                        3      2     2    2    3    2
o6 = ideal (b*c - a*d, c  - b*d , a*c  - b d, b  - a c)

o6 : Ideal of R

i7 : time (inLs,Ls) = gfan I
sh: gfan: not found
sh: gfan_leadingterms: not found
using temporary file /tmp/M2-1792-1
     -- used 0. seconds

o7 = ({}, {})

o7 : Sequence

i8 : wtvecs = apply(#inLs, i -> weightVector(inLs#i, Ls#i));

i9 : wtvecs/print;

i10 : inL1 = wtvecs/(w -> inw(w,I));

i11 : inL1/toString/print;

i12 : assert(inL1 == inLs/ideal)

i13 : 
0.60user 0.04system 0:00.61elapsed 105%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+8outputs (0major+8291minor)pagefaults 0swaps
