-- -*- M2-comint -*- {* hash: -1549979493 *}
--loading configuration for package "StatePolytope" from file /Users/mike/Library/Application Support/Macaulay2/init-StatePolytope.m2

i1 : R = QQ[a,b];

i2 : I = ideal(a^2+b^2,a*b);

o2 : Ideal of R

i3 : initialIdeals(I)  

        3        2     2        3
o3 = {{b , a*b, a }, {b , a*b, a }}

o3 : List

i4 : 
