-- -*- M2-comint -*-

i1 : (f = Command ( () -> 2^30 );)

i2 : f

o2 = 1073741824

i3 : (c = Command "date";)

i4 : c
Wed Jul 12 12:17:00 CDT 2006

o4 = 0

i5 : 
