
i1 : (f = Command ( () -> 2^30 );)

i2 : f

o2 = 1073741824

i3 : (c = Command "date";)

i4 : c
Sat Apr 16 12:12:29 CDT 2005

o4 = 0

i5 : 
