
i1 : (f = Command ( () -> 2^30 );)

i2 : f

o2 = 1073741824

i3 : (c = Command "date";)

i4 : c
Mon Jul 25 15:53:45 CDT 2005

o4 = 0

i5 : 
