
i1 : filename = temporaryFileName () | ".dbm"

o1 = /tmp/M2-11905-1.dbm

i2 : x = openDatabaseOut filename

o2 = /tmp/M2-11905-1.dbm

o2 : Database

i3 : x#"first" = "hi there"

o3 = hi there

i4 : x#"first"

o4 = hi there

i5 : x#"second" = "ho there"

o5 = ho there

i6 : scanKeys(x,print)
first
second

i7 : close x

o7 = 0

i8 : unlinkFile filename

i9 : 
