-- -*- M2-comint -*-

i1 : R = QQ[x,y]/(x^3,y^2);

i2 : N = cokernel matrix {{x^2, x*y}}

o2 = cokernel | x2 xy |

                            1
o2 : R-module, quotient of R

i3 : H = Ext(N,N);

i4 : ring H

o4 = QQ [X , X , x, y]
          1   2

o4 : PolynomialRing

i5 : S = ring H;

i6 : H

o6 = cokernel {-2, -2} | 0   0   y x 0    0    0 0 0 0 0 0 0 0 0  0  0  |
              {-1, -1} | X_1 0   0 0 0    0    y x 0 0 0 0 0 0 0  0  0  |
              {-1, -1} | 0   0   0 0 0    0    0 0 y x 0 0 0 0 0  0  0  |
              {-1, -1} | 0   X_1 0 0 0    0    0 0 0 0 y x 0 0 0  0  0  |
              {-1, -1} | 0   0   0 0 0    0    0 0 0 0 0 0 y x 0  0  0  |
              {0, 0}   | 0   0   0 0 X_1y X_1x 0 0 0 0 0 0 0 0 y2 xy x2 |

                            6
o6 : S-module, quotient of S

i7 : isHomogeneous H

o7 = true

i8 : rank source basis( {-2,-3}, H)

o8 = 1

i9 : rank source basis( {-3}, Ext^2(N,N) )

o9 = 1

i10 : 
