-- -*- M2-comint -*-

i1 : R = ZZ/1277[x,y];

i2 : I = ideal(x^3 - 2*x*y, x^2*y - 2*y^2 + x);

o2 : Ideal of R

i3 : (x^3 - 2*x) % I

o3 = -2x

o3 : R

i4 : (x^3) % I

o4 = 0

o4 : R

i5 : 
