
i1 : R = ZZ[x,y,SkewCommutative=>true]

o1 = R

o1 : PolynomialRing

i2 : x*y

o2 = x*y

o2 : R

i3 : y*x

o3 = -x*y

o3 : R

i4 : 
