-- -*- M2-comint -*-

i1 : "foo" << 2^30 << endl << close

o1 = foo

o1 : File

i2 : get "foo"

o2 = 1073741824

i3 : unlinkFile "foo"

i4 : 
