-- -*- M2-comint -*-

i1 : x_a

o1 = x
      a

o1 : IndexedVariable

i2 : x_a = b

o2 = b

o2 : Symbol

i3 : x_a

o3 = b

o3 : Symbol

i4 : x_c

o4 = x
      c

o4 : IndexedVariable

i5 : x_c = d

o5 = d

o5 : Symbol

i6 : x_c

o6 = d

o6 : Symbol

i7 : debug Core

i8 : peek valueTable x

o8 = MutableHashTable{a => b}
                      c => d

i9 : 
