--package "Macaulay2Core" loaded
--package "PrimaryDecomposition" loaded
--loading the Macaulay2 documentation
--package "Macaulay2" loaded

i1 : R = ZZ/101[a..d];

i2 : m = matrix{{a,b,c,d}};
             1       4
o2 : Matrix R  <--- R


i3 : m1 = schreyerOrder m

o3 = | a b c d |

             1       4
o3 : Matrix R  <--- R

i4 : F = source m1

      4
o4 = R

o4 : R-module, free, degrees {1, 1, 1, 1}

i5 : g = syz m1

o5 = {1} | 0  0  0  -d -c -b |
     {1} | 0  -d -c 0  0  a  |
     {1} | -d 0  b  0  a  0  |
     {1} | c  b  0  a  0  0  |

             4       6
o5 : Matrix R  <--- R

i6 : leadTerm g

o6 = {1} | 0 0 0 0 0 0 |
     {1} | 0 0 0 0 0 a |
     {1} | 0 0 b 0 a 0 |
     {1} | c b 0 a 0 0 |

             4       6
o6 : Matrix R  <--- R

i7 : schreyerOrder target m

o7 = 0

                    1
o7 : Matrix 0 <--- R

i8 : schreyerOrder source g

o8 = 0

                    6
o8 : Matrix 0 <--- R

i9 : 
