-- -*- M2-comint -*-

i1 : R = ZZ/31991[a,b,c] -- the coordinate ring of P^2

o1 = R

o1 : PolynomialRing

i2 : ipoint1 = ideal matrix({{a,b}})

o2 = ideal (a, b)

o2 : Ideal of R

i3 : ipoint1 = ideal(a,b)

o3 = ideal (a, b)

o3 : Ideal of R

i4 : ipoint2 = ideal(a,c)

o4 = ideal (a, c)

o4 : Ideal of R

i5 : ipoint3 = ideal(b,c)

o5 = ideal (b, c)

o5 : Ideal of R

i6 : icurves1 = intersect(
                    ipoint1^2,
                    ipoint2^2,
                    ipoint3^2
                )

                    2 2   2 2   2 2
o6 = ideal (a*b*c, b c , a c , a b )

o6 : Ideal of R

i7 : Icurves1 = gens icurves1

o7 = | abc b2c2 a2c2 a2b2 |

             1       4
o7 : Matrix R  <--- R

i8 : F1 = Icurves1 * random(source Icurves1, R^{-6})

o8 = | -11819a4b2+8360a3b3+3907a2b4-8514a4bc-14089a3b2c+634a2b3c-15791ab4c+
     ------------------------------------------------------------------------
     11189a4c2+14165a3bc2-9127a2b2c2-8632ab3c2-3147b4c2+8312a3c3+10072a2bc3-
     ------------------------------------------------------------------------
     11563ab2c3-13293b3c3+2153a2c4-11866abc4-8437b2c4 |

             1       1
o8 : Matrix R  <--- R

i9 : betti F1

o9 = total: 1 1
         0: 1 .
         1: . .
         2: . .
         3: . .
         4: . .
         5: . 1

o9 : BettiTally

i10 : Icurves2 = gens (ipoint1^3)

o10 = | a3 a2b ab2 b3 |

              1       4
o10 : Matrix R  <--- R

i11 : F2 = Icurves2 * random(source Icurves2, R^{-6})

o11 = | -4710a6+745a5b+14748a4b2+10410a3b3+5240a2b4+4785ab5+11220b6+13659a5c-
      -----------------------------------------------------------------------
      8556a4bc-14128a3b2c+13699a2b3c+4927ab4c-4208b5c-13562a4c2+9775a3bc2-
      -----------------------------------------------------------------------
      4050a2b2c2-1018ab3c2+11329b4c2-1097a3c3+12739a2bc3-8585ab2c3+8784b3c3 |

              1       1
o11 : Matrix R  <--- R

i12 : betti F2

o12 = total: 1 1
          0: 1 .
          1: . .
          2: . .
          3: . .
          4: . .
          5: . 1

o12 : BettiTally

i13 : i = ideal((a-b)^2) + (ipoint1^4)

              2           2   4   3    2 2     3   4
o13 = ideal (a  - 2a*b + b , a , a b, a b , a*b , b )

o13 : Ideal of R

i14 : icurves3 = intersect(i, ipoint3^2)

              2 2         2    2 2   2          2     3    4     3   2 2
o14 = ideal (a c  - 2a*b*c  + b c , a b*c - 2a*b c + b c, b , a*b , a b )

o14 : Ideal of R

i15 : Icurves3 = gens icurves3

o15 = | a2c2-2abc2+b2c2 a2bc-2ab2c+b3c b4 ab3 a2b2 |

              1       5
o15 : Matrix R  <--- R

i16 : F3 = Icurves3 * random(source Icurves3, R^{-6})

o16 = | 13692a4b2+8384a3b3+8537a2b4-10200ab5+7128b6+11295a4bc+1573a3b2c+
      -----------------------------------------------------------------------
      2961a2b3c+15172ab4c+6873b5c-1064a4c2+4443a3bc2-12087a2b2c2+14967ab3c2+
      -----------------------------------------------------------------------
      10828b4c2+6557a3c3-15804a2bc3+11937ab2c3-2690b3c3+14372a2c4+3247abc4+
      -----------------------------------------------------------------------
      14372b2c4 |

              1       1
o16 : Matrix R  <--- R

i17 : betti F3

o17 = total: 1 1
          0: 1 .
          1: . .
          2: . .
          3: . .
          4: . .
          5: . 1

o17 : BettiTally

i18 : can1 = basis(3, intersect(ipoint1,ipoint2,ipoint3))

o18 = {2} | b c 0 0 0 0 0 |
      {2} | 0 0 a c 0 0 0 |
      {2} | 0 0 0 0 a b c |

o18 : Matrix

i19 : target can1

o19 = image | bc ac ab |

                              1
o19 : R-module, submodule of R

i20 : source can1

       7
o20 = R

o20 : R-module, free, degrees {3, 3, 3, 3, 3, 3, 3}

i21 : can1 = can1 ** R

o21 = {2} | b c 0 0 0 0 0 |
      {2} | 0 0 a c 0 0 0 |
      {2} | 0 0 0 0 a b c |

o21 : Matrix

i22 : can1 = super can1

o22 = | b2c bc2 a2c ac2 a2b ab2 abc |

              1       7
o22 : Matrix R  <--- R

i23 : can2 = basis(3, ipoint1^2)

o23 = {2} | a b c 0 0 0 0 |
      {2} | 0 0 0 b c 0 0 |
      {2} | 0 0 0 0 0 b c |

o23 : Matrix

i24 : can2 = super (can2 ** R)

o24 = | a3 a2b a2c ab2 abc b3 b2c |

              1       7
o24 : Matrix R  <--- R

i25 : can3 = basis(3, intersect(ideal(a-b) + ipoint1^2, ipoint3))

o25 = {2} | a c 0 0 0 0 0 |
      {2} | 0 0 b c 0 0 0 |
      {2} | 0 0 0 0 a b c |

o25 : Matrix

i26 : can3 = super (can3 ** R)

o26 = | a2c-abc ac2-bc2 b3 b2c a2b ab2 abc |

              1       7
o26 : Matrix R  <--- R

i27 : betti  can1

o27 = total: 1 7
          0: 1 .
          1: . .
          2: . 7

o27 : BettiTally

i28 : betti  can2

o28 = total: 1 7
          0: 1 .
          1: . .
          2: . 7

o28 : BettiTally

i29 : betti  can3

o29 = total: 1 7
          0: 1 .
          1: . .
          2: . 7

o29 : BettiTally

i30 : S = (coefficientRing R)[x_0..x_6]

o30 = S

o30 : PolynomialRing

i31 : T1 = R/ideal F1

o31 = T1

o31 : QuotientRing

i32 : f1 = map(T1,S,substitute(can1, T1))

                 2      2   2      2   2      2
o32 = map(T1,S,{b c, b*c , a c, a*c , a b, a*b , a*b*c})

o32 : RingMap T1 <--- S

i33 : IC1 = mingens ker f1

o33 = | x_3x_5-x_6^2 x_2x_5-x_4x_6 x_1x_5-x_0x_6 x_3x_4-x_2x_6 x_1x_4-x_6^2
      -----------------------------------------------------------------------
      x_0x_4-x_5x_6 x_0x_3-x_1x_6 x_1x_2-x_3x_6 x_0x_2-x_6^2
      -----------------------------------------------------------------------
      x_0^2+6622x_0x_1-1390x_1^2+1013x_2^2-5140x_1x_3+9370x_2x_3+13550x_3^2-
      -----------------------------------------------------------------------
      11830x_2x_4+817x_4^2-10496x_0x_5-9050x_4x_5-3732x_5^2-14534x_0x_6-1450x
      -----------------------------------------------------------------------
      _1x_6+10649x_2x_6+5781x_3x_6-7823x_4x_6-3365x_5x_6-8526x_6^2 |

              1       10
o33 : Matrix S  <--- S

i34 : T2 = R/ideal F2

o34 = T2

o34 : QuotientRing

i35 : f2 = map(T2,S,substitute(can2, T2))

                 3   2    2      2          3   2
o35 = map(T2,S,{a , a b, a c, a*b , a*b*c, b , b c})

o35 : RingMap T2 <--- S

i36 : IC2 = mingens ker f2

o36 = | x_4x_5-x_3x_6 x_2x_5-x_1x_6 x_4^2-x_2x_6 x_3x_4-x_1x_6 x_1x_4-x_0x_6
      -----------------------------------------------------------------------
      x_3^2-x_1x_5 x_2x_3-x_0x_6 x_1x_3-x_0x_5 x_1x_2-x_0x_4 x_1^2-x_0x_3
      -----------------------------------------------------------------------
      x_0^2x_5-11377x_0x_1x_5+5417x_0x_3x_5+13650x_0x_5^2-7880x_1x_5^2-8661x_
      -----------------------------------------------------------------------
      3x_5^2-15896x_5^3-3202x_0x_1x_6+2610x_0x_3x_6-10131x_0x_4x_6-9828x_2x_
      -----------------------------------------------------------------------
      4x_6+8303x_0x_5x_6+2843x_1x_5x_6+4801x_3x_5x_6+3886x_5^2x_6+1662x_0x_6^
      -----------------------------------------------------------------------
      2-12225x_1x_6^2-14273x_2x_6^2-1888x_3x_6^2+10224x_4x_6^2-11420x_5x_6^2+
      -----------------------------------------------------------------------
      15851x_6^3 x_0^2x_3+4874x_0x_1x_5-3798x_0x_3x_5+3856x_0x_5^2+11352x_1x_
      -----------------------------------------------------------------------
      5^2+12178x_3x_5^2-3669x_5^3-3202x_0^2x_6+11205x_0x_1x_6-10131x_0x_2x_6-
      -----------------------------------------------------------------------
      9828x_2^2x_6+14625x_0x_3x_6+4848x_0x_4x_6+13107x_2x_4x_6-3349x_0x_5x_6+
      -----------------------------------------------------------------------
      6711x_1x_5x_6-15765x_3x_5x_6-540x_5^2x_6-10332x_0x_6^2+11155x_1x_6^2+
      -----------------------------------------------------------------------
      12619x_2x_6^2+6756x_3x_6^2+15023x_4x_6^2-9889x_5x_6^2+3560x_6^3
      -----------------------------------------------------------------------
      x_0^2x_1-3202x_0^2x_4-10131x_0x_2x_4-9828x_2^2x_4+7297x_0x_1x_5-6027x_
      -----------------------------------------------------------------------
      0x_3x_5-9459x_0x_5^2-1893x_1x_5^2+13916x_3x_5^2-5098x_5^3+11205x_0^2x_6
      -----------------------------------------------------------------------
      +9565x_0x_1x_6+4848x_0x_2x_6+13107x_2^2x_6+7929x_0x_3x_6+6049x_0x_4x_6-
      -----------------------------------------------------------------------
      8227x_2x_4x_6+6504x_0x_5x_6+11547x_1x_5x_6-15193x_3x_5x_6-1692x_5^2x_6+
      -----------------------------------------------------------------------
      4290x_0x_6^2-7827x_1x_6^2+1200x_2x_6^2+10806x_3x_6^2+13762x_4x_6^2-
      -----------------------------------------------------------------------
      3260x_5x_6^2+491x_6^3 x_0^3-3202x_0^2x_2-10131x_0x_2^2-9828x_2^3+11205x
      -----------------------------------------------------------------------
      _0^2x_4+4848x_0x_2x_4+13107x_2^2x_4-4703x_0x_1x_5+3568x_0x_3x_5+14031x_
      -----------------------------------------------------------------------
      0x_5^2-5542x_1x_5^2+11994x_3x_5^2-6254x_5^3+9565x_0^2x_6-12498x_0x_1x_6
      -----------------------------------------------------------------------
      +6049x_0x_2x_6-8227x_2^2x_6-4021x_0x_3x_6-1004x_0x_4x_6-7706x_2x_4x_6+
      -----------------------------------------------------------------------
      15510x_0x_5x_6+1595x_1x_5x_6-4444x_3x_5x_6-12116x_5^2x_6-10852x_0x_6^2-
      -----------------------------------------------------------------------
      6268x_1x_6^2+1147x_2x_6^2-14645x_3x_6^2-1025x_4x_6^2-4815x_5x_6^2+
      -----------------------------------------------------------------------
      14709x_6^3 |

              1       14
o36 : Matrix S  <--- S

i37 : T3 = R/ideal F3

o37 = T3

o37 : QuotientRing

i38 : f3 = map(T3,S,substitute(can3, T3))

                 2              2      2   3   2    2      2
o38 = map(T3,S,{a c - a*b*c, a*c  - b*c , b , b c, a b, a*b , a*b*c})

o38 : RingMap T3 <--- S

i39 : IC3 = mingens ker f3

o39 = | x_3x_5-x_2x_6 x_1x_5+x_3x_6-x_6^2 x_0x_5-x_4x_6+x_5x_6 x_3x_4-x_5x_6
      -----------------------------------------------------------------------
      x_2x_4-x_5^2 x_1x_4-x_0x_6 x_0x_3+x_3x_6-x_6^2 x_1x_2+x_3^2-x_3x_6
      -----------------------------------------------------------------------
      x_0x_2+x_2x_6-x_5x_6 x_0^2+14035x_0x_1-12401x_1^2+15628x_2^2-2468x_1x_3
      -----------------------------------------------------------------------
      -3404x_2x_3-11195x_3^2+7476x_0x_4+829x_4^2+6504x_2x_5+6246x_4x_5+11267x
      -----------------------------------------------------------------------
      _5^2-11638x_0x_6+2468x_1x_6-3502x_2x_6+16x_3x_6+13097x_4x_6-8211x_5x_6+
      -----------------------------------------------------------------------
      7585x_6^2 |

              1       10
o39 : Matrix S  <--- S

i40 : IC1res = res(coker IC1)

       1      10      25      25      10      1
o40 = S  <-- S   <-- S   <-- S   <-- S   <-- S  <-- 0
                                                     
      0      1       2       3       4       5      6

o40 : ChainComplex

i41 : betti  IC1res

o41 = total: 1 10 25 25 10 1
          0: 1  .  .  .  . .
          1: . 10 16  9  . .
          2: .  .  9 16 10 .
          3: .  .  .  .  . 1

o41 : BettiTally

i42 : IC2res = res(coker IC2)

       1      14      35      35      14      1
o42 = S  <-- S   <-- S   <-- S   <-- S   <-- S  <-- 0
                                                     
      0      1       2       3       4       5      6

o42 : ChainComplex

i43 : betti  IC2res

o43 = total: 1 14 35 35 14 1
          0: 1  .  .  .  . .
          1: . 10 20 15  4 .
          2: .  4 15 20 10 .
          3: .  .  .  .  . 1

o43 : BettiTally

i44 : IC3res = res(coker IC3)

       1      10      25      25      10      1
o44 = S  <-- S   <-- S   <-- S   <-- S   <-- S  <-- 0
                                                     
      0      1       2       3       4       5      6

o44 : ChainComplex

i45 : betti  IC3res

o45 = total: 1 10 25 25 10 1
          0: 1  .  .  .  . .
          1: . 10 16  9  . .
          2: .  .  9 16 10 .
          3: .  .  .  .  . 1

o45 : BettiTally

i46 : IC1 = matrix entries IC1

o46 = | x_3x_5-x_6^2 x_2x_5-x_4x_6 x_1x_5-x_0x_6 x_3x_4-x_2x_6 x_1x_4-x_6^2
      -----------------------------------------------------------------------
      x_0x_4-x_5x_6 x_0x_3-x_1x_6 x_1x_2-x_3x_6 x_0x_2-x_6^2
      -----------------------------------------------------------------------
      x_0^2+6622x_0x_1-1390x_1^2+1013x_2^2-5140x_1x_3+9370x_2x_3+13550x_3^2-
      -----------------------------------------------------------------------
      11830x_2x_4+817x_4^2-10496x_0x_5-9050x_4x_5-3732x_5^2-14534x_0x_6-1450x
      -----------------------------------------------------------------------
      _1x_6+10649x_2x_6+5781x_3x_6-7823x_4x_6-3365x_5x_6-8526x_6^2 |

              1       10
o46 : Matrix S  <--- S

i47 : IC1res = res(coker IC1, DegreeLimit => {1})

       1      10      25      25      10      1
o47 = S  <-- S   <-- S   <-- S   <-- S   <-- S  <-- 0
                                                     
      0      1       2       3       4       5      6

o47 : ChainComplex

i48 : betti IC1res

o48 = total: 1 10 25 25 10 1
          0: 1  .  .  .  . .
          1: . 10 16  9  . .
          2: .  .  9 16 10 .
          3: .  .  .  .  . 1

o48 : BettiTally

i49 : ff1 = map(R,S,can1)

                2      2   2      2   2      2
o49 = map(R,S,{b c, b*c , a c, a*c , a b, a*b , a*b*c})

o49 : RingMap R <--- S

i50 : trim ideal pushForward1(ff1,coker F1)

                     2                                                 2 
o50 = ideal (x x  - x , x x  - x x , x x  - x x , x x  - x x , x x  - x ,
              3 5    6   2 5    4 6   1 5    0 6   3 4    2 6   1 4    6 
      -----------------------------------------------------------------------
                                                     2   2             
      x x  - x x , x x  - x x , x x  - x x , x x  - x , x  + 6622x x  -
       0 4    5 6   0 3    1 6   1 2    3 6   0 2    6   0        0 1  
      -----------------------------------------------------------------------
           2        2                               2                   2  
      1390x  + 1013x  - 5140x x  + 9370x x  + 13550x  - 11830x x  + 817x  -
           1        2        1 3        2 3         3         2 4       4  
      -----------------------------------------------------------------------
                                  2                                     
      10496x x  - 9050x x  - 3732x  - 14534x x  - 1450x x  + 10649x x  +
            0 5        4 5        5         0 6        1 6         2 6  
      -----------------------------------------------------------------------
                                            2
      5781x x  - 7823x x  - 3365x x  - 8526x )
           3 6        4 6        5 6        6

o50 : Ideal of S

i51 : 
