-- -*- M2-comint -*-
with packages: Classic, Elimination, LLLBases, PrimaryDecomposition, SchurRings

i1 : x

o1 = x

o1 : Symbol

i2 : x := 4

o2 = 4

i3 : x

o3 = 4

i4 : g = () -> ( p := 444; p )

o4 = g

o4 : FunctionClosure

i5 : g()

o5 = 444

i6 : p

o6 = p

o6 : Symbol

i7 : g = () -> ( p := 444; () -> p )
--warning: g redefined

o7 = g

o7 : FunctionClosure

i8 : g()

o8 = --Function[stdio:7:25-7:28]--

o8 : FunctionClosure

i9 : oo ()

o9 = 444

i10 : g = () -> ( p := 444; (() -> p, i -> p = i))
--warning: g redefined

o10 = g

o10 : FunctionClosure

i11 : (b,c) = g()

o11 = (b, c)

o11 : Sequence

i12 : b()

o12 = 444

i13 : c 555

o13 = 555

i14 : b()

o14 = 555

i15 : a := b := 44

o15 = 44

i16 : a

o16 = 44

i17 : b

o17 = 44

i18 : f = i -> (i,i^2)

o18 = f

o18 : FunctionClosure

i19 : (r,s) := f 9

o19 = (9, 81)

o19 : Sequence

i20 : r

o20 = 9

i21 : s

o21 = 81

i22 : String * String := peek;

i23 : "left" * "right"

o23 = ("left", "right")

i24 : String * Number := peek;

i25 : "left" * 33

o25 = ("left", 33)

i26 : "left" * 3.3

o26 = ("left", 3.3)

i27 : ZZ + ZZ := (x,y) -> x+y+100

o27 = --Function[stdio:27:17-27:24]--

o27 : FunctionClosure

i28 : 3 + 4

o28 = 7

i29 : CC + CC := (w,z) -> w*z

o29 = --Function[stdio:29:17-29:22]--

o29 : FunctionClosure

i30 : ii + ii

o30 = - 1. + 0.ii

o30 : CC

i31 : - String := peek;

i32 : - "foo"

o32 = "foo"

i33 : - String := peek;

i34 : - "foo"

o34 = "foo"

i35 : String ~ := peek;

i36 : "foo" ~

o36 = "foo"

i37 : String ~ := peek;

i38 : "foo" ~

o38 = "foo"

i39 : source String := peek;

i40 : source "foo"

o40 = "foo"

i41 : source String := peek;

i42 : source "foo"

o42 = "foo"

i43 : source(String,Number) := peek;

i44 : source("foo",33)

o44 = ("foo", 33)

i45 : source("foo",3.3)

o45 = ("foo", 3.3)

i46 : source(String,String) := peek;

i47 : source("foo","bar")

o47 = ("foo", "bar")

i48 : 
