-- -*- M2-comint -*-

i1 : apply({1,3,5,7}, i -> i^2)

o1 = {1, 9, 25, 49}

o1 : List

i2 : apply([1,3,5,7], i -> i^2)

o2 = [1, 9, 25, 49]

o2 : Array

i3 : apply((1,3,5,7), i -> i^2)

o3 = (1, 9, 25, 49)

o3 : Sequence

i4 : 
