-- -*- M2-comint -*-
with packages: Classic, Elimination, LLLBases, PrimaryDecomposition, SchurRings

i1 : apply({1,2,3}, {100,200,300}, (i,j) -> i+j)

o1 = {101, 202, 303}

o1 : List

i2 : apply([1,2,3], [100,200,300], (i,j) -> i+j)

o2 = [101, 202, 303]

o2 : Array

i3 : apply((1,2,3), (100,200,300), (i,j) -> i+j)

o3 = (101, 202, 303)

o3 : Sequence

i4 : 
