-- -*- M2-comint -*-
with packages: Classic, Elimination, LLLBases, PrimaryDecomposition, SchurRings

i1 : R = ZZ/101[a..d];

i2 : I = ideal(a*b-c*d, (a*c-b*d)^2);

o2 : Ideal of R

i3 : associatedPrimes I

o3 = {ideal (d, a), ideal (b + c, a + d), ideal (c, b), ideal (b - c, a - d)}

o3 : List

i4 : 
