-- -*- M2-comint -*-
with packages: Classic, Elimination, LLLBases, PrimaryDecomposition, SchurRings, TangentCone

i1 : src = temporaryFileName()

o1 = /tmp/M2-3407-1

i2 : dst = temporaryFileName()

o2 = /tmp/M2-3407-2

i3 : src << "hi there" << close

o3 = /tmp/M2-3407-1

o3 : File

i4 : copyFile(src,dst,Verbose=>true)
--copying: /tmp/M2-3407-1 -> /tmp/M2-3407-2

i5 : get dst

o5 = hi there

i6 : copyFile(src,dst,Verbose=>true,UpdateOnly => true)
--skipping: /tmp/M2-3407-1 not newer than /tmp/M2-3407-2

i7 : src << "ho there" << close

o7 = /tmp/M2-3407-1

o7 : File

i8 : copyFile(src,dst,Verbose=>true,UpdateOnly => true)
--skipping: /tmp/M2-3407-1 not newer than /tmp/M2-3407-2

i9 : get dst

o9 = hi there

i10 : removeFile src

i11 : removeFile dst

i12 : 
