-- -*- M2-comint -*-

i1 : currentTime()

o1 = 1152301443

i2 : currentTime() /( (365 + 97./400) * 24 * 60 * 60 )

o2 = 36.515

o2 : RR

i3 : 12 * (oo - floor oo)

o3 = 6.17975

o3 : RR

i4 : run "date"
Fri Jul  7 14:44:03 CDT 2006

o4 = 0

i5 : 
