-- -*- M2-comint -*-

i1 : R =  ZZ [x, y];

i2 : degreesRing R

o2 = ZZ [T]

o2 : PolynomialRing

i3 : S = ZZ[x,y, Degrees=>{{1,1},{1,1}}];

i4 : degreesRing S

o4 = ZZ [T , T ]
          0   1

o4 : PolynomialRing

i5 : 
