-- -*- M2-comint -*-

i1 : newPackage "PKG"

o1 = PKG

o1 : Package

i2 : export x1

i3 : x1=3

o3 = 3

i4 : endPackage "PKG"

o4 = PKG

o4 : Package

i5 : dictionaryPath

o5 = {PKG.Dictionary, Elimination.Dictionary, LLLBases.Dictionary,
     ------------------------------------------------------------------------
     IntegralClosure.Dictionary, PrimaryDecomposition.Dictionary,
     ------------------------------------------------------------------------
     Classic.Dictionary, SchurRings.Dictionary, TangentCone.Dictionary,
     ------------------------------------------------------------------------
     Parsing.Dictionary, User#"private dictionary", Core.Dictionary,
     ------------------------------------------------------------------------
     OutputDictionary, PackageDictionary}

o5 : List

i6 : x1

o6 = 3

i7 : dismiss PKG

i8 : dictionaryPath

o8 = {Elimination.Dictionary, LLLBases.Dictionary,
     ------------------------------------------------------------------------
     IntegralClosure.Dictionary, PrimaryDecomposition.Dictionary,
     ------------------------------------------------------------------------
     Classic.Dictionary, SchurRings.Dictionary, TangentCone.Dictionary,
     ------------------------------------------------------------------------
     Parsing.Dictionary, User#"private dictionary", Core.Dictionary,
     ------------------------------------------------------------------------
     OutputDictionary, PackageDictionary}

o8 : List

i9 : x1

o9 = x1

o9 : Symbol

i10 : values PackageDictionary

o10 = {Parsing, Classic, Elimination, LLLBases, PrimaryDecomposition,
      -----------------------------------------------------------------------
      TangentCone, User, PKG, SchurRings, IntegralClosure, Core}

o10 : List

i11 : use PKG

i12 : x1

o12 = 3

i13 : 
