-- -*- M2-comint -*-
with packages: Classic, Elimination, LLLBases, PrimaryDecomposition, SchurRings

i1 : newPackage "Foo"

o1 = Foo

o1 : Package

i2 : export abc

i3 : abc = 3

o3 = 3

i4 : dictionaryPath

o4 = {Foo#"private dictionary", SchurRings.Dictionary, Classic.Dictionary,
     ------------------------------------------------------------------------
     PrimaryDecomposition.Dictionary, LLLBases.Dictionary,
     ------------------------------------------------------------------------
     Elimination.Dictionary, Macaulay2Core.Dictionary, OutputDictionary,
     ------------------------------------------------------------------------
     PackageDictionary}

o4 : List

i5 : endPackage "Foo"

o5 = Foo

o5 : Package

i6 : peek oo

o6 = Package{Dictionary => Foo.Dictionary                                         }
             example inputs => MutableHashTable{}
             example results => MutableHashTable{}
             exported mutable symbols => {}
             exported symbols => {abc}
             Options => OptionTable{Authors => {}                                }
                                    Date => 
                                    DebuggingMode => false
                                    Headline => 
                                    HomePage => 
                                    InfoDirSection => Macaulay 2 and its packages
                                    Version => 0.0
             package prefix => null
             private dictionary => Foo#"private dictionary"
             processed documentation => MutableHashTable{}
             raw documentation => MutableHashTable{}
             source directory => ./
             test inputs => MutableHashTable{}
             test number => 0
             title => Foo
             undocumented keys => MutableHashTable{}

i7 : dictionaryPath

o7 = {Foo.Dictionary, User#"private dictionary", SchurRings.Dictionary,
     ------------------------------------------------------------------------
     Classic.Dictionary, PrimaryDecomposition.Dictionary,
     ------------------------------------------------------------------------
     LLLBases.Dictionary, Elimination.Dictionary, Macaulay2Core.Dictionary,
     ------------------------------------------------------------------------
     OutputDictionary, PackageDictionary}

o7 : List

i8 : abc

o8 = 3

i9 : 
