--package "Macaulay2Core" loaded
--package "PrimaryDecomposition" loaded
--loading the Macaulay2 documentation
--package "Macaulay2" loaded

i1 : R = ZZ/10007[a,b];

i2 : f = (2*a+3)^4 + 5

        4      3       2
o2 = 16a  + 96a  + 216a  + 216a + 86

o2 : R

i3 : g = (2*a+b+1)^3

       3      2        2    3      2             2
o3 = 8a  + 12a b + 6a*b  + b  + 12a  + 12a*b + 3b  + 6a + 3b + 1

o3 : R

i4 : S = factor f

                             2
o4 = (16)(a - 402)(a + 405)(a  + 3a - 2301)

o4 : Product

i5 : T = factor g

                          3
o5 = (8)(a - 5003b - 5003)

o5 : Product

i6 : #T

o6 = 2

i7 : T#0

o7 = 8

o7 : Power

i8 : T#0#0

o8 = 8

o8 : R

i9 : T#0#1

o9 = 1

i10 : 
