-- -*- M2-comint -*-

i1 : X = new Type of MutableHashTable

o1 = X

o1 : Type

i2 : x = new X

o2 = X{}

o2 : X

i3 : X.GlobalAssignHook = globalAssignFunction

o3 = globalAssignFunction

o3 : FunctionClosure

i4 : X.GlobalReleaseHook = globalReleaseFunction

o4 = globalReleaseFunction

o4 : FunctionClosure

i5 : x' = new X

o5 = X{}

o5 : X

i6 : t = {x,x'}

o6 = {X{}, X{}}

o6 : List

i7 : x = x' = 44

o7 = 44

i8 : t

o8 = {X{}, X{}}

o8 : List

i9 : code globalAssignFunction

o9 = -- startup.m2:169-172
          globalAssignFunction = (X,x) -> (
               if not ReverseDictionary#?x then ReverseDictionary#x = X;
               use x;
               );

i10 : 
