loaddata: map has appeared or changed its location: 0x00118000-0x001c8000 r-x 4013405781
--package "Macaulay2Core" loaded
--package "PrimaryDecomposition" loaded
--loading the Macaulay2 documentation
--package "Macaulay2" loaded

i1 : R = ZZ/101[x, Degrees => {2}];

i2 : hilbertSeries(R/x^2)

           4
      1 - T
o2 = --------
           2
     (1 - T )

o2 : Divide

i3 : numerator oo

          4
o3 = 1 - T

o3 : ZZ [T, MonomialOrder => RevLex, Inverses => true]

i4 : value oo

          4
o4 = 1 - T

o4 : ZZ [T, MonomialOrder => RevLex, Inverses => true]

i5 : poincare (R/x^2)

          4
o5 = 1 - T

o5 : ZZ [T, MonomialOrder => RevLex, Inverses => true]

i6 : hilbertSeries(R/x^2, Order => 12)

          2
o6 = 1 + T

o6 : ZZ [T, MonomialOrder => RevLex, Inverses => true]

i7 : R=ZZ/101[x, Degrees => {{1,1}}];

i8 : hilbertSeries (R/x^2)

            2 2
       1 - T T
            0 1
o8 = -----------
     (1 - T *T )
           0  1

o8 : Divide

i9 : 
