
i1 : R =ZZ/101[x_0..x_2,Degrees=>{3:{1,1}}];

i2 : V = Proj R;

i3 : hilbertFunction({3,3}, V)

o3 = 10

i4 : basis({3,3}, ring V)

o4 = | x_0^3 x_0^2x_1 x_0^2x_2 x_0x_1^2 x_0x_1x_2 x_0x_2^2 x_1^3 x_1^2x_2
     ---------------------------------------------------------------------------
     x_1x_2^2 x_2^3 |

             1       10
o4 : Matrix R  <--- R

i5 : R =ZZ/101[x_0..x_2];

i6 : V = Proj R;

i7 : hilbertFunction(3, V)

o7 = 10

i8 : basis(3, ring V)

o8 = | x_0^3 x_0^2x_1 x_0^2x_2 x_0x_1^2 x_0x_1x_2 x_0x_2^2 x_1^3 x_1^2x_2
     ---------------------------------------------------------------------------
     x_1x_2^2 x_2^3 |

             1       10
o8 : Matrix R  <--- R

i9 : 
