
i1 : R = ZZ/32003[x,y,z]

o1 = R

o1 : PolynomialRing

i2 : g1 = matrix{{x,y,z}}

o2 = | x y z |

             1       3
o2 : Matrix R  <--- R

i3 : g2 = matrix{{x^2,y^2,z^2}}

o3 = | x2 y2 z2 |

             1       3
o3 : Matrix R  <--- R

i4 : K1 = ker g1

o4 = image {1} | 0  -z -y |
           {1} | -z 0  x  |
           {1} | y  x  0  |

                             3
o4 : R-module, submodule of R

i5 : K2 = ker g2

o5 = image {2} | 0   -z2 -y2 |
           {2} | -z2 0   x2  |
           {2} | y2  x2  0   |

                             3
o5 : R-module, submodule of R

i6 : f = map(ambient K1, ambient K2, {{x,0,0},{0,y,0},{0,0,z}})

o6 = {1} | x 0 0 |
     {1} | 0 y 0 |
     {1} | 0 0 z |

             3       3
o6 : Matrix R  <--- R

i7 : h = inducedMap(K1,K2,f)

o7 = {2} | yz 0  0  |
     {2} | 0  xz 0  |
     {2} | 0  0  xy |

o7 : Matrix

i8 : h1 = inducedMap(target f,K2,f)

o8 = {1} | 0    -xz2 -xy2 |
     {1} | -yz2 0    x2y  |
     {1} | y2z  x2z  0    |

o8 : Matrix

i9 : h2 = inducedMap(,K2,f)

o9 = {1} | 0    -xz2 -xy2 |
     {1} | -yz2 0    x2y  |
     {1} | y2z  x2z  0    |

o9 : Matrix

i10 : h1 == h2

o10 = true

o10 : Boolean

i11 : 
