-- -*- M2-comint -*-

i1 : R = ZZ/101[a..g];

i2 : I = ideal random(R^1, R^{3:-3});

o2 : Ideal of R

i3 : hf = poincare ideal(a^3,b^3,c^3)

           3     6    9
o3 = 1 - 3T  + 3T  - T

o3 : ZZ [T]

i4 : installHilbertFunction(I, hf)

i5 : gbTrace=3

o5 = 3

i6 : time poincare I
     -- used 0. seconds

           3     6    9
o6 = 1 - 3T  + 3T  - T

o6 : ZZ [T]

i7 : time gens gb I;

   -- registering gb 3 at 0xf37450

   -- {3}(3,3)mmm{4}(2,2)mm{5}(3,3)mmm{6}(2,6)mm{7}(1,4)m{8}(0,2)     -- used 0.048003 seconds

             1       11
o7 : Matrix R  <--- R

i8 : R = QQ[a..d];

i9 : I = ideal random(R^1, R^{3:-3});

   -- registering gb 4 at 0xf372e0

o9 : Ideal of R

i10 : time hf = poincare I

   -- registering gb 5 at 0xf37000

number of (nonminimal) gb elements = 11
number of monomials                = 4193

number of (nonminimal) gb elements = 0
number of monomials                = 0

   -- {3}(3)mmm{4}(2)mm{5}(3)mmm{6}(6)mmoooo{7}(4)mooo{8}(2)oo     -- used 0.024001 seconds

            3     6    9
o10 = 1 - 3T  + 3T  - T

o10 : ZZ [T]

i11 : S = QQ[a..d,MonomialOrder=>Eliminate 2]

o11 = S

o11 : PolynomialRing

i12 : J = substitute(I,S)

             10  3   9  2    10    2   7  2    5          2     2    2      
o12 = ideal (--*a  - -*a b + --*a*b  + -*a c + -*a*b*c + b c - a d + -*a*b*d
              7      8        7        4       6                     7      
      -----------------------------------------------------------------------
          2     3    2   3         9            2   1    2   1  3   1    2  
      + 3b d - --*a*c  - -*a*c*d + -*b*c*d + a*d  - -*b*d  + -*c  - -*c*d  -
               10        2         5                5        5      2       
      -----------------------------------------------------------------------
      3  3    8  3     2    4    2   9  3     2    7         2  2      2   
      -*d , - -*a  - 4a b + -*a*b  + -*b  - 2a c - -*a*b*c - -*b c - 8a d +
      5       7             5        8             9         3             
      -----------------------------------------------------------------------
      3         5  2    9    2       2   5                 1    2     3  
      -*a*b*d - -*b d + -*a*c  + 2b*c  - -*a*c*d + b*c*d - -*b*d  - 9c  -
      5         6       5                8                 9             
      -----------------------------------------------------------------------
      4    2   3  3    3   5  2    8  3   3  2             1  2    4  2   
      -*c*d  + -*d , 8a  + -*a b + -*b  + -*a c + 2a*b*c - -*b c - -*a d +
      3        2           4       7      2                4       5      
      -----------------------------------------------------------------------
      4         5  2    7    2   1    2   5         7         4    2      2  
      -*a*b*d + -*b d + -*a*c  - -*b*c  - -*a*c*d + -*b*c*d + -*a*d  - b*d  -
      3         9       6        3        2         2         5              
      -----------------------------------------------------------------------
      2  3   7    2
      -*c  + -*c*d )
      3      5

o12 : Ideal of S

i13 : installHilbertFunction(J, hf)

i14 : gbTrace=3

o14 = 3

i15 : time gens gb J;

   -- registering gb 6 at 0x1925c0

number of (nonminimal) gb elements = 11
number of monomials                = 264

   -- {3}(3,3)mmm{4}(2,2)mm{5}(3,3)mmm{6}(3,7)mmm{7}(3,8)mmm{8}(3,9)mm
removing gb 1 at 0xf375c0
m{9}(3,9)mmm
   -- {10}(2,8)mm{11}(1,5)m{12}(1,3)m{13}(1,3)m{14}(1,3)m{15}(1,3)m{16}(1,3)m{17}(1,3)m
   -- {18}(1,3)m{19}(1,3)m{20}(1,3)m{21}(1,3)m{22}(1,3)m{23}(1,3)m{24}(1,3)m{25}(1,3)m
   -- {26}(1,3)m{27}(1,3)m{28}(0,2)     -- used 0.588036 seconds

              1       39
o15 : Matrix S  <--- S

i16 : selectInSubring(1,gens gb J)

o16 = | 807145693838790437601892837397543941407139348905838130762479767201940
      -----------------------------------------------------------------------
      635648000000c27+6967560599662074549339946807362358971572258917724386579
      -----------------------------------------------------------------------
      167491038400406802366464000c26d+
      -----------------------------------------------------------------------
      30240520406662950644385461420414280370026126233076713050207463901570460
      -----------------------------------------------------------------------
      312770969600c25d2+88523486392708167647721122757821042591280273324755322
      -----------------------------------------------------------------------
      652145943114614191848582220800c24d3+
      -----------------------------------------------------------------------
      21266431313122265026466685526447999771539823607006488281337032596263153
      -----------------------------------------------------------------------
      4902426080000c23d4+4411281187903442255855048378029551360752893432496988
      -----------------------------------------------------------------------
      25931064689398148302472401483200c22d5+
      -----------------------------------------------------------------------
      73733671645985386202136590227403872792409346993560122500061466684876191
      -----------------------------------------------------------------------
      5052927485520c21d6+9439593390263381844376187961670082066589133945142161
      -----------------------------------------------------------------------
      53519078725746490666244803687460c20d7+
      -----------------------------------------------------------------------
      79934124707201075855670661860090959597294140803008409956374711460801792
      -----------------------------------------------------------------------
      4586587542320c19d8+2706573205718660332402484228173862870865840624316363
      -----------------------------------------------------------------------
      36262765432357955914399722870340c18d9-
      -----------------------------------------------------------------------
      14230464984710027634837799286451136156455636958222907777036664612008002
      -----------------------------------------------------------------------
      2613040690700c17d10-679605392681701977330881228306814738739301343591124
      -----------------------------------------------------------------------
      248327060850400819376951609501083c16d11-
      -----------------------------------------------------------------------
      49002142856359517500072285511906870926352423510560584012885942135695056
      -----------------------------------------------------------------------
      1657847005392c15d12-497039388678618535449165384635499725158338507530415
      -----------------------------------------------------------------------
      326545963236817566085547515341508c14d13-
      -----------------------------------------------------------------------
      25310784620687042721241937931658245877474065956284665368466744590088182
      -----------------------------------------------------------------------
      722319386296c13d14+1135496000315902077716539675535654906372930590999563
      -----------------------------------------------------------------------
      53481160649246902697271088529952c12d15+
      -----------------------------------------------------------------------
      30941190183038667200030781864539496071112711373954545309927093889622852
      -----------------------------------------------------------------------
      5118719992480c11d16+210873848496852594263028940852488669258069236417724
      -----------------------------------------------------------------------
      300856989387798043726276854784512c10d17+
      -----------------------------------------------------------------------
      97289533865707119097650167576895749051325284834240294692707802757503417
      -----------------------------------------------------------------------
      614121622016c9d18-33892914553473652380827577714555300517611647199989282
      -----------------------------------------------------------------------
      40624188362180882703409719808c8d19-
      -----------------------------------------------------------------------
      25342191116533627725784287124809628071263125396775282313286621583057599
      -----------------------------------------------------------------------
      605038002176c7d20-11960889511264995833729348586586652466413091684708791
      -----------------------------------------------------------------------
      237638073124531546292094214144c6d21-
      -----------------------------------------------------------------------
      15953972527590626612855850829499955065942955180298712623163983944641534
      -----------------------------------------------------------------------
      63284555776c5d22+206485770758627951557838033722180030821564261925205269
      -----------------------------------------------------------------------
      7076372431255956050711281664c4d23+
      -----------------------------------------------------------------------
      30717076275002265824842077522344502565322154623509426798172503963453051
      -----------------------------------------------------------------------
      2435806208c3d24+2546696843527255828760608975203611666450611670082328904
      -----------------------------------------------------------------------
      3785938883739364874125312c2d25-
      -----------------------------------------------------------------------
      53068817113210343368627350417431074605687006316934328647650989898436511
      -----------------------------------------------------------------------
      263096832cd26+482021315857198942472164810723572879448118538678382564534
      -----------------------------------------------------------------------
      1109516102484780646400d27 |

              1       1
o16 : Matrix S  <--- S

i17 : 

number of (nonminimal) gb elements = 39
number of monomials                = 1048

number of (nonminimal) gb elements = 39
number of monomials                = 1048
