-- -*- M2-comint -*-

i1 : isAffineRing CC

o1 = true

i2 : isAffineRing (ZZ[a,b,c,d])

o2 = false

i3 : isAffineRing (ZZ/101[a,b,c,d])

o3 = true

i4 : isAffineRing (ZZ/2[x,y,z]/(x^2-y*z))

o4 = true

i5 : isAffineRing (QQ[x,dx, WeylAlgebra => {x => dx}])

o5 = true

i6 : 
