--package "Macaulay2Core" loaded
--package "PrimaryDecomposition" loaded
--loading the Macaulay2 documentation
--package "Macaulay2" loaded

i1 : R = QQ[x];

i2 : f = map(F = R^{0}, G = R^{-1}, {{x^3}}, Degree => 2)

o2 = | x3 |

             1       1
o2 : Matrix R  <--- R

i3 : degree f

o3 = {2}

o3 : List

i4 : degree G_0

o4 = {1}

o4 : List

i5 : degree F_0

o5 = {0}

o5 : List

i6 : f * G_0

o6 = | x3 |

      1
o6 : R

i7 : degree (f * G_0)

o7 = {3}

o7 : List

i8 : isHomogeneous f

o8 = true

o8 : Boolean

i9 : 
