-- -*- M2-comint -*-
with packages: Classic, Elimination, LLLBases, PrimaryDecomposition, SchurRings

i1 : lift(4/2,ZZ)

o1 = 2

i2 : R = ZZ[x];

i3 : f = ((x+1)^3*(x+4))/((x+4)*(x+1))

      2
o3 = x  + 2x + 1

o3 : frac(R)

i4 : lift(f,R)

      2
o4 = x  + 2x + 1

o4 : R

i5 : A = QQ[a..d];

i6 : B = A/(a^2-b,c^2-d-a-3);

i7 : f = c^5

                 2
o7 = 2a*c*d + c*d  + 6a*c + b*c + 6c*d + 9c

o7 : B

i8 : lift(f,A)

                 2
o8 = 2a*c*d + c*d  + 6a*c + b*c + 6c*d + 9c

o8 : A

i9 : jf = jacobian ideal f

o9 = {1} | 2cd+6c           |
     {1} | c                |
     {1} | 2ad+d2+6a+b+6d+9 |
     {1} | 2ac+2cd+6c       |

             4       1
o9 : Matrix B  <--- B

i10 : lift(jf,A)

o10 = {1} | 2cd+6c           |
      {1} | c                |
      {1} | 2ad+d2+6a+b+6d+9 |
      {1} | 2ac+2cd+6c       |

              4       1
o10 : Matrix A  <--- A

i11 : use B;

i12 : g = (a^2+2*a-3)-(a+1)^2

o12 = -4

o12 : B

i13 : lift(g,A)

o13 = -4

o13 : A

i14 : lift(g,QQ)

o14 = -4

o14 : QQ

i15 : lift(lift(g,QQ),ZZ)

o15 = -4

i16 : 
