--package "Macaulay2Core" loaded
--package "PrimaryDecomposition" loaded
--loading the Macaulay2 documentation
--package "Macaulay2" loaded

i1 : i = 22;

i2 : f = () -> (i := 0; while i<9 do (<< i << " "; i=i+1); <<endl;)

o2 = f

o2 : Function

i3 : f()
0 1 2 3 4 5 6 7 8 

i4 : i

o4 = 22

i5 : f = () -> (i := 0; () -> i = i+1)
--warning: f redefined

o5 = f

o5 : Function

i6 : p = f()

o6 = p

o6 : Function

i7 : q = f()

o7 = q

o7 : Function

i8 : p(),p(),p(),p(),q(),p(),p(),q(),p(),p()

o8 = (1, 2, 3, 4, 1, 5, 6, 2, 7, 8)

o8 : Sequence

i9 : 
