-- -*- M2-comint -*-

i1 : ff := 5

o1 = 5

i2 : ff

o2 = 5

i3 : h = () -> j

o3 = h

o3 : Function

i4 : h()

o4 = j

o4 : Symbol

i5 : j = 444

o5 = 444

i6 : h()

o6 = 444

i7 : j := 555

o7 = 555

i8 : h()

o8 = 444

i9 : j

o9 = 555

i10 : 
