
i1 : i = 0;

i2 : while i < 20 do (<< " " << i; i = i + 1)
 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19
i3 : i = 0;

i4 : while (<< " " << i; i < 20) do i = i+1
 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20
i5 : i = 1; while (i = 2*i; i < 100) list i

o6 = {2, 4, 8, 16, 32, 64}

o6 : List

i7 : i = 1; while i < 100 list i do i = 2*i

o8 = {1, 2, 4, 8, 16, 32, 64}

o8 : List

i9 : i = List; while i =!= Thing list i do i = parent i

o10 = {List, VisibleList, BasicList}

o10 : List

i11 : i = 0; while true do (j = i!; if j > 1000000 then break j else i = i+1)

o12 = 3628800

i13 : for i do (k := i!; if k > 1000000 then break k)

o13 = 3628800

i14 : for i from 10 to 30 when i<15 list 100*i do print i
10
11
12
13
14

o14 = {1000, 1100, 1200, 1300, 1400}

o14 : List

i15 : 
