-- -*- M2-comint -*-

i1 : sq = i -> i^2

o1 = sq

o1 : Function

i2 : sq 10

o2 = 100

i3 : sq(5+5)

o3 = 100

i4 : tm = (i,j) -> i*j

o4 = tm

o4 : Function

i5 : tm(5,7)

o5 = 35

i6 : (i -> i^2) 7

o6 = 49

i7 : sincos = sin @@ cos

o7 = sincos

o7 : Function

i8 : sincos 2.2

o8 = -0.555115

o8 : RR

i9 : sin(cos(2.2))

o9 = -0.555115

o9 : RR

i10 : compose = (f,g) -> x -> f(g(x))

o10 = compose

o10 : Function

i11 : sincos = compose(sin,cos)
--warning: sincos redefined

o11 = sincos

o11 : Function

i12 : cossin = compose(cos,sin)

o12 = cossin

o12 : Function

i13 : sincos 2.2

o13 = -0.555115

o13 : RR

i14 : cossin 2.2

o14 = 0.690587

o14 : RR

i15 : 
