--package "Macaulay2Core" loaded
--package "PrimaryDecomposition" loaded
--loading the Macaulay2 documentation
--package "Macaulay2" loaded

i1 : R = ZZ[x,y];

i2 : S = ZZ[a,b,c];

i3 : f = map(R,S,matrix {{x^2,x*y,y^2}})

               2        2
o3 = map(R,S,{x , x*y, y })

o3 : RingMap R <--- S

i4 : f(a+b+c^2)

      4    2
o4 = y  + x  + x*y

o4 : R

i5 : g = map(R,S,matrix {{1,2,3},{4,5,6}})

o5 = map(R,S,{x + 4y, 2x + 5y, 3x + 6y})

o5 : RingMap R <--- S

i6 : g(a+b)

o6 = 3x + 9y

o6 : R

i7 : S = ZZ[a][b,c];

i8 : h = map(S,S,matrix {{b,c,a}})

o8 = map(S,S,{b, c, a})

o8 : RingMap S <--- S

i9 : h(a^7 + b^3 + c)

      3        7
o9 = b  + c + a

o9 : S

i10 : k = map(S,S,matrix {{c,b}})

o10 = map(S,S,{a, c, b})

o10 : RingMap S <--- S

i11 : k(a^7 + b^3 + c)

       7        3
o11 = b  + c + a

o11 : S

i12 : 
