-- -*- M2-comint -*-
with packages: Classic, Elimination, LLLBases, PrimaryDecomposition, SchurRings

i1 : R = QQ[a..f];

i2 : F = matrix{{a,b,d,e},{b,c,e,f}}

o2 = | a b d e |
     | b c e f |

             2       4
o2 : Matrix R  <--- R

i3 : M = ker F

o3 = image {1} | 0      e2-df  ce-bf  cd-be  |
           {1} | e2-df  0      -be+af -bd+ae |
           {1} | -ce+bf -be+af 0      b2-ac  |
           {1} | cd-be  bd-ae  b2-ac  0      |

                             4
o3 : R-module, submodule of R

i4 : coker F

o4 = cokernel | a b d e |
              | b c e f |

                            2
o4 : R-module, quotient of R

i5 : image F

o5 = image | a b d e |
           | b c e f |

                             2
o5 : R-module, submodule of R

i6 : generators M

o6 = {1} | 0      e2-df  ce-bf  cd-be  |
     {1} | e2-df  0      -be+af -bd+ae |
     {1} | -ce+bf -be+af 0      b2-ac  |
     {1} | cd-be  bd-ae  b2-ac  0      |

             4       4
o6 : Matrix R  <--- R

i7 : relations M

o7 = 0

             4
o7 : Matrix R  <--- 0

i8 : presentation M

o8 = {3} | b  a  |
     {3} | -c -b |
     {3} | e  d  |
     {3} | -f -e |

             4       2
o8 : Matrix R  <--- R

i9 : 
