-- -*- M2-comint -*-

i1 : x = {a,b,c,d,e};

i2 : member(c,x)

o2 = true

i3 : member(f,x)

o3 = false

i4 : 
