
i1 : R=ZZ/101[a,b,c]

o1 = R

o1 : PolynomialRing

i2 : (a+b+c+1)^2

      2           2                  2
o2 = a  + 2a*b + b  + 2a*c + 2b*c + c  + 2a + 2b + 2c + 1

o2 : R

i3 : b^2 > a*c

o3 = true

o3 : Boolean

i4 : b^2 ? a*c

o4 = >

o4 : Keyword

i5 : sort {1_R, a, a^2, b, b^2, a*b, a^3, b^3}

          3   2         3        2
o5 = {1, a , b , b, a, b , a*b, a }

o5 : List

i6 : R=ZZ/101[x,y,z,MonomialOrder=>RevLex];

i7 : R=ZZ/101[a,b,c,MonomialOrder=>GLex];

i8 : (a+b+c+1)^2

      2                  2           2
o8 = a  + 2a*b + 2a*c + b  + 2b*c + c  + 2a + 2b + 2c + 1

o8 : R

i9 : R=ZZ/101[a,b,c,MonomialOrder=>Lex];

i10 : (a+b+c+1)^2

       2                       2                2
o10 = a  + 2a*b + 2a*c + 2a + b  + 2b*c + 2b + c  + 2c + 1

o10 : R

i11 : R=ZZ/101[a,b,c,MonomialOrder=>Eliminate 2];

i12 : (a+b+c+1)^2

       2           2                            2
o12 = a  + 2a*b + b  + 2a*c + 2b*c + 2a + 2b + c  + 2c + 1

o12 : R

i13 : R=ZZ/101[a,b,c,MonomialOrder=>ProductOrder{1,2}];

i14 : (a+b+c+1)^2

       2                       2           2
o14 = a  + 2a*b + 2a*c + 2a + b  + 2b*c + c  + 2b + 2c + 1

o14 : R

i15 : 
