
i1 : "a string"

o1 = a string

i2 : net "a string"

o2 = a string

i3 : ZZ[x];

i4 : x^2

      2
o4 = x

o4 : ZZ [x]

i5 : net x^2

      2
o5 = x

i6 : 
