--warning: checksum has changed for a map
--package "Macaulay2Core" loaded
--package "PrimaryDecomposition" loaded
--loading the Macaulay2 documentation
--package "Macaulay2" loaded

i1 : A = ZZ/101[x,y];

i2 : M = cokernel random(A^3, A^{-2,-2})

o2 = cokernel | 42x2-50xy+39y2 -39x2+30xy+19y2 |
              | 9x2-15xy-22y2  -38x2+2xy-4y2   |
              | 50x2+45xy-29y2 -36x2-16xy-6y2  |

                            3
o2 : A-module, quotient of A

i3 : R = cokernel matrix {{x^3,y^4}}

o3 = cokernel | x3 y4 |

                            1
o3 : A-module, quotient of A

i4 : N = prune (M**R)

o4 = cokernel | x2+21xy-5y2     -25xy-6y2      0  16y3           xy2+y3      y4 0  0  |
              | 20xy-5y2        x2+6xy-24y2    0  -12xy2+45y3    18xy2-37y3  0  y4 0  |
              | -41x2-26xy+17y2 -50x2-42xy-4y2 x3 x2y-16xy2+50y3 -12xy2-19y3 0  0  y4 |

                            3
o4 : A-module, quotient of A

i5 : C = resolution N

      3      8      5
o5 = A  <-- A  <-- A  <-- 0
                           
     0      1      2      3

o5 : ChainComplex

i6 : d = C.dd

          3                                                                                          8
o6 = 0 : A  <-------------------------------------------------------------------------------------- A  : 1
               | -30xy+27y2      x2+17xy-8y2   -26x2y+17xy2  25xy2+47y3     xy2+10y3   0  0  y4 |
               | x2-11xy-45y2    2x2+12xy-48y2 20x2y-5xy2    33xy2+22y3     49xy2-39y3 0  y4 0  |
               | -16x2+43xy-27y2 -50xy-12y2    x3+21x2y-5xy2 x2y+21xy2+45y3 42xy2+42y3 y4 0  0  |

          8                                                                             5
     1 : A  <------------------------------------------------------------------------- A  : 2
               {2} | 46xy2-44y3     35xy2+30y3     -46y3      21y3      -6y3       |
               {2} | 2xy2-38y3      -28xy2-3y3     -2y3       48y3      -46y3      |
               {3} | -9xy+11y2      45xy+7y2       9y2        -34y2     -25y2      |
               {3} | 9x2-12xy-7y2   -45x2+48xy-5y2 -9xy+y2    34xy+36y2 25xy+12y2  |
               {3} | 44x2+48xy-10y2 43xy+31y2      -44xy+46y2 36xy-42y2 -17xy+24y2 |
               {4} | 0              0              x-11y      -26y      -40y       |
               {4} | 0              0              10y        x+11y     12y        |
               {4} | 0              0              12y        -41y      x          |

          5
     2 : A  <----- 0 : 3
               0

o6 : ChainComplexMap

i7 : s = nullhomotopy (x^3 * id_C)

          8                             3
o7 = 1 : A  <------------------------- A  : 0
               {2} | -2x x+11y 29y |
               {2} | x   42y   26y |
               {3} | -32 16    1   |
               {3} | 0   -1    39  |
               {3} | 0   49    42  |
               {4} | 0   0     0   |
               {4} | 0   0     0   |
               {4} | 0   0     0   |

          5                                                                                 8
     2 : A  <----------------------------------------------------------------------------- A  : 1
               {5} | 44  -16 22x -22y    -39x+24y xy+17y2      -10xy+25y2   44xy-22y2  |
               {5} | -41 -1  12x -9x+34y -28x+19y -20y2        xy+39y2      -49xy+36y2 |
               {5} | 0   0   0   0       0        x2+11xy-13y2 26xy+24y2    40xy+27y2  |
               {5} | 0   0   0   0       0        -10xy+43y2   x2-11xy-25y2 -12xy+35y2 |
               {5} | 0   0   0   0       0        -12xy-37y2   41xy+45y2    x2+38y2    |

                   5
     3 : 0 <----- A  : 2
              0

o7 : ChainComplexMap

i8 : s*d + d*s

          3                    3
o8 = 0 : A  <---------------- A  : 0
               | x3 0  0  |
               | 0  x3 0  |
               | 0  0  x3 |

          8                                       8
     1 : A  <----------------------------------- A  : 1
               {2} | x3 0  0  0  0  0  0  0  |
               {2} | 0  x3 0  0  0  0  0  0  |
               {3} | 0  0  x3 0  0  0  0  0  |
               {3} | 0  0  0  x3 0  0  0  0  |
               {3} | 0  0  0  0  x3 0  0  0  |
               {4} | 0  0  0  0  0  x3 0  0  |
               {4} | 0  0  0  0  0  0  x3 0  |
               {4} | 0  0  0  0  0  0  0  x3 |

          5                              5
     2 : A  <-------------------------- A  : 2
               {5} | x3 0  0  0  0  |
               {5} | 0  x3 0  0  0  |
               {5} | 0  0  x3 0  0  |
               {5} | 0  0  0  x3 0  |
               {5} | 0  0  0  0  x3 |

     3 : 0 <----- 0 : 3
              0

o8 : ChainComplexMap

i9 : s^2

          5         3
o9 = 2 : A  <----- A  : 0
               0

                   8
     3 : 0 <----- A  : 1
              0

o9 : ChainComplexMap

i10 : 
