-- -*- M2-comint -*-

i1 : A = ZZ/101[x,y];

i2 : M = cokernel random(A^3, A^{-2,-2})

o2 = cokernel | 42x2-50xy+39y2 -39x2+30xy+19y2 |
              | 9x2-15xy-22y2  -38x2+2xy-4y2   |
              | 50x2+45xy-29y2 -36x2-16xy-6y2  |

                            3
o2 : A-module, quotient of A

i3 : R = cokernel matrix {{x^3,y^4}}

o3 = cokernel | x3 y4 |

                            1
o3 : A-module, quotient of A

i4 : N = prune (M**R)

o4 = cokernel | -30xy+27y2      x2-24xy+39y2   xy2+10y3   -y3           0  0 
              | x2-11xy-45y2    34xy+42y2      49xy2-39y3 20xy2-13y3    0  0 
              | -16x2+43xy-27y2 32x2-35xy+42y2 42xy2+42y3 x2y-19xy2+5y3 x3 y4
     ------------------------------------------------------------------------
     0  y4 |
     y4 0  |
     0  0  |

                            3
o4 : A-module, quotient of A

i5 : C = resolution N

      3      8      5
o5 = A  <-- A  <-- A  <-- 0
                           
     0      1      2      3

o5 : ChainComplex

i6 : d = C.dd

          3                                                                  
o6 = 0 : A  <----------------------------------------------------------------
               | -25xy-6y2      x2+21xy-5y2     -35x2y+42xy2   -33xy2-17y3   
               | x2+6xy-24y2    20xy-5y2        34x2y+42xy2    -47y3         
               | -50x2-42xy-4y2 -41x2-26xy+17y2 x3-24x2y+39xy2 x2y-24xy2-30y3

          8                                                                  
     1 : A  <----------------------------------------------------------------
               {2} | -8xy2           -34xy2-28y3  8y3        43y3       29y3 
               {2} | 13xy2+26y3      2xy2-27y3    -13y3      -4y3       17y3 
               {3} | 15xy+24y2       xy-8y2       -15y2      20y2       -35y2
               {3} | -15x2+10xy+16y2 -x2+6xy-13y2 15xy-34y2  -20xy-11y2 35xy-
               {3} | 17x2-29xy-2y2   4xy-19y2     -17xy-50y2 44xy-24y2  14xy+
               {4} | 0               0            x          -41y       12y  
               {4} | 0               0            12y        x+11y      10y  
               {4} | 0               0            -40y       -26y       x-11y

          5
     2 : A  <----- 0 : 3
               0
     ------------------------------------------------------------------------
                                8
     ------------------------- A  : 1
      xy2+y3      0  0  y4 |
      18xy2-37y3  0  y4 0  |
      -12xy2-19y3 y4 0  0  |

               5
     -------- A  : 2
          |
          |
          |
     8y2  |
     33y2 |
          |
          |
          |

o6 : ChainComplexMap

i7 : s = nullhomotopy (x^3 * id_C)

          8                             3
o7 = 1 : A  <------------------------- A  : 0
               {2} | 0  x+11y -34y |
               {2} | x  -43y  35y  |
               {3} | 41 50    1    |
               {3} | 0  29    -39  |
               {3} | 0  41    15   |
               {4} | 0  0     0    |
               {4} | 0  0     0    |
               {4} | 0  0     0    |

          5                                                                  
     2 : A  <----------------------------------------------------------------
               {5} | 12  -47 11x 35y    6x-28y  xy-21y2    39xy-9y2     17xy+
               {5} | -19 -19 -2x -x+36y 11x+41y 12y2       xy+43y2      -18xy
               {5} | 0   0   0   0      0       x2+38y2    41xy+45y2    -12xy
               {5} | 0   0   0   0      0       -12xy+35y2 x2-11xy-25y2 -10xy
               {5} | 0   0   0   0      0       40xy+27y2  26xy+24y2    x2+11

                   5
     3 : 0 <----- A  : 2
              0
     ------------------------------------------------------------------------
                  8
     ----------- A  : 1
     48y2    |
     +42y2   |
     -37y2   |
     +43y2   |
     xy-13y2 |

o7 : ChainComplexMap

i8 : s*d + d*s

          3                    3
o8 = 0 : A  <---------------- A  : 0
               | x3 0  0  |
               | 0  x3 0  |
               | 0  0  x3 |

          8                                       8
     1 : A  <----------------------------------- A  : 1
               {2} | x3 0  0  0  0  0  0  0  |
               {2} | 0  x3 0  0  0  0  0  0  |
               {3} | 0  0  x3 0  0  0  0  0  |
               {3} | 0  0  0  x3 0  0  0  0  |
               {3} | 0  0  0  0  x3 0  0  0  |
               {4} | 0  0  0  0  0  x3 0  0  |
               {4} | 0  0  0  0  0  0  x3 0  |
               {4} | 0  0  0  0  0  0  0  x3 |

          5                              5
     2 : A  <-------------------------- A  : 2
               {5} | x3 0  0  0  0  |
               {5} | 0  x3 0  0  0  |
               {5} | 0  0  x3 0  0  |
               {5} | 0  0  0  x3 0  |
               {5} | 0  0  0  0  x3 |

     3 : 0 <----- 0 : 3
              0

o8 : ChainComplexMap

i9 : s^2

          5         3
o9 = 2 : A  <----- A  : 0
               0

                   8
     3 : 0 <----- A  : 1
              0

o9 : ChainComplexMap

i10 : 
