-- -*- M2-comint -*-

i1 : R = QQ[x_1 .. x_10, MonomialOrder=>{4,6}];

i2 : options R

o2 = OptionTable{Adjust => identity                                                       }
                 DegreeRank => 1
                 Degrees => {{1}, {1}, {1}, {1}, {1}, {1}, {1}, {1}, {1}, {1}}
                 Heft => 
                 Inverses => false
                 MonomialOrder => {GRevLex => {1, 1, 1, 1}, GRevLex => {1, 1, 1, 1, 1, 1}}
                 MonomialSize => 32
                 Repair => identity
                 SkewCommutative => false
                 VariableBaseName => 
                 VariableOrder => 
                 Variables => {x , x , x , x , x , x , x , x , x , x  }
                                1   2   3   4   5   6   7   8   9   10
                 Weights => {}
                 WeylAlgebra => {}

o2 : OptionTable

i3 : (options R).MonomialOrder

o3 = {GRevLex => {1, 1, 1, 1}, GRevLex => {1, 1, 1, 1, 1, 1}}

o3 : List

i4 : S = QQ[a..d];

i5 : (options S).MonomialOrder

o5 = {GRevLex => {1, 1, 1, 1}}

o5 : List

i6 : 
     
