-- -*- M2-comint -*-

i1 : R4 = ZZ/32003[a..d];

i2 : R5 = ZZ/32003[a..e];

i3 : R6 = ZZ/32003[a..f];

i4 : M = coker genericMatrix(R6,a,2,3)

o4 = cokernel | a c e |
              | b d f |

                              2
o4 : R6-module, quotient of R6

i5 : pdim M

o5 = 2

i6 : G = map(R6,R5,{a+b+c+d+e+f,b,c,d,e})

o6 = map(R6,R5,{a + b + c + d + e + f, b, c, d, e})

o6 : RingMap R6 <--- R5

i7 : F = map(R5,R4,random(R5^1, R5^{4:-1}))

o7 = map(R5,R4,{- 2136a + 9349b + 8735c - 5609d - 9489e, 13529a - 15802b -
     ------------------------------------------------------------------------
     371c - 545d - 2519e, - 11250a - 14212b - 1270c - 1415d + 626e, 1414a -
     ------------------------------------------------------------------------
     3327b - 4035c + 11874d - 13874e})

o7 : RingMap R5 <--- R4

i8 : P = pushForward(G,M)

o8 = cokernel | c -de               |
              | d bc-ad+bd+cd+d2+de |

                              2
o8 : R5-module, quotient of R5

i9 : pdim P

o9 = 1

i10 : Q = pushForward(F,P)

        3
o10 = R4

o10 : R4-module, free, degrees {0, 1, 0}

i11 : pdim Q

o11 = 0

i12 : P3 = QQ[a..d];

i13 : M = comodule monomialCurveIdeal(P3,{1,2,3})

o13 = cokernel | c2-bd bc-ad b2-ac |

                               1
o13 : P3-module, quotient of P3

i14 : P2 = QQ[a,b,c];

i15 : F = map(P3,P2,random(P3^1, P3^{-1,-1,-1}))

                   4     7     1     4    1           1     2    1     5    
o15 = map(P3,P2,{- -*a - -*b + -*c - -*d, -*a - 10b + -*c + -*d, -*a - -*b +
                   3     4     3     7    3           2     3    6     2    
      -----------------------------------------------------------------------
      4     3
      -*c - -*d})
      5     7

o15 : RingMap P3 <--- P2

i16 : N = pushForward(F,M)

o16 = cokernel {0} | 2656917701760ab-10469713102485b2-19480974893520ac+
               {1} | 174463172216509a+34145265519502b-424591228267800c 
      -----------------------------------------------------------------------
      124761250805520bc-320980765121100c2
                                         
      -----------------------------------------------------------------------
      15941506210560a2-263964231567435b2-235748051285040ac+3190889781614640bc
      4452003890453283a+850560504667634b-10664548918301800c                  
      -----------------------------------------------------------------------
      -8232163444715700c2 47556746041783198147247976600b3-3266000804987747522
                          3030691636179136091868892505088a2-35394118550240374
      -----------------------------------------------------------------------
      49259019025b2c+537312166448676125440515750000ac2-
      5325431808344ab-125231488021456451390895785744b2-
      -----------------------------------------------------------------------
      1601588554558040514436183155600bc2+8427620794366323456215544574500c3
      12432772069619775056984451518055ac+381273630948409356717609893750bc+
      -----------------------------------------------------------------------
                                        
      15922339816835248068146389280200c2
      -----------------------------------------------------------------------
      0                                                          
      100977092876a3-409697805174a2b-61747335300ab2-3921307047b3+
      -----------------------------------------------------------------------
                                                                         
      1409849608320a2c+1383660568605abc+118321299740b2c-4170251969850ac2-
      -----------------------------------------------------------------------
                                       |
      1175517119000bc2+2620973787000c3 |

                               2
o16 : P2-module, quotient of P2

i17 : hilbertPolynomial M

o17 = - 2*P  + 3*P
           0      1

o17 : ProjectiveHilbertPolynomial

i18 : hilbertPolynomial N

o18 = - 2*P  + 3*P
           0      1

o18 : ProjectiveHilbertPolynomial

i19 : ann N

                         3                2                  2              3
o19 = ideal(100977092876a  - 409697805174a b - 61747335300a*b  - 3921307047b 
      -----------------------------------------------------------------------
                      2                                      2   
      + 1409849608320a c + 1383660568605a*b*c + 118321299740b c -
      -----------------------------------------------------------------------
                      2                   2                 3
      4170251969850a*c  - 1175517119000b*c  + 2620973787000c )

o19 : Ideal of P2

i20 : 
