-- -*- M2-comint -*-

i1 : n = 6

o1 = 6

i2 : S = ZZ/101[vars(0..n-1)];

i3 : i1 = monomialCurveIdeal(S, 1..n-1)

             2                                          2                  
o3 = ideal (e  - d*f, d*e - c*f, c*e - b*f, b*e - a*f, d  - b*f, c*d - a*f,
     ------------------------------------------------------------------------
                 2                    2
     b*d - a*e, c  - a*e, b*c - a*d, b  - a*c)

o3 : Ideal of S

i4 : i2 = monomialCurveIdeal(S, 1..n-1)

             2                                          2                  
o4 = ideal (e  - d*f, d*e - c*f, c*e - b*f, b*e - a*f, d  - b*f, c*d - a*f,
     ------------------------------------------------------------------------
                 2                    2
     b*d - a*e, c  - a*e, b*c - a*d, b  - a*c)

o4 : Ideal of S

i5 : j1 = ideal(map(S^1,S^n, (p,q)->S_q^5))

             5   5   5   5   5   5
o5 = ideal (a , b , c , d , e , f )

o5 : Ideal of S

i6 : j2 = ideal(map(S^1,S^n, (p,q)->S_q^5))

             5   5   5   5   5   5
o6 = ideal (a , b , c , d , e , f )

o6 : Ideal of S

i7 : time quotient(i1^3,j1^2,Strategy=>Iterate);
     -- used 1.5201 seconds

o7 : Ideal of S

i8 : time quotient(i2^3,j2^2,Strategy=>Quotient);
     -- used 2.49616 seconds

o8 : Ideal of S

i9 : S =ZZ/101[vars(0..4)];

i10 : i =ideal vars S;

o10 : Ideal of S

i11 : j =ideal vars S;

o11 : Ideal of S

i12 : i3 = i^3; i5 = i^5;

o12 : Ideal of S

o13 : Ideal of S

i14 : j3 = j^3; j5 = j^5;

o14 : Ideal of S

o15 : Ideal of S

i16 : time quotient(i5,i3,Strategy=>Iterate);
     -- used 0.092006 seconds

o16 : Ideal of S

i17 : time quotient(j5,j3,Strategy=>Quotient);
     -- used 0.032002 seconds

o17 : Ideal of S

i18 : 
