-- -*- M2-comint -*-
with packages: Classic, Elimination, LLLBases, PrimaryDecomposition, SchurRings

i1 : 1 .. 5, y_1 .. y_5, a .. e

o1 = ((1, 2, 3, 4, 5), (y , y , y , y , y ), (a, b, c, d, e))
                         1   2   3   4   5

o1 : Sequence

i2 : 12:a

o2 = (a, a, a, a, a, a, a, a, a, a, a, a)

o2 : Sequence

i3 : 1:a

o3 = 1 : (a)

o3 : Sequence

i4 : (a)

o4 = a

o4 : Symbol

i5 : z = {3 .. 6, 9, 3:12}

o5 = {(3, 4, 5, 6), 9, (12, 12, 12)}

o5 : List

i6 : splice z

o6 = {3, 4, 5, 6, 9, 12, 12, 12}

o6 : List

i7 : flatten {a,{b,c}}

o7 = {a, b, c}

o7 : List

i8 : splice {a,(b,c)}

o8 = {a, b, c}

o8 : List

i9 : 1..6

o9 = (1, 2, 3, 4, 5, 6)

o9 : Sequence

i10 : toList(1..6)

o10 = {1, 2, 3, 4, 5, 6}

o10 : List

i11 : QQ[a..c,x_1..x_4, Degrees => { 3:1, 4:2 }]

o11 = QQ [a, b, c, x , x , x , x , Degrees => {{1}, {1}, {1}, {2}, {2}, {2}, {2}}]
                    1   2   3   4

o11 : PolynomialRing

i12 : degrees oo

o12 = {{1}, {1}, {1}, {2}, {2}, {2}, {2}}

o12 : List

i13 : 
