-- -*- M2-comint -*-

i1 : help "jacobian"

o1 = jacobian -- the Jacobian matrix of partial derivatives
     ******************************************************

     Description
     ===========



     See also
     ========

       * "diff" -- differentiate or take difference
       * "contract" -- contract one matrix by another

     Ways to use jacobian :
     ======================

       * "jacobian(Ideal)" -- the Jacobian matrix of the generators of an
         ideal
       * jacobian(MonomialIdeal), see "jacobian(Ideal)" -- the Jacobian
         matrix of the generators of an ideal
       * "jacobian(Matrix)" -- the matrix of partial derivatives of
         polynomials in a matrix
       * "jacobian(Ring)" -- the Jacobian matrix of the polynomials defining
         a quotient ring

o1 : DIV

i2 : * "jacobian(Ideal)"

o2 = jacobian(Ideal) -- the Jacobian matrix of the generators of an ideal
     ********************************************************************

     Synopsis
     ========

       * Usage: jacobian I
       * Function: "jacobian"
       * Inputs:
           * I, an ideal,  in a polynomial ring
       * Outputs:
           * a matrix, the Jacobian matrix of partial derivatives of the
             generators of I

     Description
     ===========

     This is identical to jacobian generators I.  See "jacobian(Matrix)" for
     more information.

     +-----------------------------+
     |R = QQ[x,y,z];               |
     +-----------------------------+
     |I = ideal(y^2-x*(x-1)*(x-13))|
     +-----------------------------+
     |jacobian I                   |
     +-----------------------------+

     If the ring of I is a polynomial ring over a polynomial ring, then
     indeterminates in the coefficient ring are treated as constants.

     +---------------------------------+
     |R = ZZ[a,b,c][x,y,z]             |
     +---------------------------------+
     |jacobian ideal(a*y*z+b*x*z+c*x*y)|
     +---------------------------------+

o2 : DIV

i3 : apropos "deal"

o3 = {fittingIdeal, graphIdeal, Ideal, ideal, isIdeal, isMonomialIdeal,
     ------------------------------------------------------------------------
     monomialCurveIdeal, MonomialIdeal, monomialIdeal, monomialSubideal}

o3 : List

i4 : examples "jacobian(Ideal)"

o4 = R = QQ[x,y,z];
     I = ideal(y^2-x*(x-1)*(x-13))
     jacobian I
     R = ZZ[a,b,c][x,y,z]
     jacobian ideal(a*y*z+b*x*z+c*x*y)

i5 : print examples "jacobian(Ideal)"
R = QQ[x,y,z];
I = ideal(y^2-x*(x-1)*(x-13))
jacobian I
R = ZZ[a,b,c][x,y,z]
jacobian ideal(a*y*z+b*x*z+c*x*y)

i6 : 
