-- -*- M2-comint -*-

i1 : regex("d", "1abcddddeF2")

o1 = {(4, 1)}

o1 : List

i2 : regex("d*", "1abcddddeF2")

o2 = {(0, 0)}

o2 : List

i3 : regex("d+", "1abcddddeF2")

o3 = {(4, 4)}

o3 : List

i4 : regex("d+", "1abceF2")

i5 : regex("cdd+e", "1abcddddeF2")

o5 = {(3, 6)}

o5 : List

i6 : regex("cd(d+)e", "1abcddddeF2")

o6 = {(3, 6), (5, 3)}

o6 : List

i7 : regex("[a-z]+", "1abcddddeF2")

o7 = {(1, 8)}

o7 : List

i8 : regex("[[:alpha:]]+", "Dog cat cat.")

o8 = {(0, 3)}

o8 : List

i9 : regex("([[:alpha:]]+) *\\1","Dog cat cat.")

o9 = {(4, 7), (4, 3)}

o9 : List

i10 : 
