-- -*- M2-comint -*-

i1 : R = ZZ[a..d]

o1 = R

o1 : PolynomialRing

i2 : I = ideal(a,b,c,d)

o2 = ideal (a, b, c, d)

o2 : Ideal of R

i3 : C = res I

      1      4      6      4      1
o3 = R  <-- R  <-- R  <-- R  <-- R  <-- 0
                                         
     0      1      2      3      4      5

o3 : ChainComplex

i4 : C_2

      6
o4 = R

o4 : R-module, free, degrees {2, 2, 2, 2, 2, 2}

i5 : C.dd_2

o5 = {1} | 0  0  0  -d -c -b |
     {1} | 0  -d -c 0  0  a  |
     {1} | -d 0  b  0  a  0  |
     {1} | c  b  0  a  0  0  |

             4       6
o5 : Matrix R  <--- R

i6 : 
