
i1 : R = ZZ/101[a..d,MonomialOrder=>Lex]

o1 = R

o1 : PolynomialRing

i2 : m = matrix{{b^2-c^2, a^2 - b^2, c*d}}

o2 = | b2-c2 a2-b2 cd |

             1       3
o2 : Matrix R  <--- R

i3 : selectInSubring(1,m)

o3 = 0

             1
o3 : Matrix R  <--- 0

i4 : selectInSubring(2,m)

o4 = 0

             1
o4 : Matrix R  <--- 0

i5 : selectInSubring(3,m)

o5 = 0

             1
o5 : Matrix R  <--- 0

i6 : 
