-- -*- M2-comint -*-

i1 : x = new MutableHashTable from { val => 1000 }

o1 = MutableHashTable{...1...}

o1 : MutableHashTable

i2 : g = (t -> (print "hi there"; t.val^4))

o2 = g

o2 : Function

i3 : f = (stashValue VALUE) g

o3 = f

o3 : Function

i4 : f x
hi there

o4 = 1000000000000

i5 : f x

o5 = 1000000000000

i6 : peek x

o6 = MutableHashTable{val => 1000           }
                      VALUE => 1000000000000

i7 : 
