-- -*- M2-comint -*-
with packages: Classic, Elimination, LLLBases, PrimaryDecomposition, SchurRings, TangentCone

i1 : src = temporaryFileName() | "/"

o1 = /tmp/M2-12930-1/

i2 : dst = temporaryFileName() | "/"

o2 = /tmp/M2-12930-2/

i3 : makeDirectory (src|"a/")

i4 : makeDirectory (src|"b/")

i5 : makeDirectory (src|"b/c/")

i6 : src|"a/f" << "hi there" << close

o6 = /tmp/M2-12930-1/a/f

o6 : File

i7 : src|"a/g" << "hi there" << close

o7 = /tmp/M2-12930-1/a/g

o7 : File

i8 : src|"b/c/g" << "ho there" << close

o8 = /tmp/M2-12930-1/b/c/g

o8 : File

i9 : symlinkDirectory(src,dst,Verbose=>true)
--symlinking: ../../M2-12930-1/a/f -> /tmp/M2-12930-2/a/f
--symlinking: ../../M2-12930-1/a/g -> /tmp/M2-12930-2/a/g
--symlinking: ../../../M2-12930-1/b/c/g -> /tmp/M2-12930-2/b/c/g

i10 : get (dst|"b/c/g")

o10 = ho there

i11 : symlinkDirectory(src,dst,Verbose=>true,Undo=>true)
--unsymlinking: ../../M2-12930-1/a/f -> /tmp/M2-12930-2/a/f
--unsymlinking: ../../M2-12930-1/a/g -> /tmp/M2-12930-2/a/g
--unsymlinking: ../../../M2-12930-1/b/c/g -> /tmp/M2-12930-2/b/c/g

i12 : rm = d -> if isDirectory d then removeDirectory d else removeFile d

o12 = rm

o12 : FunctionClosure

i13 : scan(reverse findFiles src, rm)

i14 : scan(reverse findFiles dst, rm)

i15 : 
