-- -*- M2-comint -*-

i1 : P = Proj(QQ[a,b,c])

o1 = P

o1 : ProjectiveVariety

i2 : TP = tangentSheaf(P)

o2 = image {-2} | 0 -c b |
           {-2} | c 0  a |
           {-2} | b a  0 |

                                         3
o2 : coherent sheaf on P, subsheaf of OO  (2)
                                        P

i3 : HH^0(TP(-1))

       3
o3 = QQ

o3 : QQ-module, free

i4 : HH^1(TP(-3))

       1
o4 = QQ

o4 : QQ-module, free

i5 : Node = Proj(QQ[a,b,c]/ideal(b^2*c-a^2*(a+c)))

o5 = Node

o5 : ProjectiveVariety

i6 : Cusp = Proj(QQ[a,b,c]/ideal(b^2*c-a^3))

o6 = Cusp

o6 : ProjectiveVariety

i7 : TNode = tangentSheaf(Node)

o7 = image {-2} | 3a2+2ac 3abc+2bc2 |
           {-2} | 2bc     2a2c+2ac2 |
           {-2} | a2-b2   -a2b      |
           {-3} | a2b     ab2c      |

                                               3             1
o7 : coherent sheaf on Node, subsheaf of OO     (2) ++ OO     (3)
                                           Node          Node

i8 : HH^0(TNode)

       1
o8 = QQ

o8 : QQ-module, free

i9 : HH^1(TNode)

o9 = 0

o9 : QQ-module

i10 : TCusp = tangentSheaf(Cusp)

o10 = image {-2} | 3bc 3a2 |
            {-2} | 2ac 2bc |
            {-2} | -ab -b2 |
            {-3} | b2c a2b |

                                                3             1
o10 : coherent sheaf on Cusp, subsheaf of OO     (2) ++ OO     (3)
                                            Cusp          Cusp

i11 : HH^0(TCusp)

        2
o11 = QQ

o11 : QQ-module, free

i12 : HH^1(TCusp)

o12 = 0

o12 : QQ-module

i13 : 
