-- -*- M2-comint -*-

i1 : setPrecision 200

o1 = 100

i2 : toRRR(1/7)

o2 = .142857142857142857142857142857142857142857142857142857142857142857143*
     ------------------------------------------------------------------------
     10^0

o2 : RRR

i3 : precision oo

o3 = 224

i4 : 
