-- -*- M2-comint -*-

i1 : sin

o1 = sin

o1 : CompiledFunction

i2 : sin 1.2

o2 = 0.932039

o2 : RR

i3 : sin(1.2)

o3 = 0.932039

o3 : RR

i4 : sin(1.0+0.2)

o4 = 0.932039

o4 : RR

i5 : print(10 + 1)^2
121

i6 : append

o6 = append

o6 : CompiledFunction

i7 : append({a,b,c},d)

o7 = {a, b, c, d}

o7 : List

i8 : join

o8 = join

o8 : CompiledFunction

i9 : join({a,b},{c,d},{e,f},{g,h,i})

o9 = {a, b, c, d, e, f, g, h, i}

o9 : List

i10 : ap = append;

i11 : ap({a,b,c},d)

o11 = {a, b, c, d}

o11 : List

i12 : 
