--warning: checksum has changed for a map
--package "Macaulay2Core" loaded
--package "PrimaryDecomposition" loaded
--loading the Macaulay2 documentation
--package "Macaulay2" loaded

i1 : R = QQ[a..d,MonomialOrder=>GRevLex]

o1 = R

o1 : PolynomialRing

i2 : F = a^3 + d^2 + a*d + b*c + 1

      3                2
o2 = a  + b*c + a*d + d  + 1

o2 : R

i3 : R = QQ[a..d,MonomialOrder=>RevLex]

o3 = R

o3 : PolynomialRing

i4 : substitute(F,R)

          2                3
o4 = 1 + d  + b*c + a*d + a

o4 : R

i5 : R = QQ[a..d,MonomialOrder=>Lex]

o5 = R

o5 : PolynomialRing

i6 : substitute(F,R)

      3                2
o6 = a  + a*d + b*c + d  + 1

o6 : R

i7 : R = QQ[a..d,Weights=>{1,1,0,0}]

o7 = R

o7 : PolynomialRing

i8 : substitute(F,R)

      3                2
o8 = a  + b*c + a*d + d  + 1

o8 : R

i9 : R = QQ[a..d,Weights=>{-1,0,0,0}]

o9 = R

o9 : PolynomialRing

i10 : substitute(F,R)

             2              3
o10 = b*c + d  + 1 + a*d + a

o10 : R

i11 : R = QQ[a..d,Weights=>{-1,-1,-1,-1}]

o11 = R

o11 : PolynomialRing

i12 : substitute(F,R)

                       2    3
o12 = 1 + b*c + a*d + d  + a

o12 : R

i13 : R = QQ[a..d,MonomialOrder=>ProductOrder{1,3}]

o13 = R

o13 : PolynomialRing

i14 : substitute(F,R)

       3                2
o14 = a  + a*d + b*c + d  + 1

o14 : R

i15 : leadTerm F

       3
o15 = a

o15 : QQ [a, b, c, d]

i16 : 
