-- -*- M2-comint -*- {* hash: -1257023276 *}

i1 : A = matrix "1,1,1,1; 1,2,3,4"

o1 = | 1 1 1 1 |
     | 1 2 3 4 |

              2        4
o1 : Matrix ZZ  <--- ZZ

i2 : s = temporaryFileName()

o2 = /tmp/M2-80195-1

i3 : F = openOut(s)

o3 = /tmp/M2-80195-1

o3 : File

i4 : putMatrix(F,A)

i5 : close(F)

o5 = /tmp/M2-80195-1

o5 : File

i6 : getMatrix(s)

o6 = | 1 1 1 1 |
     | 1 2 3 4 |

              2        4
o6 : Matrix ZZ  <--- ZZ

i7 : 
