-- -*- M2-comint -*- {* hash: 1413131035 *}

i1 : t = new BettiTally from { (0,{0},0) => 1, (1,{1},1) => 2, (2,{3},3) => 3, (2,{4},4) => 4 }

            0 1 2
o1 = total: 1 2 7
         0: 1 2 .
         1: . . 3
         2: . . 4

o1 : BettiTally

i2 : peek oo

o2 = BettiTally{(0, {0}, 0) => 1}
                (1, {1}, 1) => 2
                (2, {3}, 3) => 3
                (2, {4}, 4) => 4

i3 : t(5)

            0 1 2
o3 = total: 1 2 7
        -5: 1 2 .
        -4: . . 3
        -3: . . 4

o3 : BettiTally

i4 : t[-5]

            5 6 7
o4 = total: 1 2 7
        -5: 1 2 .
        -4: . . 3
        -3: . . 4

o4 : BettiTally

i5 : t ++ oo

            0 1 2 3 4 5 6 7
o5 = total: 1 2 7 . . 1 2 7
        -5: . . . . . 1 2 .
        -4: . . . . . . . 3
        -3: . . . . . . . 4
        -2: . . . . . . . .
        -1: . . . . . . . .
         0: 1 2 . . . . . .
         1: . . 3 . . . . .
         2: . . 4 . . . . .

o5 : BettiTally

i6 : t ** t

            0 1  2  3  4
o6 = total: 1 4 18 28 49
         0: 1 4  4  .  .
         1: . .  6 12  .
         2: . .  8 16  9
         3: . .  .  . 24
         4: . .  .  . 16

o6 : BettiTally

i7 : dual t

            -2 -1 0
o7 = total:  7  2 1
        -2:  4  . .
        -1:  3  . .
         0:  .  2 1

o7 : BettiTally

i8 : regularity t

o8 = 2

i9 : (1/2) * t

              0   1   2
o9 = total: 1/2 1/1 7/2
         0: 1/2 1/1   .
         1:   .   . 3/2
         2:   .   . 2/1

o9 : BettiTally

i10 : 2 * oo

               0   1   2
o10 = total: 1/1 2/1 7/1
          0: 1/1 2/1   .
          1:   .   . 3/1
          2:   .   . 4/1

o10 : BettiTally

i11 : lift(oo,ZZ)

             0 1 2
o11 = total: 1 2 7
          0: 1 2 .
          1: . . 3
          2: . . 4

o11 : BettiTally

i12 : 
0.78user 0.09system 0:00.87elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
