-- -*- M2-comint -*- {* hash: 1359855565 *}

i1 : filename = temporaryFileName () | ".dbm"

o1 = /tmp/M2-16276-1.dbm

i2 : x = openDatabaseOut filename

o2 = /tmp/M2-16276-1.dbm

o2 : Database

i3 : x#"first" = "hi there"

o3 = hi there

i4 : x#"first"

o4 = hi there

i5 : x#"second" = "ho there"

o5 = ho there

i6 : scanKeys(x,print)
second
first

i7 : remove(x,"second")

i8 : scanKeys(x,print)
first

i9 : close x

o9 = 0

i10 : removeFile filename

i11 : 
0.78user 0.06system 0:00.86elapsed 98%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10949minor)pagefaults 0swaps
