-- -*- M2-comint -*-

i1 : R = ZZ/32003[a..d];

i2 : I = monomialCurveIdeal(R,{1,3,4})

                        3      2     2    2    3    2
o2 = ideal (b*c - a*d, c  - b*d , a*c  - b d, b  - a c)

o2 : Ideal of R

i3 : M = R^1/I

o3 = cokernel | bc-ad c3-bd2 ac2-b2d b3-a2c |

                            1
o3 : R-module, quotient of R

i4 : f = inducedMap(R^1,module I)

o4 = | bc-ad c3-bd2 ac2-b2d b3-a2c |

o4 : Matrix

i5 : Ext^1(M,f)

o5 = 0

o5 : Matrix

i6 : g = Ext^2(M,f)

o6 = 0

o6 : Matrix

i7 : source g == Ext^2(M,source f)

o7 = true

i8 : target g == Ext^2(M,target f)

o8 = true

i9 : Ext^3(f,R)

o9 = 0

o9 : Matrix 0 <--- 0

i10 : 
