-- -*- M2-comint -*- {* hash: -221258142 *}

i1 : f = i -> i+1

o1 = f

o1 : FunctionClosure

i2 : g = i -> i^2

o2 = g

o2 : FunctionClosure

i3 : apply(0 .. 10, f @@ g)

o3 = (1, 2, 5, 10, 17, 26, 37, 50, 65, 82, 101)

o3 : Sequence

i4 : apply(0 .. 10, g @@ f)

o4 = (1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121)

o4 : Sequence

i5 : 
0.76user 0.04system 0:00.83elapsed 96%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10840minor)pagefaults 0swaps
