-- -*- M2-comint -*- {* hash: 1690610332 *}

i1 : R = QQ[a..d, MonomialOrder=>GroupRevLex=>2, Global=>false];

i2 : a^-1

      -1
o2 = a

o2 : R

i3 : try c^(-1) else "failed"

o3 = failed

i4 : 
0.80user 0.02system 0:00.83elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10843minor)pagefaults 0swaps
