-- -*- M2-comint -*-

i1 : A = ZZ/5[a]/(a^3-a-2)

o1 = A

o1 : QuotientRing

i2 : B = GF(A,Variable=>a)

o2 = B

o2 : GaloisField

i3 : C = ZZ/5[b]/(b^3+1+3*b^2+b)

o3 = C

o3 : QuotientRing

i4 : D = GF C

o4 = D

o4 : GaloisField

i5 : map(B,D,{a^2})

                2
o5 = map(B,D,{2a  + 2a + 2})

o5 : RingMap B <--- D

i6 : 
