-- -*- M2-comint -*- {* hash: 1407024000 *}

i1 : R = QQ[a..d, MonomialOrder=> GroupLex=>2];

i2 : a^-1

      -1
o2 = a

o2 : R

i3 : try c^(-1) else "failed"

o3 = failed

i4 : 
0.75user 0.04system 0:00.80elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
