-- -*- M2-comint -*-

i1 : R = QQ[x,y,z]/ideal(x^6-z^6-y^2*z^4);

i2 : S = ICfractions R

o2 = | x3/z2 x2/z x y z |

                   QQ [x, y, z]  1             QQ [x, y, z]  5
o2 : Matrix (frac --------------)  <--- (frac --------------)
                   6    2 4    6               6    2 4    6
                  x  - y z  - z               x  - y z  - z

i3 : integralClosure(R,Variable => a)

     QQ [w , w , x, y, z, MonomialOrder => GRevLex => 5]
          7   6
o3 = ---------------------------------------------------
          2                    2         2    2    2
        (x  - w z, w x - w z, w  - w x, w  - y  - z )
               6    6     7    6    7    7

o3 : QuotientRing

i4 : 
