-- -*- M2-comint -*- {* hash: -1474692074 *}

i1 : R = ZZ/101[x,y];

i2 : R^2 ** vars R

o2 = | x y 0 0 |
     | 0 0 x y |

             2       4
o2 : Matrix R  <--- R

i3 : (vars R) ** R^2

o3 = | x 0 y 0 |
     | 0 x 0 y |

             2       4
o3 : Matrix R  <--- R

i4 : R = ZZ/101[t];

i5 : f = matrix {{t}}

o5 = | t |

             1       1
o5 : Matrix R  <--- R

i6 : degrees source f

o6 = {{1}}

o6 : List

i7 : degrees source (f ** R^{-3})

o7 = {{4}}

o7 : List

i8 : 
0.79user 0.03system 0:00.83elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10840minor)pagefaults 0swaps
