-- -*- M2-comint -*-

i1 : R = ZZ[x,y,z];

i2 : use R;

i3 : S = ZZ[x,t];

i4 : x

o4 = x

o4 : S

i5 : R_1

o5 = y

o5 : R

i6 : R_"x"

o6 = x

o6 : R

i7 : x_R

o7 = x

o7 : R

i8 : use R;

i9 : x

o9 = x

o9 : R

i10 : 
