-- -*- M2-comint -*- {* hash: -543452152 *}

i1 : ZZ[x]/367236427846278621

           ZZ [x]
o1 = ------------------
     367236427846278621

o1 : QuotientRing

i2 : A = QQ[u,v];

i3 : I = ideal random(A^1, A^{-2,-2,-2})

            5  2   9       2  2  7  2   7       6  2  3  2   1       10  2
o3 = ideal (-*u  + -*u*v + -*v , -*u  + -*u*v + -*v , -*u  + -*u*v + --*v )
            4      2       5     6      6       5     4      4        3

o3 : Ideal of A

i4 : B = A/I;

i5 : use A;

i6 : C = A/(u^2-v^2,u*v);

i7 : D = GF(9,Variable=>a)[x,y]/(y^2 - x*(x-1)*(x-a))

o7 = D

o7 : QuotientRing

i8 : ambient D

o8 = (GF 9)[x, y]

o8 : PolynomialRing

i9 : ZZ/2 === ZZ/(4,6)

o9 = true

i10 : R = ZZ/101[t]

o10 = R

o10 : PolynomialRing

i11 : R/t === R/t

o11 = false

i12 : 
0.79user 0.03system 0:00.83elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10841minor)pagefaults 0swaps
