-- -*- M2-comint -*- {* hash: -520269371 *}

i1 : set{a,b,c} + set{a,d,f}

o1 = set {f, a, b, c, d}

o1 : Set

i2 : x = apply(3, i -> set apply(3, j -> 10*i+j))

o2 = {set {0, 1, 2}, set {12, 10, 11}, set {20, 21, 22}}

o2 : List

i3 : sum x

o3 = set {0, 1, 2, 20, 21, 22, 10, 11, 12}

o3 : Set

i4 : 
0.76user 0.04system 0:00.91elapsed 88%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
