-- -*- M2-comint -*- {* hash: 202122163 *}

i1 : R = QQ[x,y,z]

o1 = R

o1 : PolynomialRing

i2 : X = Proj R

o2 = X

o2 : ProjectiveVariety

i3 : OO_X(*)

        1
o3 = OO  (*)
       X

o3 : SumOfTwists

i4 : peek oo

                    1
o4 = SumOfTwists{OO  , LowerBound{-infinity}}
                   X

i5 : OO_X(>=2)

        1
o5 = OO  (>=2)
       X

o5 : SumOfTwists

i6 : peek oo

                    1
o6 = SumOfTwists{OO  , LowerBound{2}}
                   X

i7 : Ext^0(OO_X^1, OO_X^1)

       1
o7 = QQ

o7 : QQ-module, free

i8 : Ext^0(OO_X^1, OO_X^1(*))

      1
o8 = R

o8 : R-module, free

i9 : 
0.78user 0.03system 0:00.82elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
