-- -*- M2-comint -*- {* hash: 992375730 *}

i1 : A = QQ[a,b,c];

i2 : f = a+b+a*b+c^3;

i3 : B = QQ[x,y,z];

i4 : F = map(B,A,{x+y, x-y, z})

o4 = map(B,A,{x + y, x - y, z})

o4 : RingMap B <--- A

i5 : g = F f

      3    2    2
o5 = z  + x  - y  + 2x

o5 : B

i6 : A1 = QQ[x,y,c,b,a,z];

i7 : substitute(f,A1)

      3
o7 = c  + b*a + b + a

o7 : A1

i8 : v = take(gens A1, numgens A)

o8 = {x, y, c}

o8 : List

i9 : G = map(A1,A,v)

o9 = map(A1,A,{x, y, c})

o9 : RingMap A1 <--- A

i10 : G f

       3
o10 = c  + x*y + x + y

o10 : A1

i11 : 
0.78user 0.02system 0:00.81elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10848minor)pagefaults 0swaps
