-- -*- M2-comint -*- {* hash: -1380281023 *}

i1 : R = ZZ[x,y,z];

i2 : use R;

i3 : S = ZZ[x,t];

i4 : x

o4 = x

o4 : S

i5 : R_1

o5 = y

o5 : R

i6 : R_"x"

o6 = x

o6 : R

i7 : x_R

o7 = x

o7 : R

i8 : use R;

i9 : x

o9 = x

o9 : R

i10 : 
0.77user 0.06system 0:01.01elapsed 82%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
