-- -*- M2-comint -*- {* hash: 2087156223 *}

i1 : KK = ZZ/31991

o1 = KK

o1 : QuotientRing

i2 : R = KK[x,y,z,w]

o2 = R

o2 : PolynomialRing

i3 : I = ideal(x^2*y,x*y^2+x^3)

             2    3      2
o3 = ideal (x y, x  + x*y )

o3 : Ideal of R

i4 : J = gens gb I

o4 = | x2y x3+xy2 xy3 |

             1       3
o4 : Matrix R  <--- R

i5 : R = KK[a..d]

o5 = R

o5 : PolynomialRing

i6 : I = monomialCurveIdeal(R,{1,3,4})

                        3      2     2    2    3    2
o6 = ideal (b*c - a*d, c  - b*d , a*c  - b d, b  - a c)

o6 : Ideal of R

i7 : codim I

o7 = 2

i8 : dim I

o8 = 2

i9 : codim (R^1/(I*R^1))

o9 = 2

i10 : M = coker gens I

o10 = cokernel | bc-ad c3-bd2 ac2-b2d b3-a2c |

                             1
o10 : R-module, quotient of R

i11 : codim M

o11 = 2

i12 : dim M

o12 = 2

i13 : degree I

o13 = 4

i14 : degree M

o14 = 4

i15 : hilbertPolynomial M

o15 = - 3*P  + 4*P
           0      1

o15 : ProjectiveHilbertPolynomial

i16 : hilbertSeries M

           2     3     4    5
      1 - T  - 3T  + 4T  - T
o16 = -----------------------
                     4
              (1 - T)

o16 : Expression of class Divide

i17 : Mres = res M

       1      4      4      1
o17 = R  <-- R  <-- R  <-- R  <-- 0
                                   
      0      1      2      3      4

o17 : ChainComplex

i18 : betti Mres

             0 1 2 3
o18 = total: 1 4 4 1
          0: 1 . . .
          1: . 1 . .
          2: . 3 4 1

o18 : BettiTally

i19 : R = KK[x,y,z]

o19 = R

o19 : PolynomialRing

i20 : F = random(R^1, R^{-2,-3})

o20 = | 10356x2-1964xy-2356y2+11567xz+15816yz-15382z2
      -----------------------------------------------------------------------
      1851x3-11130x2y-15212xy2-2082y3-1172x2z+8143xyz+11958y2z-2753xz2+
      -----------------------------------------------------------------------
      1278yz2-11906z3 |

              1       2
o20 : Matrix R  <--- R

i21 : GB = gens gb F

o21 = | x2-6475xy+6697y2-6415xz+13050yz+13498z2
      -----------------------------------------------------------------------
      xy2+1221y3+4091xyz+4891y2z+1548xz2+8792yz2-11401z3
      -----------------------------------------------------------------------
      y4+5654y3z-10181xyz2+4785y2z2+1676xz3-14062yz3+8637z4 |

              1       3
o21 : Matrix R  <--- R

i22 : LT = leadTerm gens gb F

o22 = | x2 xy2 y4 |

              1       3
o22 : Matrix R  <--- R

i23 : betti LT

             0 1
o23 = total: 1 3
          0: 1 .
          1: . 1
          2: . 1
          3: . 1

o23 : BettiTally

i24 : R = KK[x,y,z, MonomialOrder => Lex]

o24 = R

o24 : PolynomialRing

i25 : F = random(R^1, R^{-2,-3})

o25 = | -7112x2+15957xy-10531xz-12073y2+8725yz-4112z2
      -----------------------------------------------------------------------
      10683x3+11152x2y-1844x2z+3998xy2+105xyz-11349xz2-13841y3-11924y2z+
      -----------------------------------------------------------------------
      15070yz2-2651z3 |

              1       2
o25 : Matrix R  <--- R

i26 : GB = gens gb F

o26 = | y6+8674y5z-6693y4z2-14904y3z3-11483y2z4+10906yz5+3190z6
      -----------------------------------------------------------------------
      xz4+8948y5+1408y4z+6576y3z2-11687y2z3+12541yz4+13977z5
      -----------------------------------------------------------------------
      xyz2+13007xz3-8599y4+915y3z+15756y2z2-1683yz3-14162z4
      -----------------------------------------------------------------------
      xy2-12807xyz+13391xz2-8841y3-5643y2z+11083yz2+10304z3
      -----------------------------------------------------------------------
      x2-6754xy-14811xz-1973y2-14094yz-8420z2 |

              1       5
o26 : Matrix R  <--- R

i27 : LT = leadTerm gens gb F

o27 = | y6 xz4 xyz2 xy2 x2 |

              1       5
o27 : Matrix R  <--- R

i28 : betti LT

             0 1
o28 = total: 1 5
          0: 1 .
          1: . 1
          2: . 1
          3: . 1
          4: . 1
          5: . 1

o28 : BettiTally

i29 : R = KK[a..i]

o29 = R

o29 : PolynomialRing

i30 : M = genericMatrix(R,a,3,3)

o30 = | a d g |
      | b e h |
      | c f i |

              3       3
o30 : Matrix R  <--- R

i31 : N = M^3

o31 = | a3+2abd+bde+2acg+bfg+cdh+cgi       
      | a2b+b2d+abe+be2+bcg+ach+ceh+bfh+chi
      | a2c+bcd+abf+bef+c2g+cfh+aci+bfi+ci2
      -----------------------------------------------------------------------
      a2d+bd2+ade+de2+cdg+afg+efg+dfh+fgi a2g+bdg+cg2+adh+deh+fgh+agi+dhi+gi2
      abd+2bde+e3+bfg+cdh+2efh+fhi        abg+beg+bdh+e2h+cgh+fh2+bgi+ehi+hi2
      acd+cde+bdf+e2f+cfg+f2h+cdi+efi+fi2 acg+bfg+cdh+efh+2cgi+2fhi+i3       
      -----------------------------------------------------------------------
      |
      |
      |

              3       3
o31 : Matrix R  <--- R

i32 : I = flatten N

o32 = | a3+2abd+bde+2acg+bfg+cdh+cgi a2b+b2d+abe+be2+bcg+ach+ceh+bfh+chi
      -----------------------------------------------------------------------
      a2c+bcd+abf+bef+c2g+cfh+aci+bfi+ci2 a2d+bd2+ade+de2+cdg+afg+efg+dfh+fgi
      -----------------------------------------------------------------------
      abd+2bde+e3+bfg+cdh+2efh+fhi acd+cde+bdf+e2f+cfg+f2h+cdi+efi+fi2
      -----------------------------------------------------------------------
      a2g+bdg+cg2+adh+deh+fgh+agi+dhi+gi2 abg+beg+bdh+e2h+cgh+fh2+bgi+ehi+hi2
      -----------------------------------------------------------------------
      acg+bfg+cdh+efh+2cgi+2fhi+i3 |

              1       9
o32 : Matrix R  <--- R

i33 : Tr = trace M 

o33 = a + e + i

o33 : R

i34 : Tr //I  -- the quotient, which is 0

o34 = 0

              9       1
o34 : Matrix R  <--- R

i35 : Tr % I  -- the remainder, which is Tr again

o35 = a + e + i

o35 : R

i36 : Tr^2 % I

       2           2                  2
o36 = a  + 2a*e + e  + 2a*i + 2e*i + i

o36 : R

i37 : Tr^3 % I

        2                 2     3                                2          
o37 = 3a e + 3b*d*e + 3a*e  + 3e  + 3b*f*g + 3c*d*h + 6e*f*h + 3a i + 6a*e*i
      -----------------------------------------------------------------------
          2                          2       2     3
      + 3e i + 3c*g*i + 6f*h*i + 3a*i  + 3e*i  + 3i

o37 : R

i38 : Tr^4 % I

        2 2         2       3     4                                   
o38 = 6a e  + 6b*d*e  + 6a*e  + 6e  + 6b*e*f*g + 6c*d*e*h - 6b*d*f*h +
      -----------------------------------------------------------------------
                    2                   2 2      2                       2   
      6a*e*f*h + 12e f*h - 6c*f*g*h - 6f h  + 12a e*i + 12b*d*e*i + 12a*e i +
      -----------------------------------------------------------------------
         3                                                               2 2
      12e i + 12c*e*g*i + 6b*f*g*i + 6c*d*h*i + 6a*f*h*i + 36e*f*h*i + 6a i 
      -----------------------------------------------------------------------
               2     2 2         2          2       3        3     4
      + 12a*e*i  + 6e i  + 6c*g*i  + 12f*h*i  + 6a*i  + 12e*i  + 6i

o38 : R

i39 : Tr^5 % I

         2 2           2         3       4         2         2       
o39 = 30a e i + 30b*d*e i + 30a*e i + 30e i + 30c*e g*i + 30a f*h*i +
      -----------------------------------------------------------------------
                                     2                         2 2   
      30b*d*f*h*i + 60a*e*f*h*i + 90e f*h*i + 30c*f*g*h*i + 30f h i +
      -----------------------------------------------------------------------
         2   2            2        2 2      3 2            2            2  
      30a e*i  + 30b*d*e*i  + 30a*e i  + 30e i  + 30c*e*g*i  + 60a*f*h*i  +
      -----------------------------------------------------------------------
                2      2 3          3          3      2 3          3  
      120e*f*h*i  + 30a i  + 30b*d*i  + 30a*e*i  + 30e i  + 30c*g*i  +
      -----------------------------------------------------------------------
             3        4        4      5
      90f*h*i  + 30a*i  + 30e*i  + 30i

o39 : R

i40 : Tr^6 % I

         2 2 2          2 2        3 2      4 2        2   2      2     2  
o40 = 90a e i  + 90b*d*e i  + 90a*e i  + 90e i  + 90c*e g*i  + 90a f*h*i  +
      -----------------------------------------------------------------------
                 2               2       2     2              2      2 2 2  
      90b*d*f*h*i  + 180a*e*f*h*i  + 270e f*h*i  + 90c*f*g*h*i  + 90f h i  +
      -----------------------------------------------------------------------
         2   3            3        2 3      3 3            3             3  
      90a e*i  + 90b*d*e*i  + 90a*e i  + 90e i  + 90c*e*g*i  + 180a*f*h*i  +
      -----------------------------------------------------------------------
                3      2 4          4          4      2 4          4  
      360e*f*h*i  + 90a i  + 90b*d*i  + 90a*e*i  + 90e i  + 90c*g*i  +
      -----------------------------------------------------------------------
              4        5        5      6
      270f*h*i  + 90a*i  + 90e*i  + 90i

o40 : R

i41 : Tr^7 % I

o41 = 0

o41 : R

i42 : Tr^6 // I

o42 = {3} | a3+6a2e+3bde+15ae2+22e3+6efh+6a2i+30aei+60e2i+6fhi+15ai2+60ei2+22
      {3} | 0                                                                
      {3} | 0                                                                
      {3} | -27abe-45be2+9ceh+30bfh-72abi-144bei+75chi                       
      {3} | -2a3+15a2e+21bde+6ae2+e3+33bfg+9cdh-36afh+51efh+60a2i+72bdi+30aei
      {3} | 18abg+45beg+3a2h+9bdh-21aeh+3e2h+9cgh+36fh2+114bgi-135ahi-39ehi+3
      {3} | 18ace+6abf-36bef-18cfh+66aci+36cei-57bfi+132ci2                  
      {3} | -3a2f-39bdf+75aef-12e2f+9cfg-36f2h-66cdi+135afi+51efi+69fi2      
      {3} | -2a3-18abd-30a2e-60bde-30ae2-44e3-18ceg-33bfg-9cdh+18afh-93efh-75
      -----------------------------------------------------------------------
      i3                                                  |
                                                          |
                                                          |
                                                          |
      +6e2i+66cgi+147fhi-30ai2-75ei2-26i3                 |
      6hi2                                                |
                                                          |
                                                          |
      a2i-90bdi-60aei-75e2i-66cgi-171fhi-84ai2-84ei2-89i3 |

              9       1
o42 : Matrix R  <--- R

i43 : Tr^6 == I * (Tr^6 // I) + (Tr^6 % I)

o43 = true

i44 : x = global x

o44 = x

o44 : Symbol

i45 : R = KK[x_0..x_3] 

o45 = R

o45 : PolynomialRing

i46 : M = map(R^2, 3, (i,j)->x_(i+j))

o46 = | x_0 x_1 x_2 |
      | x_1 x_2 x_3 |

              2       3
o46 : Matrix R  <--- R

i47 : I = gens minors(2,M)

o47 = | -x_1^2+x_0x_2 -x_1x_2+x_0x_3 -x_2^2+x_1x_3 |

              1       3
o47 : Matrix R  <--- R

i48 : pideal = ideal(x_0+x_3, x_1, x_2)

o48 = ideal (x  + x , x , x )
              0    3   1   2

o48 : Ideal of R

i49 : y = global y

o49 = y

o49 : Symbol

i50 : S = KK[y_0..y_3,MonomialOrder=> Eliminate 1]

o50 = S

o50 : PolynomialRing

i51 : I1 = substitute(I, matrix{{y_0,y_1,y_2,y_3-y_0}})

o51 = | y_0y_2-y_1^2 -y_0^2+y_0y_3-y_1y_2 -y_0y_1-y_2^2+y_1y_3 |

              1       3
o51 : Matrix S  <--- S

i52 : J = selectInSubring(1,gens gb I1)

o52 = | y_1^3+y_2^3-y_1y_2y_3 |

              1       1
o52 : Matrix S  <--- S

i53 : S1 = KK[y_1..y_3]

o53 = S1

o53 : PolynomialRing

i54 : J1 = substitute(J, S1)

o54 = | y_1^3+y_2^3-y_1y_2y_3 |

               1        1
o54 : Matrix S1  <--- S1

i55 : Rbar = R/(ideal I)

o55 = Rbar

o55 : QuotientRing

i56 : f = map(Rbar, S1, matrix(Rbar,{{x_0+x_3, x_1,x_2}}))

o56 = map(Rbar,S1,{x  + x , x , x })
                    0    3   1   2

o56 : RingMap Rbar <--- S1

i57 : J1 = ker f

             3             3
o57 = ideal(y  - y y y  + y )
             2    1 2 3    3

o57 : Ideal of S1

i58 : R = KK[a,b,c,d]

o58 = R

o58 : PolynomialRing

i59 : I1 = ideal(d*b-a^2, d^2*c-a^3)

                2           3      2
o59 = ideal (- a  + b*d, - a  + c*d )

o59 : Ideal of R

i60 : I1aug = (gens I1) | matrix{{d}}

o60 = | -a2+bd -a3+cd2 d |

              1       3
o60 : Matrix R  <--- R

i61 : augrelations = gens ker I1aug

o61 = {2} | -a    d     |
      {3} | 1     0     |
      {1} | ab-cd a2-bd |

              3       2
o61 : Matrix R  <--- R

i62 : I21 = submatrix(augrelations, {2}, {0,1})

o62 = {1} | ab-cd a2-bd |

              1       2
o62 : Matrix R  <--- R

i63 : I21 = ideal I21

                         2
o63 = ideal (a*b - c*d, a  - b*d)

o63 : Ideal of R

i64 : I22 = I21 : d

              2                    2
o64 = ideal (b  - a*c, a*b - c*d, a  - b*d)

o64 : Ideal of R

i65 : I23 = I22 : d

              2                    2
o65 = ideal (b  - a*c, a*b - c*d, a  - b*d)

o65 : Ideal of R

i66 : (gens I23) % (gens I22)

o66 = 0

              1       3
o66 : Matrix R  <--- R

i67 : gens gb I1

o67 = | a2-bd abd-cd2 b2d2-acd2 |

              1       3
o67 : Matrix R  <--- R

i68 : I2 = divideByVariable(gens gb I1,d)

o68 = (| a2-bd ab-cd b2-ac |, 2)

o68 : Sequence

i69 : saturate(I1, d)

              2                    2
o69 = ideal (b  - a*c, a*b - c*d, a  - b*d)

o69 : Ideal of R

i70 : 
0.90user 0.03system 0:00.93elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+12084minor)pagefaults 0swaps
