-- -*- M2-comint -*- {* hash: -831989889 *}

i1 : t = tally apply(1..10000, i -> # factor i)

o1 = Tally{0 => 1   }
           1 => 1280
           2 => 4097
           3 => 3695
           4 => 894
           5 => 33

o1 : Tally

i2 : t_5

o2 = 33

i3 : t_6

o3 = 0

i4 : 
0.94user 0.06system 0:01.00elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+12997minor)pagefaults 0swaps
