-- -*- M2-comint -*- {* hash: 1401710618 *}

i1 : x = tally {a,a,b}

o1 = Tally{a => 2}
           b => 1

o1 : Tally

i2 : y = tally {1,2,2,2}

o2 = Tally{1 => 1}
           2 => 3

o2 : Tally

i3 : x ** y

o3 = Tally{(a, 1) => 2}
           (a, 2) => 6
           (b, 1) => 1
           (b, 2) => 3

o3 : Tally

i4 : 
0.79user 0.02system 0:00.82elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
