-- -*- M2-comint -*- {* hash: 1407018198 *}

i1 : R = ZZ/31991[a,b,c] -- the coordinate ring of P^2

o1 = R

o1 : PolynomialRing

i2 : ipoint1 = ideal matrix({{a,b}})

o2 = ideal (a, b)

o2 : Ideal of R

i3 : ipoint1 = ideal(a,b)

o3 = ideal (a, b)

o3 : Ideal of R

i4 : ipoint2 = ideal(a,c)

o4 = ideal (a, c)

o4 : Ideal of R

i5 : ipoint3 = ideal(b,c)

o5 = ideal (b, c)

o5 : Ideal of R

i6 : icurves1 = intersect(
                    ipoint1^2,
                    ipoint2^2,
                    ipoint3^2
                )

                    2 2   2 2   2 2
o6 = ideal (a*b*c, b c , a c , a b )

o6 : Ideal of R

i7 : Icurves1 = gens icurves1

o7 = | abc b2c2 a2c2 a2b2 |

             1       4
o7 : Matrix R  <--- R

i8 : F1 = Icurves1 * random(source Icurves1, R^{-6})

o8 = | -2082a4b2-11906a3b3-4112a2b4+10356a4bc-12495a3b2c-4200a2b3c+1851ab4c-
     ------------------------------------------------------------------------
     2753a4c2+12845a3bc2-10656a2b2c2+828ab3c2-12073b4c2+15957a3c3-4230a2bc3-
     ------------------------------------------------------------------------
     8284ab2c3+10683b3c3+105a2c4-15212abc4+3998b2c4 |

             1       1
o8 : Matrix R  <--- R

i9 : betti F1

            0 1
o9 = total: 1 1
         0: 1 .
         1: . .
         2: . .
         3: . .
         4: . .
         5: . 1

o9 : BettiTally

i10 : Icurves2 = gens (ipoint1^3)

o10 = | a3 a2b ab2 b3 |

              1       4
o10 : Matrix R  <--- R

i11 : F2 = Icurves2 * random(source Icurves2, R^{-6})

o11 = | 9534a6-7276a5b-10365a4b2-6498a3b3-1787a2b4+683ab5-1072b6+14043a5c+
      -----------------------------------------------------------------------
      10125a4bc+6874a3b2c-316a2b3c+8037ab4c-1097b5c+5756a4c2+4656a3bc2+
      -----------------------------------------------------------------------
      8823a2b2c2+10824ab3c2-2871b4c2+156a3c3+15174a2bc3+3616ab2c3-10902b3c3 |

              1       1
o11 : Matrix R  <--- R

i12 : betti F2

             0 1
o12 = total: 1 1
          0: 1 .
          1: . .
          2: . .
          3: . .
          4: . .
          5: . 1

o12 : BettiTally

i13 : i = ideal((a-b)^2) + (ipoint1^4)

              2           2   4   3    2 2     3   4
o13 = ideal (a  - 2a*b + b , a , a b, a b , a*b , b )

o13 : Ideal of R

i14 : icurves3 = intersect(i, ipoint3^2)

              2 2         2    2 2   2          2     3    4     3   2 2
o14 = ideal (a c  - 2a*b*c  + b c , a b*c - 2a*b c + b c, b , a*b , a b )

o14 : Ideal of R

i15 : Icurves3 = gens icurves3

o15 = | a2c2-2abc2+b2c2 a2bc-2ab2c+b3c b4 ab3 a2b2 |

              1       5
o15 : Matrix R  <--- R

i16 : F3 = Icurves3 * random(source Icurves3, R^{-6})

o16 = | 11220a4b2-11921a3b3-8345a2b4+213ab5+13317b6+1357a4bc-10637a3b2c+
      -----------------------------------------------------------------------
      9485a2b3c-10074ab4c+11338b5c+3179a4c2+15957a3bc2+8039a2b2c2+4175ab3c2-
      -----------------------------------------------------------------------
      2296b4c2+6887a3c3-6749a2bc3-7163ab2c3+7025b3c3+1167a2c4-2334abc4+
      -----------------------------------------------------------------------
      1167b2c4 |

              1       1
o16 : Matrix R  <--- R

i17 : betti F3

             0 1
o17 = total: 1 1
          0: 1 .
          1: . .
          2: . .
          3: . .
          4: . .
          5: . 1

o17 : BettiTally

i18 : can1 = basis(3, intersect(ipoint1,ipoint2,ipoint3))

o18 = {2} | b c 0 0 0 0 0 |
      {2} | 0 0 a c 0 0 0 |
      {2} | 0 0 0 0 a b c |

o18 : Matrix

i19 : target can1

o19 = image | bc ac ab |

                              1
o19 : R-module, submodule of R

i20 : source can1

       7
o20 = R

o20 : R-module, free, degrees {3, 3, 3, 3, 3, 3, 3}

i21 : can1 = can1 ** R

o21 = {2} | b c 0 0 0 0 0 |
      {2} | 0 0 a c 0 0 0 |
      {2} | 0 0 0 0 a b c |

o21 : Matrix

i22 : can1 = super can1

o22 = | b2c bc2 a2c ac2 a2b ab2 abc |

              1       7
o22 : Matrix R  <--- R

i23 : can2 = basis(3, ipoint1^2)

o23 = {2} | a b c 0 0 0 0 |
      {2} | 0 0 0 b c 0 0 |
      {2} | 0 0 0 0 0 b c |

o23 : Matrix

i24 : can2 = super (can2 ** R)

o24 = | a3 a2b a2c ab2 abc b3 b2c |

              1       7
o24 : Matrix R  <--- R

i25 : can3 = basis(3, intersect(ideal(a-b) + ipoint1^2, ipoint3))

o25 = {2} | a c 0 0 0 0 0 |
      {2} | 0 0 b c 0 0 0 |
      {2} | 0 0 0 0 a b c |

o25 : Matrix

i26 : can3 = super (can3 ** R)

o26 = | a2c-abc ac2-bc2 b3 b2c a2b ab2 abc |

              1       7
o26 : Matrix R  <--- R

i27 : betti  can1

             0 1
o27 = total: 1 7
          0: 1 .
          1: . .
          2: . 7

o27 : BettiTally

i28 : betti  can2

             0 1
o28 = total: 1 7
          0: 1 .
          1: . .
          2: . 7

o28 : BettiTally

i29 : betti  can3

             0 1
o29 = total: 1 7
          0: 1 .
          1: . .
          2: . 7

o29 : BettiTally

i30 : S = (coefficientRing R)[x_0..x_6]

o30 = S

o30 : PolynomialRing

i31 : T1 = R/ideal F1

o31 = T1

o31 : QuotientRing

i32 : f1 = map(T1,S,substitute(can1, T1))

                 2      2   2      2   2      2
o32 = map(T1,S,{b c, b*c , a c, a*c , a b, a*b , a*b*c})

o32 : RingMap T1 <--- S

i33 : IC1 = mingens ker f1

o33 = | x_3x_5-x_6^2 x_2x_5-x_4x_6 x_1x_5-x_0x_6 x_3x_4-x_2x_6 x_1x_4-x_6^2
      -----------------------------------------------------------------------
      x_0x_4-x_5x_6 x_0x_3-x_1x_6 x_1x_2-x_3x_6 x_0x_2-x_6^2
      -----------------------------------------------------------------------
      x_0^2+9337x_0x_1-6283x_1^2+6895x_2^2+4702x_1x_3+11467x_2x_3-13824x_3^2-
      -----------------------------------------------------------------------
      7937x_2x_4+12698x_4^2-7878x_0x_5+1779x_4x_5-7957x_5^2-9383x_0x_6+10266x
      -----------------------------------------------------------------------
      _1x_6+4387x_2x_6-9788x_3x_6+13515x_4x_6+9113x_5x_6+10873x_6^2 |

              1       10
o33 : Matrix S  <--- S

i34 : T2 = R/ideal F2

o34 = T2

o34 : QuotientRing

i35 : f2 = map(T2,S,substitute(can2, T2))

                 3   2    2      2          3   2
o35 = map(T2,S,{a , a b, a c, a*b , a*b*c, b , b c})

o35 : RingMap T2 <--- S

i36 : IC2 = mingens ker f2

o36 = | x_4x_5-x_3x_6 x_2x_5-x_1x_6 x_4^2-x_2x_6 x_3x_4-x_1x_6 x_1x_4-x_0x_6
      -----------------------------------------------------------------------
      x_3^2-x_1x_5 x_2x_3-x_0x_6 x_1x_3-x_0x_5 x_1x_2-x_0x_4 x_1^2-x_0x_3
      -----------------------------------------------------------------------
      x_0^2x_5-4383x_0x_1x_5-10601x_0x_3x_5-7933x_0x_5^2-15942x_1x_5^2+4285x_
      -----------------------------------------------------------------------
      3x_5^2-2510x_5^3+233x_0x_1x_6-10015x_0x_3x_6+1779x_0x_4x_6+604x_2x_4x_6
      -----------------------------------------------------------------------
      -4556x_0x_5x_6-14348x_1x_5x_6+8970x_3x_5x_6+11338x_5^2x_6+3262x_0x_6^2-
      -----------------------------------------------------------------------
      291x_1x_6^2+4612x_2x_6^2+14839x_3x_6^2+9899x_4x_6^2+6110x_5x_6^2-15141x
      -----------------------------------------------------------------------
      _6^3 x_0^2x_3+5301x_0x_1x_5+10807x_0x_3x_5-12064x_0x_5^2-1157x_1x_5^2-
      -----------------------------------------------------------------------
      72x_3x_5^2+3574x_5^3+233x_0^2x_6-12488x_0x_1x_6+1779x_0x_2x_6+604x_2^2x
      -----------------------------------------------------------------------
      _6-8649x_0x_3x_6-5185x_0x_4x_6-3309x_2x_4x_6+11079x_0x_5x_6+15992x_1x_
      -----------------------------------------------------------------------
      5x_6+9909x_3x_5x_6+12431x_5^2x_6-2922x_0x_6^2-12965x_1x_6^2+5983x_2x_6^
      -----------------------------------------------------------------------
      2+7744x_3x_6^2-7620x_4x_6^2+3663x_5x_6^2-13669x_6^3
      -----------------------------------------------------------------------
      x_0^2x_1+233x_0^2x_4+1779x_0x_2x_4+604x_2^2x_4-12367x_0x_1x_5+7641x_0x_
      -----------------------------------------------------------------------
      3x_5+15502x_0x_5^2-11752x_1x_5^2+2399x_3x_5^2-2746x_5^3-12488x_0^2x_6+
      -----------------------------------------------------------------------
      3867x_0x_1x_6-5185x_0x_2x_6-3309x_2^2x_6-4466x_0x_3x_6+3944x_0x_4x_6+
      -----------------------------------------------------------------------
      3279x_2x_4x_6+14143x_0x_5x_6-5941x_1x_5x_6+1087x_3x_5x_6+8351x_5^2x_6+
      -----------------------------------------------------------------------
      2304x_0x_6^2+14767x_1x_6^2-14708x_2x_6^2+7993x_3x_6^2+8963x_4x_6^2-
      -----------------------------------------------------------------------
      14218x_5x_6^2-2978x_6^3
      -----------------------------------------------------------------------
      x_0^3+233x_0^2x_2+1779x_0x_2^2+604x_2^3-12488x_0^2x_4-5185x_0x_2x_4-
      -----------------------------------------------------------------------
      3309x_2^2x_4-4166x_0x_1x_5+12053x_0x_3x_5-2766x_0x_5^2+8218x_1x_5^2+
      -----------------------------------------------------------------------
      12753x_3x_5^2-9900x_5^3+3867x_0^2x_6-2145x_0x_1x_6+3944x_0x_2x_6+3279x_
      -----------------------------------------------------------------------
      2^2x_6-4201x_0x_3x_6-6611x_0x_4x_6+1057x_2x_4x_6-13842x_0x_5x_6+13448x_
      -----------------------------------------------------------------------
      1x_5x_6-4447x_3x_5x_6+493x_5^2x_6+15270x_0x_6^2-7812x_1x_6^2+5614x_2x_6
      -----------------------------------------------------------------------
      ^2-681x_3x_6^2-11602x_4x_6^2-372x_5x_6^2-5424x_6^3 |

              1       14
o36 : Matrix S  <--- S

i37 : T3 = R/ideal F3

o37 = T3

o37 : QuotientRing

i38 : f3 = map(T3,S,substitute(can3, T3))

                 2              2      2   3   2    2      2
o38 = map(T3,S,{a c - a*b*c, a*c  - b*c , b , b c, a b, a*b , a*b*c})

o38 : RingMap T3 <--- S

i39 : IC3 = mingens ker f3

o39 = | x_3x_5-x_2x_6 x_1x_5+x_3x_6-x_6^2 x_0x_5-x_4x_6+x_5x_6 x_3x_4-x_5x_6
      -----------------------------------------------------------------------
      x_2x_4-x_5^2 x_1x_4-x_0x_6 x_0x_3+x_3x_6-x_6^2 x_1x_2+x_3^2-x_3x_6
      -----------------------------------------------------------------------
      x_0x_2+x_2x_6-x_5x_6 x_0^2+294x_0x_1-11995x_1^2-12122x_2^2-3152x_1x_3+
      -----------------------------------------------------------------------
      15511x_2x_3-2114x_3^2-14551x_0x_4+5649x_4^2+8584x_2x_5+9506x_4x_5+
      -----------------------------------------------------------------------
      11238x_5^2-8909x_0x_6+3152x_1x_6+15303x_2x_6+9501x_3x_6-13226x_4x_6+
      -----------------------------------------------------------------------
      5417x_5x_6-15358x_6^2 |

              1       10
o39 : Matrix S  <--- S

i40 : IC1res = res(coker IC1)

       1      10      25      25      10      1
o40 = S  <-- S   <-- S   <-- S   <-- S   <-- S  <-- 0
                                                     
      0      1       2       3       4       5      6

o40 : ChainComplex

i41 : betti  IC1res

             0  1  2  3  4 5
o41 = total: 1 10 25 25 10 1
          0: 1  .  .  .  . .
          1: . 10 16  9  . .
          2: .  .  9 16 10 .
          3: .  .  .  .  . 1

o41 : BettiTally

i42 : IC2res = res(coker IC2)

       1      14      35      35      14      1
o42 = S  <-- S   <-- S   <-- S   <-- S   <-- S  <-- 0
                                                     
      0      1       2       3       4       5      6

o42 : ChainComplex

i43 : betti  IC2res

             0  1  2  3  4 5
o43 = total: 1 14 35 35 14 1
          0: 1  .  .  .  . .
          1: . 10 20 15  4 .
          2: .  4 15 20 10 .
          3: .  .  .  .  . 1

o43 : BettiTally

i44 : IC3res = res(coker IC3)

       1      10      25      25      10      1
o44 = S  <-- S   <-- S   <-- S   <-- S   <-- S  <-- 0
                                                     
      0      1       2       3       4       5      6

o44 : ChainComplex

i45 : betti  IC3res

             0  1  2  3  4 5
o45 = total: 1 10 25 25 10 1
          0: 1  .  .  .  . .
          1: . 10 16  9  . .
          2: .  .  9 16 10 .
          3: .  .  .  .  . 1

o45 : BettiTally

i46 : IC1 = matrix entries IC1

o46 = | x_3x_5-x_6^2 x_2x_5-x_4x_6 x_1x_5-x_0x_6 x_3x_4-x_2x_6 x_1x_4-x_6^2
      -----------------------------------------------------------------------
      x_0x_4-x_5x_6 x_0x_3-x_1x_6 x_1x_2-x_3x_6 x_0x_2-x_6^2
      -----------------------------------------------------------------------
      x_0^2+9337x_0x_1-6283x_1^2+6895x_2^2+4702x_1x_3+11467x_2x_3-13824x_3^2-
      -----------------------------------------------------------------------
      7937x_2x_4+12698x_4^2-7878x_0x_5+1779x_4x_5-7957x_5^2-9383x_0x_6+10266x
      -----------------------------------------------------------------------
      _1x_6+4387x_2x_6-9788x_3x_6+13515x_4x_6+9113x_5x_6+10873x_6^2 |

              1       10
o46 : Matrix S  <--- S

i47 : IC1res = res(coker IC1, DegreeLimit => {1})

       1      10      25      25      10      1
o47 = S  <-- S   <-- S   <-- S   <-- S   <-- S  <-- 0
                                                     
      0      1       2       3       4       5      6

o47 : ChainComplex

i48 : betti IC1res

             0  1  2  3  4 5
o48 = total: 1 10 25 25 10 1
          0: 1  .  .  .  . .
          1: . 10 16  9  . .
          2: .  .  9 16 10 .
          3: .  .  .  .  . 1

o48 : BettiTally

i49 : ff1 = map(R,S,can1)

                2      2   2      2   2      2
o49 = map(R,S,{b c, b*c , a c, a*c , a b, a*b , a*b*c})

o49 : RingMap R <--- S

i50 : trim ideal pushForward1(ff1,coker F1)

                     2                                                 2 
o50 = ideal (x x  - x , x x  - x x , x x  - x x , x x  - x x , x x  - x ,
              3 5    6   2 5    4 6   1 5    0 6   3 4    2 6   1 4    6 
      -----------------------------------------------------------------------
                                                     2   2             
      x x  - x x , x x  - x x , x x  - x x , x x  - x , x  + 9337x x  -
       0 4    5 6   0 3    1 6   1 2    3 6   0 2    6   0        0 1  
      -----------------------------------------------------------------------
           2        2                                2                    2  
      6283x  + 6895x  + 4702x x  + 11467x x  - 13824x  - 7937x x  + 12698x  -
           1        2        1 3         2 3         3        2 4         4  
      -----------------------------------------------------------------------
                                 2                                    
      7878x x  + 1779x x  - 7957x  - 9383x x  + 10266x x  + 4387x x  -
           0 5        4 5        5        0 6         1 6        2 6  
      -----------------------------------------------------------------------
                                              2
      9788x x  + 13515x x  + 9113x x  + 10873x )
           3 6         4 6        5 6         6

o50 : Ideal of S

i51 : 
0.87user 0.06system 0:00.94elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+12285minor)pagefaults 0swaps
