-- -*- M2-comint -*- {* hash: -698080599 *}

i1 : A = ZZ[a..d];

i2 : B = A/(3*a^2-1);

i3 : C = B/(a*b-3);

i4 : describe C

        A
     -------
       2
     3a  - 1
o4 = -------
     a*b - 3

i5 : ambient C

o5 = B

o5 : QuotientRing

i6 : 
0.79user 0.04system 0:00.84elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10840minor)pagefaults 0swaps
