-- -*- M2-comint -*- {* hash: -1805292082 *}

i1 : apply({1,3,5,7}, i -> i^2)

o1 = {1, 9, 25, 49}

o1 : List

i2 : apply([1,3,5,7], i -> i^2)

o2 = [1, 9, 25, 49]

o2 : Array

i3 : apply((1,3,5,7), i -> i^2)

o3 = (1, 9, 25, 49)

o3 : Sequence

i4 : 
0.77user 0.03system 0:00.81elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10839minor)pagefaults 0swaps
