-- -*- M2-comint -*- {* hash: 2015951261 *}

i1 : apply({1,2,3}, {100,200,300}, (i,j) -> i+j)

o1 = {101, 202, 303}

o1 : List

i2 : apply([1,2,3], [100,200,300], (i,j) -> i+j)

o2 = [101, 202, 303]

o2 : Array

i3 : apply((1,2,3), (100,200,300), (i,j) -> i+j)

o3 = (101, 202, 303)

o3 : Sequence

i4 : 
0.81user 0.02system 0:00.84elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10846minor)pagefaults 0swaps
