-- -*- M2-comint -*- {* hash: 603068758 *}

i1 : R = ZZ/101[a..d];

i2 : I = ideal(a*b-c*d, (a*c-b*d)^2);

o2 : Ideal of R

i3 : associatedPrimes I

o3 = {ideal (d, a), ideal (b + c, a + d), ideal (c, b), ideal (b - c, a - d)}

o3 : List

i4 : 
0.80user 0.04system 0:00.84elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10850minor)pagefaults 0swaps
