-- -*- M2-comint -*- {* hash: -1845762963 *}

i1 : 1234

o1 = 1234

i2 : 123/4

     123
o2 = ---
      4

o2 : QQ

i3 : 123.4

o3 = 123.4

o3 : RR (of precision 53)

i4 : 123+4*ii

o4 = 123+4*ii

o4 : CC (of precision 53)

i5 : 4/5 + 2/3

     22
o5 = --
     15

o5 : QQ

i6 : 10^20

o6 = 100000000000000000000

i7 : 3*5*7

o7 = 105

i8 : 3.1^2.1

o8 = 10.7611716060997

o8 : RR (of precision 53)

i9 : sqrt 3.

o9 = 1.73205080756888

o9 : RR (of precision 53)

i10 : 1234//100

o10 = 12

i11 : 1234%100

o11 = 34

i12 : 
0.76user 0.05system 0:00.81elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
