-- -*- M2-comint -*- {* hash: -318325160 *}

i1 : S = ZZ/10007[x,y];

i2 : I = ideal(x^2,y^3);

o2 : Ideal of S

i3 : betti I

            0 1
o3 = total: 1 2
         0: 1 .
         1: . 1
         2: . 1

o3 : BettiTally

i4 : 
0.79user 0.02system 0:00.83elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
