-- -*- M2-comint -*- {* hash: -613709942 *}

i1 : R = ZZ/101[a..d,Degrees=>{2:{1,0},2:{0,1}},Heft=>{1,1}];

i2 : I = ideal random(R^1, R^{2:{-2,-2},2:{-3,-3}});

o2 : Ideal of R

i3 : t = betti res I

            0 1  2  3 4
o3 = total: 1 4 13 14 4
         0: 1 .  .  . .
         1: . 2  2  4 2
         2: . 2  5  6 .
         3: . .  4  . 2
         4: . .  .  4 .
         5: . .  2  . .

o3 : BettiTally

i4 : peek t

o4 = BettiTally{(0, {0, 0}, 0) => 1}
                (1, {2, 2}, 2) => 2
                (1, {3, 3}, 3) => 2
                (2, {3, 7}, 3) => 2
                (2, {4, 4}, 4) => 1
                (2, {4, 5}, 4) => 4
                (2, {5, 4}, 5) => 4
                (2, {7, 3}, 7) => 2
                (3, {4, 7}, 4) => 4
                (3, {5, 5}, 5) => 6
                (3, {7, 4}, 7) => 4
                (4, {5, 7}, 5) => 2
                (4, {7, 5}, 7) => 2

i5 : betti(t,Weights=>{1,0})

            0 1  2  3 4
o5 = total: 1 4 13 14 4
         0: 1 .  .  . .
         1: . 2  2  4 2
         2: . 2  5  6 .
         3: . .  4  . 2
         4: . .  .  4 .
         5: . .  2  . .

o5 : BettiTally

i6 : betti(t,Weights=>{0,1})

            0 1  2  3 4
o6 = total: 1 4 13 14 4
         0: 1 .  .  . .
         1: . 2  2  4 2
         2: . 2  5  6 .
         3: . .  4  . 2
         4: . .  .  4 .
         5: . .  2  . .

o6 : BettiTally

i7 : t1 = betti(t,Weights=>{1,1})

            0 1  2  3 4
o7 = total: 1 4 13 14 4
         0: 1 .  .  . .
         1: . .  .  . .
         2: . .  .  . .
         3: . 2  .  . .
         4: . .  .  . .
         5: . 2  .  . .
         6: . .  1  . .
         7: . .  8  6 .
         8: . .  4  8 4

o7 : BettiTally

i8 : peek t1

o8 = BettiTally{(0, {0, 0}, 0) => 1 }
                (1, {2, 2}, 4) => 2
                (1, {3, 3}, 6) => 2
                (2, {3, 7}, 10) => 2
                (2, {4, 4}, 8) => 1
                (2, {4, 5}, 9) => 4
                (2, {5, 4}, 9) => 4
                (2, {7, 3}, 10) => 2
                (3, {4, 7}, 11) => 4
                (3, {5, 5}, 10) => 6
                (3, {7, 4}, 11) => 4
                (4, {5, 7}, 12) => 2
                (4, {7, 5}, 12) => 2

i9 : 
0.75user 0.06system 0:00.81elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10839minor)pagefaults 0swaps
