-- -*- M2-comint -*- {* hash: 701043006 *}

i1 : R = GF(25,Variable=>a)[x,y,z];

i2 : f = ((a+1)*x+a*y+a^2*z)^2

               2                         2                            2
o2 = (- a + 2)x  + (a + 2)x*y + (2a + 1)y  + (- a + 1)x*z - y*z + 2a*z

o2 : R

i3 : coefficient(y^2,f)

o3 = 2a + 1

o3 : GF 25

i4 : S = R[r,s,t];

i5 : coefficient(r,a*x*(r+a*s))

o5 = a*x

o5 : R

i6 : 
0.77user 0.04system 0:00.82elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10845minor)pagefaults 0swaps
