-- -*- M2-comint -*- {* hash: 269968444 *}

i1 : R = ZZ[a..f];

i2 : m = mutableMatrix genericMatrix(R,a,2,3)

o2 = | a c e |
     | b d f |

o2 : MutableMatrix

i3 : columnAdd(m,0,c,1)

o3 = | c2+a c e |
     | cd+b d f |

o3 : MutableMatrix

i4 : m

o4 = | c2+a c e |
     | cd+b d f |

o4 : MutableMatrix

i5 : 
0.78user 0.07system 0:00.85elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10843minor)pagefaults 0swaps
