-- -*- M2-comint -*- {* hash: 422728447 *}

i1 : R = ZZ[a..f]

o1 = R

o1 : PolynomialRing

i2 : m = mutableMatrix genericMatrix(R,a,2,3)

o2 = | a c e |
     | b d f |

o2 : MutableMatrix

i3 : columnMult(m,0,c)

o3 = | ac c e |
     | bc d f |

o3 : MutableMatrix

i4 : m

o4 = | ac c e |
     | bc d f |

o4 : MutableMatrix

i5 : 
0.79user 0.08system 0:00.87elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10842minor)pagefaults 0swaps
