-- -*- M2-comint -*- {* hash: -1209173132 *}

i1 : run "uname -a"
Linux gallium 2.6.22-14-generic #1 SMP Thu Jan 31 23:33:13 UTC 2008 x86_64 GNU/Linux

o1 = 0

i2 : "!grep a" << " ba \n bc \n ad \n ef \n" << close
 ba 
 ad 

o2 = !grep a

o2 : File

i3 : peek get "!uname -a"

o3 = "Linux gallium 2.6.22-14-generic #1 SMP Thu Jan 31 23:33:13 UTC 2008
     "
     x86_64 GNU/Linux

i4 : f = openInOut "!egrep '^in'"

o4 = !egrep '^in'

o4 : File

i5 : scan(keys Core.Dictionary, key -> f << key << endl)

i6 : f << closeOut

o6 = !egrep '^in'

o6 : File

i7 : get f

o7 = interpreterDepth
     infoHelp
     integrate
     inducedMap
     installPackage
     installMethod
     instance
     info
     intersect
     input
     index
     indexComponents
     installAssignmentMethod
     infinity
     inducesWellDefinedMap
     inverse
     indices
     incomparable
     installHilbertFunction
     indeterminate
     in
     instances
     independentSets


i8 : f = openIn "!sleep 5; echo -n the answer is 4"

o8 = !sleep 5; echo -n the answer is 4

o8 : File

i9 : isReady f

o9 = false

i10 : while not isReady f do (sleep 1; << "." << flush)
.....
i11 : read f

o11 = the answer is 4

i12 : isReady f

o12 = true

i13 : atEndOfFile f

o13 = true

i14 : close f

o14 = !sleep 5; echo -n the answer is 4

o14 : File

i15 : 
0.80user 0.04system 0:05.88elapsed 14%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+13357minor)pagefaults 0swaps
