-- -*- M2-comint -*- {* hash: 1283209748 *}

i1 : degreeLength ZZ

o1 = 0

i2 : degreeLength (ZZ[x])

o2 = 1

i3 : degreeLength (ZZ[x, Degrees => {{1,2,3}}])

o3 = 3

i4 : degreeLength (GF 9)

o4 = 0

i5 : 
0.80user 0.07system 0:00.89elapsed 98%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10840minor)pagefaults 0swaps
