-- -*- M2-comint -*- {* hash: -1491298291 *}

i1 : denominator (4/6)

o1 = 3

i2 : R = frac(ZZ[x,y]);

i3 : denominator((x+2*y-3)/(x-y))

o3 = x - y

o3 : ZZ [x, y]

i4 : R = QQ[a..d]/(a^2,b^2,c^3);

i5 : hf = hilbertSeries R

           2    3    4     5    7
     1 - 2T  - T  + T  + 2T  - T
o5 = ----------------------------
                      4
               (1 - T)

o5 : Expression of class Divide

i6 : denominator hf

            4
o6 = (1 - T)

o6 : Expression of class Product

i7 : 
0.78user 0.04system 0:00.82elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10830minor)pagefaults 0swaps
