-- -*- M2-comint -*- {* hash: 328272182 *}

i1 : R = QQ[x,y,z,q];

i2 : f = vars R

o2 = | x y z q |

             1       4
o2 : Matrix R  <--- R

i3 : diff(f, (x+y-z)^2)

o3 = | 2x+2y-2z 2x+2y-2z -2x-2y+2z 0 |

             1       4
o3 : Matrix R  <--- R

i4 : f2 = genericMatrix(R,2,2)

o4 = | x z |
     | y q |

             2       2
o4 : Matrix R  <--- R

i5 : diff(f2, (x+y-z)^2)

o5 = | 2x+2y-2z -2x-2y+2z |
     | 2x+2y-2z 0         |

             2       2
o5 : Matrix R  <--- R

i6 : 
0.77user 0.04system 0:00.82elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
