-- -*- M2-comint -*- {* hash: -1375044574 *}

i1 : newPackage "PKG"

o1 = PKG

o1 : Package

i2 : export x1

i3 : x1=3

o3 = 3

i4 : endPackage "PKG"

o4 = PKG

o4 : Package

i5 : dictionaryPath

o5 = {PKG.Dictionary, Elimination.Dictionary, LLLBases.Dictionary,
     ------------------------------------------------------------------------
     IntegralClosure.Dictionary, PrimaryDecomposition.Dictionary,
     ------------------------------------------------------------------------
     Classic.Dictionary, SchurRings.Dictionary, TangentCone.Dictionary,
     ------------------------------------------------------------------------
     Parsing.Dictionary, User#"private dictionary", Core.Dictionary,
     ------------------------------------------------------------------------
     OutputDictionary, PackageDictionary}

o5 : List

i6 : x1

o6 = 3

i7 : dismiss PKG

o7 = PKG

o7 : Package

i8 : dictionaryPath

o8 = {Elimination.Dictionary, LLLBases.Dictionary,
     ------------------------------------------------------------------------
     IntegralClosure.Dictionary, PrimaryDecomposition.Dictionary,
     ------------------------------------------------------------------------
     Classic.Dictionary, SchurRings.Dictionary, TangentCone.Dictionary,
     ------------------------------------------------------------------------
     Parsing.Dictionary, User#"private dictionary", Core.Dictionary,
     ------------------------------------------------------------------------
     OutputDictionary, PackageDictionary}

o8 : List

i9 : x1

o9 = x1

o9 : Symbol

i10 : values PackageDictionary

o10 = {PrimaryDecomposition, Elimination, PrimaryDecomposition, Elimination,
      -----------------------------------------------------------------------
      TangentCone, TangentCone, User, PKG, SchurRings, PKG, SchurRings,
      -----------------------------------------------------------------------
      IntegralClosure, Parsing, IntegralClosure, Parsing, Classic, Classic,
      -----------------------------------------------------------------------
      LLLBases, LLLBases, Core, Core}

o10 : List

i11 : use PKG

i12 : x1

o12 = 3

i13 : 
0.79user 0.02system 0:00.82elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
