-- -*- M2-comint -*- {* hash: 1217792987 *}

i1 : R = ZZ/101[a..d]

o1 = R

o1 : PolynomialRing

i2 : m = matrix{{a*b, a^2*c}, {a*b^2, a^4*d}}

o2 = | ab  a2c |
     | ab2 a4d |

             2       2
o2 : Matrix R  <--- R

i3 : divideByVariable(m,a)

o3 = (| b  c   |, 2)
      | b2 a2d |

o3 : Sequence

i4 : divideByVariable(m,a,1)

o4 = (| b  ac  |, 1)
      | b2 a3d |

o4 : Sequence

i5 : 
0.78user 0.05system 0:00.83elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10845minor)pagefaults 0swaps
