-- -*- M2-comint -*- {* hash: -566260402 *}

i1 : set{1,2,3,1,2,4}

o1 = set {1, 2, 3, 4}

o1 : Set

i2 : elements oo

o2 = {1, 2, 3, 4}

o2 : List

i3 : tally apply(10, i -> random 5)

o3 = Tally{0 => 1}
           1 => 2
           3 => 5
           4 => 2

o3 : Tally

i4 : elements oo

o4 = {0, 1, 1, 3, 3, 3, 3, 3, 4, 4}

o4 : List

i5 : 
0.78user 0.03system 0:00.81elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10838minor)pagefaults 0swaps
