-- -*- M2-comint -*- {* hash: -1152519753 *}

i1 : newPackage "Foo"

o1 = Foo

o1 : Package

i2 : export abc

i3 : abc = 3

o3 = 3

i4 : dictionaryPath

o4 = {Elimination.Dictionary, LLLBases.Dictionary,
     ------------------------------------------------------------------------
     IntegralClosure.Dictionary, PrimaryDecomposition.Dictionary,
     ------------------------------------------------------------------------
     Classic.Dictionary, SchurRings.Dictionary, TangentCone.Dictionary,
     ------------------------------------------------------------------------
     Parsing.Dictionary, Foo#"private dictionary", Core.Dictionary,
     ------------------------------------------------------------------------
     OutputDictionary, PackageDictionary}

o4 : List

i5 : endPackage "Foo"

o5 = Foo

o5 : Package

i6 : peek oo

o6 = Package{configuration file name => null                                                         }
             Dictionary => Foo.Dictionary
             example inputs => MutableHashTable{}
             example results => MutableHashTable{}
             exported mutable symbols => {}
             exported symbols => {abc}
             Options => OptionTable{Authors => {}                                }
                                    AuxiliaryFiles => false
                                    Configuration => {}
                                    Date => 
                                    DebuggingMode => false
                                    Headline => 
                                    HomePage => 
                                    InfoDirSection => Macaulay 2 and its packages
                                    Version => 0.0
             package prefix => null
             private dictionary => Foo#"private dictionary"
             processed documentation => MutableHashTable{}
             raw documentation => MutableHashTable{}
             source directory => /home/dan/src/M2/1.1/BUILD/Linux-x86_64/ubuntu64/Macaulay2/packages/
             source file => stdio
             test inputs => MutableHashTable{}
             test number => 0
             title => Foo
             undocumented keys => MutableHashTable{}

i7 : dictionaryPath

o7 = {Foo.Dictionary, Elimination.Dictionary, LLLBases.Dictionary,
     ------------------------------------------------------------------------
     IntegralClosure.Dictionary, PrimaryDecomposition.Dictionary,
     ------------------------------------------------------------------------
     Classic.Dictionary, SchurRings.Dictionary, TangentCone.Dictionary,
     ------------------------------------------------------------------------
     Parsing.Dictionary, User#"private dictionary", Core.Dictionary,
     ------------------------------------------------------------------------
     OutputDictionary, PackageDictionary}

o7 : List

i8 : abc

o8 = 3

i9 : 
0.79user 0.03system 0:00.82elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10843minor)pagefaults 0swaps
