-- -*- M2-comint -*- {* hash: 717831090 *}

i1 : R = ZZ[x,y,z];

i2 : M = matrix{{x,z,x*y},{x^2+z,y*z,1}}

o2 = | x    z  xy |
     | x2+z yz 1  |

             2       3
o2 : Matrix R  <--- R

i3 : entries M

                     2
o3 = {{x, z, x*y}, {x  + z, y*z, 1}}

o3 : List

i4 : N = mutableMatrix{{x,z,x*y},{x^2+z,y*z,1}}

o4 = | x    z  xy |
     | x2+z yz 1  |

o4 : MutableMatrix

i5 : entries N

                     2
o5 = {{x, z, x*y}, {x  + z, y*z, 1}}

o5 : List

i6 : 
0.77user 0.07system 0:00.85elapsed 98%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10841minor)pagefaults 0swaps
