-- -*- M2-comint -*- {* hash: -437255319 *}

i1 : y = (2^15-4)/(2^15-5)

     32764
o1 = -----
     32763

o1 : QQ

i2 : x = factor y

       2
      2 8191
o2 = --------
     3*67*163

o2 : Expression of class Divide

i3 : value x

     32764
o3 = -----
     32763

o3 : QQ

i4 : peek'(100,x)

o4 = Divide{Product{Power{2, 2}, Power{8191, 1}}, Product{Power{3, 1},
     ------------------------------------------------------------------------
     Power{67, 1}, Power{163, 1}}}

i5 : R = ZZ/101[u]

o5 = R

o5 : PolynomialRing

i6 : factor (u^3-1)

              2
o6 = (u - 1)(u  + u + 1)

o6 : Expression of class Product

i7 : F = frac(ZZ/101[t])

o7 = F

o7 : FractionField

i8 : factor ((t^3-1)/(t^3+1))

              2
     (t - 1)(t  + t + 1)
o8 = -------------------
              2
     (t + 1)(t  - t + 1)

o8 : Expression of class Divide

i9 : code(factor,F)

o9 = -- code for method: factor(F)
     -- ../../../../../Macaulay2/m2/enginering.m2:231
          factor F := options -> f -> factor numerator f / factor denominator f;
     | symbol   class             value                                                   location of symbol
     | ------   -----             -----                                                   ------------------                                     
     |                             ZZ
     | R      : PolynomialRing -- --- [t]                                                 ../../../../../Macaulay2/m2/enginering.m2:220:19-220:19
     |                            101                                                    
     | o      : OptionTable    -- OptionTable{ConstantCoefficients => true              . ../../../../../Macaulay2/m2/enginering.m2:221:5-221:5  
     |                                        DegreeRank => 1                           .
     |                                        Degrees => {{1}}                          .
     |                            .......................................................
     | F      : FractionField  -- F                                                       ../../../../../Macaulay2/m2/enginering.m2:225:14-225:14

i10 : 
0.75user 0.11system 0:00.89elapsed 97%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10845minor)pagefaults 0swaps
