-- -*- M2-comint -*- {* hash: -294963673 *}

i1 : f = temporaryFileName() << "hi there"

o1 = /tmp/M2-17282-1

o1 : File

i2 : fileLength f

o2 = 8

i3 : close f

o3 = /tmp/M2-17282-1

o3 : File

i4 : filename = toString f

o4 = /tmp/M2-17282-1

i5 : fileLength filename

o5 = 8

i6 : get filename

o6 = hi there

i7 : length oo

o7 = 8

i8 : removeFile filename

i9 : 
0.75user 0.05system 0:00.81elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10845minor)pagefaults 0swaps
