-- -*- M2-comint -*- {* hash: -158173892 *}

i1 : R = ZZ/101[x,y,z];

i2 : f = matrix {{2, x},{y^2, 23},{z, z^3}}

o2 = | 2  x  |
     | y2 23 |
     | z  z3 |

             3       2
o2 : Matrix R  <--- R

i3 : flatten f

o3 = | 2 y2 z x 23 z3 |

             1       6
o3 : Matrix R  <--- R

i4 : 
0.78user 0.03system 0:00.81elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10843minor)pagefaults 0swaps
