-- -*- M2-comint -*- {* hash: -1588042541 *}

i1 : gbTrace = 3

o1 = 3

i2 : R = ZZ[x,y,z];

i3 : f = matrix{{x^2-3, y^3-1, z^4-2}};

             1       3
o3 : Matrix R  <--- R

i4 : z = koszul(2,f)

o4 = {2} | -y3+1 -z4+2 0     |
     {3} | x2-3  0     -z4+2 |
     {4} | 0     x2-3  y3-1  |

             3       3
o4 : Matrix R  <--- R

i5 : g = forceGB(f, SyzygyMatrix=>z);

i6 : syz g -- no extra computation

o6 = {2} | -y3+1 -z4+2 0     |
     {3} | x2-3  0     -z4+2 |
     {4} | 0     x2-3  y3-1  |

             3       3
o6 : Matrix R  <--- R

i7 : syz f

   -- registering gb 1 at 0x232d540

   -- [gb]{2}(1)m{3}(1)m{4}(1)m{5}(1)z{6}(1)z{7}(1)znumber of (nonminimal) gb elements = 3
   -- number of monomials                = 9
   -- 
o7 = {2} | -y3+1 -z4+2 0     |
     {3} | x2-3  0     -z4+2 |
     {4} | 0     x2-3  y3-1  |

             3       3
o7 : Matrix R  <--- R

i8 : kernel f

   -- [gb]number of (nonminimal) gb elements = 3
   -- number of monomials                = 9
   -- 
o8 = image {2} | -y3+1 -z4+2 0     |
           {3} | x2-3  0     -z4+2 |
           {4} | 0     x2-3  y3-1  |

                             3
o8 : R-module, submodule of R

i9 : 
0.80user 0.04system 0:00.83elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10839minor)pagefaults 0swaps
