-- -*- M2-comint -*- {* hash: 1993213019 *}

i1 : R = ZZ/32003[x_1..x_3];

i2 : g = random(R^1, R^{-4})

o2 = | -2136x_1^4+9349x_1^3x_2-5609x_1^2x_2^2-15802x_1x_2^3-11250x_2^4+8735x_
     ------------------------------------------------------------------------
     1^3x_3-9489x_1^2x_2x_3-371x_1x_2^2x_3-14212x_2^3x_3+13529x_1^2x_3^2-545x
     ------------------------------------------------------------------------
     _1x_2x_3^2-1270x_2^2x_3^2-2519x_1x_3^3-1415x_2x_3^3+626x_3^4 |

             1       1
o2 : Matrix R  <--- R

i3 : f = fromDual g

o3 = | x_2^2x_3-2701x_1x_3^2+7003x_2x_3^2-13646x_3^3
     ------------------------------------------------------------------------
     x_1x_2x_3-12663x_1x_3^2+13500x_2x_3^2+14631x_3^3
     ------------------------------------------------------------------------
     x_1^2x_3-4193x_1x_3^2+4403x_2x_3^2-6686x_3^3
     ------------------------------------------------------------------------
     x_2^3+5747x_1x_3^2+1654x_2x_3^2+252x_3^3
     ------------------------------------------------------------------------
     x_1x_2^2-12376x_1x_3^2+3099x_2x_3^2+1273x_3^3
     ------------------------------------------------------------------------
     x_1^2x_2+5695x_1x_3^2+3212x_2x_3^2+10254x_3^3
     ------------------------------------------------------------------------
     x_1^3+15733x_1x_3^2-11036x_2x_3^2+4915x_3^3 |

             1       7
o3 : Matrix R  <--- R

i4 : res ideal f

      1      7      7      1
o4 = R  <-- R  <-- R  <-- R  <-- 0
                                  
     0      1      2      3      4

o4 : ChainComplex

i5 : betti oo

            0 1 2 3
o5 = total: 1 7 7 1
         0: 1 . . .
         1: . . . .
         2: . 7 7 .
         3: . . . .
         4: . . . 1

o5 : BettiTally

i6 : 
0.78user 0.03system 0:00.83elapsed 97%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10908minor)pagefaults 0swaps
