-- -*- M2-comint -*- {* hash: -1182335923 *}

i1 : R = ZZ[a]/(a^2-3)[x,y]

o1 = R

o1 : PolynomialRing

i2 : F = y^2-x*(x-1)*(x-a)

        3           2    2
o2 = - x  + (a + 1)x  + y  - a*x

o2 : R

i3 : J = ideal(diff(x,F),diff(y,F),F)

                2                         3           2    2
o3 = ideal (- 3x  + (2a + 2)x - a, 2y, - x  + (a + 1)x  + y  - a*x)

o3 : Ideal of R

i4 : gens gb J

o4 = | 12 6a+6 2y 4x-2a+6 2xa+2x+2a+6 y2+2x-a-3 x2+3a |

             1       7
o4 : Matrix R  <--- R

i5 : peek J.generators.cache

o5 = CacheTable{GroebnerBasisOptions{HardDegreeLimit => } => GroebnerBasis[status: done; S-pairs encountered up to degree 5]}
                                     Syzygies => false
                                     SyzygyRows => 0
                image => image | -3x2+2xa+2x-a 2y -x3+x2a+x2+y2-xa |
                isHomogeneous => false

i6 : gbRemove J

i7 : peek J.generators.cache

o7 = CacheTable{image => image | -3x2+2xa+2x-a 2y -x3+x2a+x2+y2-xa |}
                isHomogeneous => false

i8 : 
0.78user 0.04system 0:00.82elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10848minor)pagefaults 0swaps
