-- -*- M2-comint -*- {* hash: 2013662971 *}

i1 : R = ZZ/101[x_0..x_4];

i2 : I = ideal random(R^1, R^{-2,-3});

o2 : Ideal of R

i3 : genera I

o3 = {1, 4, 5}

o3 : List

i4 : 
0.77user 0.04system 0:00.82elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
