-- -*- M2-comint -*- {* hash: 1716393288 *}

i1 : R = ZZ/101[a,b,c,Degrees=>{{1,2},{2,1},{1,0}}]

o1 = R

o1 : PolynomialRing

i2 : describe R

      ZZ
o2 = --- [a, b, c, Degrees => {{1, 2}, {2, 1}, {1, 0}}, Heft => {1, 0}]
     101

i3 : degree a

o3 = {1, 2}

o3 : List

i4 : degree b^2

o4 = {4, 2}

o4 : List

i5 : degree 0_R

o5 = -infinity

o5 : InfiniteNumber

i6 : degree 1_R

o6 = {0, 0}

o6 : List

i7 : random({15,15},R)

          5 5      6 3 3      7   6
o7 = - 34a b  + 47a b c  - 26a b*c

o7 : R

i8 : degree (a+b)

o8 = {2, 2}

o8 : List

i9 : degreeLength R

o9 = 2

i10 : degreeLength ZZ

o10 = 0

i11 : R = QQ[a,b,c,Degrees=>{{1,0},{-2,1},{-3,1}}, Heft=>{1,4}];

i12 : random({1,1},R)

      2  3    9  4
o12 = -*a b + -*a c
      5       2

o12 : R

i13 : basis({1,1},R)

o13 = | a4c a3b |

              1       2
o13 : Matrix R  <--- R

i14 : 
0.79user 0.02system 0:00.86elapsed 95%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
