-- -*- M2-comint -*- {* hash: -801916408 *}

i1 : x = hashTable {a=>b, c=>d, }

o1 = HashTable{a => b}
               c => d

o1 : HashTable

i2 : x#a

o2 = b

o2 : Symbol

i3 : hashTable(plus, {(a,3),(b,4),(a,10)})

o3 = HashTable{a => 13}
               b => 4

o3 : HashTable

i4 : 
0.76user 0.03system 0:00.80elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
