-- -*- M2-comint -*- {* hash: -35475713 *}

i1 : help

o1 = initial help
     ************

     Welcome to Macaulay 2


     Try entering '2+2' at your next input prompt, which begins with i.  The
     two output prompts begin with o.  The first one, with the equal sign,
     '=', gives the value computed from your input, and the second one, with
     the colon, ':', tells what type of thing the value is.


     Type one of these commands to get started reading the documentation:
       * copyright                         -- the copyright
       * help "Macaulay 2"                 -- top node of the documentation.
       * help "reading the documentation"  -- 
       * help "getting started"            -- 
       * help "a first Macaulay 2 session" -- 
       * help x                            -- display the documentation for x
       * printWidth = 80                   -- set print width to 80
         characters
       * viewHelp                          -- view documentation in a browser
       * viewHelp x                        -- view documentation on x in
         browser
     To read the documentation in info form, in case you happen to be running
     Macaulay 2 in a terminal window, replace "help" by "infoHelp" in any of
     the commands above.

o1 : DIV

i2 : help ideal

o2 = ideal -- make an ideal
     **********************



     Ways to use ideal :
     ===================

       * "ideal(List)" -- make an ideal
       * ideal(Sequence), see "ideal(List)" -- make an ideal
       * "ideal(Matrix)" -- make an ideal
       * "ideal(Module)" -- converts a module to an ideal
       * "ideal(MonomialIdeal)" -- converts a monomial ideal to an ideal
       * ideal(QuotientRing), see "ideal(Ring)" -- returns the defining ideal
       * "ideal(Ring)" -- returns the defining ideal
       * ideal(Number), see "ideal(RingElement)" -- make an ideal
       * "ideal(RingElement)" -- make an ideal
       * "ideal(String)" -- make an ideal using classic Macaulay syntax
       * "ideal(Variety)" -- returns the defining ideal

o2 : DIV

i3 : help (ideal,List)

o3 = ideal(List) -- make an ideal
     ****************************

     Synopsis
     ========

       * Usage: ideal L
       * Function: "ideal"
       * Inputs:
           * L, a list, or a sequence of ring elements
       * Outputs:
           * an ideal, which is generated by the list or sequence of ring
             elements


     Description
     ===========

     +---------------------------------------+
     |R = ZZ/101[w,x,y,z];                   |
     +---------------------------------------+
     |ideal{x^2-w*y, x*y-w*z, x*z-y^2}       |
     +---------------------------------------+
     |ideal(y^2-x*z,x^2*y-z^2,x^3-y*z)       |
     +---------------------------------------+
     |E = ZZ/2[x,y, SkewCommutative => true];|
     +---------------------------------------+
     |ideal(x^2,x*y)                         |
     +---------------------------------------+
     |W = QQ[x,dx, WeylAlgebra => {x => dx}];|
     +---------------------------------------+
     |ideal(dx*x+x*dx)                       |
     +---------------------------------------+
     |I = ideal(12,18)                       |
     +---------------------------------------+
     |mingens I                              |
     +---------------------------------------+

     See also
     ========

       * "Ideal" -- the class of all ideals
       * "PolynomialRing" -- the class of all ordered monoid rings

o3 : DIV

i4 : 
5.19user 0.09system 0:05.29elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+19651minor)pagefaults 0swaps
