-- -*- M2-comint -*- {* hash: -1053668748 *}

i1 : R = QQ[a..d, Degrees=>{4:{1,1}}];

i2 : M = coker matrix {{a,c,d},{c,b,d}}

o2 = cokernel | a c d |
              | c b d |

                            2
o2 : R-module, quotient of R

i3 : hilbertFunction({2,2}, M)

o3 = 8

i4 : B = basis({2,2},M)

o4 = | b2 bc c2 cd d2 0  0  0  |
     | 0  0  0  0  0  a2 ac c2 |

o4 : Matrix

i5 : numgens source B

o5 = 8

i6 : R = QQ[a..d];

i7 : M = coker matrix {{a,c,d},{c,b,d}}

o7 = cokernel | a c d |
              | c b d |

                            2
o7 : R-module, quotient of R

i8 : hilbertFunction(2, M)

o8 = 8

i9 : basis(2,M)

o9 = | b2 bc c2 cd d2 0  0  0  |
     | 0  0  0  0  0  a2 ac c2 |

o9 : Matrix

i10 : 
0.79user 0.06system 0:00.85elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10831minor)pagefaults 0swaps
