-- -*- M2-comint -*- {* hash: -514860820 *}

i1 : R = QQ[x,y,z]/(y^2-x^3)

o1 = R

o1 : QuotientRing

i2 : H = Hom(ideal(x,y), R^1)

o2 = image {-1} | x y  |
           {-1} | y x2 |

                             2
o2 : R-module, submodule of R

i3 : g = homomorphism H_{1}

o3 = | y x2 |

o3 : Matrix

i4 : source g

o4 = image | x y |

                             1
o4 : R-module, submodule of R

i5 : target g

      1
o5 = R

o5 : R-module, free

i6 : H1 = prune H

o6 = cokernel | x2 -y |
              | -y x  |

                            2
o6 : R-module, quotient of R

i7 : homomorphism(H1.cache.pruningMap * H1_{1})

o7 = | y x2 |

o7 : Matrix

i8 : f = basis(3,H)

o8 = {0} | xy2 xyz xz2 y3 y2z yz2 z3 0  0  0  |
     {1} | 0   0   0   0  0   0   0  y2 yz z2 |

o8 : Matrix

i9 : rand = random(R^(numgens source f), R^1)

o9 = | 5/4  |
     | 9/2  |
     | 2/5  |
     | 7/6  |
     | 7/6  |
     | 6/5  |
     | 3/4  |
     | 1/4  |
     | 10/3 |
     | 7/4  |

             10       1
o9 : Matrix R   <--- R

i10 : h = homomorphism(f * rand)

o10 = | 5/4x2y2+7/6xy3+9/2x2yz+7/6xy2z+2/5x2z2+6/5xyz2+3/4xz3+1/4y3+10/3y2z+7
      -----------------------------------------------------------------------
      /4yz2 1/4x2y2+5/4xy3+7/6y4+10/3x2yz+9/2xy2z+7/6y3z+7/4x2z2+2/5xyz2+6/
      -----------------------------------------------------------------------
      5y2z2+3/4yz3 |

o10 : Matrix

i11 : source h

o11 = image | x y |

                              1
o11 : R-module, submodule of R

i12 : target h

       1
o12 = R

o12 : R-module, free

i13 : 
0.79user 0.08system 0:00.87elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10840minor)pagefaults 0swaps
