-- -*- M2-comint -*- {* hash: -1997759818 *}

i1 : A = ZZ/3[a,b,c];

i2 : isSkewCommutative A

o2 = false

i3 : B = QQ[a..d,SkewCommutative=>{a,b}]

o3 = B

o3 : PolynomialRing

i4 : isSkewCommutative B

o4 = true

i5 : C = B[x,y]

o5 = C

o5 : PolynomialRing

i6 : isSkewCommutative C

o6 = true

i7 : b_C * a_C

o7 = -a*b

o7 : C

i8 : D = B/(a*d-b*c)

o8 = D

o8 : QuotientRing

i9 : isSkewCommutative D

o9 = true

i10 : 
0.79user 0.08system 0:00.89elapsed 97%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10842minor)pagefaults 0swaps
