-- -*- M2-comint -*- {* hash: 275244149 *}

i1 : isField QQ

o1 = true

i2 : isField CC_53

o2 = true

i3 : isField GF(2,3)

o3 = true

i4 : isField(frac(QQ[x,y]))

o4 = true

i5 : R = QQ[x]/(x^2+1)

o5 = R

o5 : QuotientRing

i6 : isUnit x

o6 = true

i7 : isField R

o7 = false

i8 : F = toField R

o8 = R

o8 : QuotientRing

i9 : isField F

o9 = true

i10 : 
0.82user 0.05system 0:00.90elapsed 96%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10847minor)pagefaults 0swaps
