-- -*- M2-comint -*- {* hash: -1397752790 *}

i1 : S = QQ[x,y,z];

i2 : I = ideal(x^2, y^2)

             2   2
o2 = ideal (x , y )

o2 : Ideal of S

i3 : isIdeal I

o3 = true

i4 : J = monomialIdeal I

                     2   2
o4 = monomialIdeal (x , y )

o4 : MonomialIdeal of S

i5 : isIdeal J

o5 = true

i6 : R = QQ[a..d]/(a*b*c*d);

i7 : I = ideal(a^2,b^2) * R^1

o7 = image | a2 b2 |

                             1
o7 : R-module, submodule of R

i8 : isIdeal I

o8 = true

i9 : J = a^2 * R^2 + a*b * R^2

o9 = image | a2 0  ab 0  |
           | 0  a2 0  ab |

                             2
o9 : R-module, submodule of R

i10 : isIdeal J

o10 = false

i11 : 
0.81user 0.04system 0:00.87elapsed 98%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
