-- -*- M2-comint -*- {* hash: -2111808595 *}

i1 : S = ZZ/3[x,y,z];

i2 : isQuotientRing S

o2 = false

i3 : R = S/(x^2-y*z);

i4 : isQuotientRing R

o4 = true

i5 : ambient R

o5 = S

o5 : PolynomialRing

i6 : symAlg = symmetricAlgebra R^2;

i7 : isQuotientRing symAlg

o7 = true

i8 : sing = singularLocus R;

i9 : isQuotientRing sing

o9 = true

i10 : 
0.77user 0.09system 0:00.87elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10848minor)pagefaults 0swaps
