-- -*- M2-comint -*- {* hash: -1693191541 *}

i1 : isPolynomialRing CC

o1 = false

i2 : isPolynomialRing(ZZ/7[x,y])

o2 = true

i3 : isPolynomialRing(QQ[x,dx, WeylAlgebra => {x => dx}])

o3 = true

i4 : isPolynomialRing(GF(2)[x,y, SkewCommutative => true])

o4 = true

i5 : isPolynomialRing(ZZ/101[x,y,z]/(x^2-y*z))

o5 = false

i6 : 
0.78user 0.03system 0:00.81elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
