-- -*- M2-comint -*- {* hash: 1633601342 *}

i1 : R = QQ[x,y,z];

i2 : I = ideal(y^2-x*(x-1)*(x-13))

              3      2    2
o2 = ideal(- x  + 14x  + y  - 13x)

o2 : Ideal of R

i3 : jacobian I

o3 = {1} | -3x2+28x-13 |
     {1} | 2y          |
     {1} | 0           |

             3       1
o3 : Matrix R  <--- R

i4 : R = ZZ[a,b,c][x,y,z]

o4 = R

o4 : PolynomialRing

i5 : jacobian ideal(a*y*z+b*x*z+c*x*y)

o5 = {1} | yc+zb |
     {1} | xc+za |
     {1} | xb+ya |

             3       1
o5 : Matrix R  <--- R

i6 : 
0.77user 0.03system 0:00.80elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10845minor)pagefaults 0swaps
