-- -*- M2-comint -*-

i1 : R = QQ[x_1..x_4];

i2 : f = matrix{{x_1..x_4}}

o2 = | x_1 x_2 x_3 x_4 |

             1       4
o2 : Matrix R  <--- R

i3 : C = koszul f

            1      4      6      4      1
o3 = 0 <-- R  <-- R  <-- R  <-- R  <-- R
                                        
     0     1      2      3      4      5

o3 : ChainComplex

i4 : C.dd^2

                   4
o4 = 0 : 0 <----- R  : 2
              0

          1         6
     1 : R  <----- R  : 3
               0

          4         4
     2 : R  <----- R  : 4
               0

          6         1
     3 : R  <----- R  : 5
               0

o4 : ChainComplexMap

i5 : 
