-- -*- M2-comint -*- {* hash: 1080621937 *}

i1 : R = QQ[a..d,MonomialOrder=>ProductOrder{1,3}];

i2 : I = ideal(a*b-c*d, a*c-b*d)

o2 = ideal (a*b - c*d, a*c - b*d)

o2 : Ideal of R

i3 : leadTerm(1,I)

o3 = | b2d-c2d ac ab |

             1       3
o3 : Matrix R  <--- R

i4 : 
0.76user 0.05system 0:00.81elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
