-- -*- M2-comint -*- {* hash: 534145962 *}

i1 : R = QQ[x,y,z,a..d,MonomialOrder=>ProductOrder{3,4}];

i2 : f = matrix{{0,x^2*(a+b)}, {a*x+2*b*y, y^2*(c+d)}}

o2 = | 0      x2a+x2b |
     | xa+2yb y2c+y2d |

             2       2
o2 : Matrix R  <--- R

i3 : leadTerm(1,f)

o3 = | 0  x2a+x2b |
     | xa 0       |

             2       2
o3 : Matrix R  <--- R

i4 : 
0.76user 0.08system 0:00.85elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10842minor)pagefaults 0swaps
