-- -*- M2-comint -*- {* hash: -273820863 *}

i1 : i = 22;

i2 : f = () -> (i := 0; while i<9 do (<< i << " "; i=i+1); <<endl;)

o2 = f

o2 : FunctionClosure

i3 : f()
0 1 2 3 4 5 6 7 8 

i4 : i

o4 = 22

i5 : f = () -> (i := 0; () -> i = i+1)
--warning: f redefined

o5 = f

o5 : FunctionClosure

i6 : p = f()

o6 = p

o6 : FunctionClosure

i7 : q = f()

o7 = q

o7 : FunctionClosure

i8 : p(),p(),p(),p(),q(),p(),p(),q(),p(),p()

o8 = (1, 2, 3, 4, 1, 5, 6, 2, 7, 8)

o8 : Sequence

i9 : 
0.78user 0.05system 0:00.96elapsed 86%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10843minor)pagefaults 0swaps
