-- -*- M2-comint -*- {* hash: -1177954776 *}

i1 : scan({a,b,c}, print)
a
b
c

i2 : scan({3,5,7,11,44,55,77}, i -> if even i then break i)

o2 = 44

i3 : apply({1,2,3,4}, i -> i^2)

o3 = {1, 4, 9, 16}

o3 : List

i4 : {1,2,3,4} / (i -> i^2)

o4 = {1, 4, 9, 16}

o4 : List

i5 : (i -> i^2) \ {1,2,3,4}

o5 = {1, 4, 9, 16}

o5 : List

i6 : {1,2,3,4} / (i -> i^2) / (j -> 1000*j)

o6 = {1000, 4000, 9000, 16000}

o6 : List

i7 : (j -> 1000*j) \ (i -> i^2) \ {1,2,3,4}

o7 = {1000, 4000, 9000, 16000}

o7 : List

i8 : (j -> 1000*j) @@ (i -> i^2) \ {1,2,3,4}

o8 = {1000, 4000, 9000, 16000}

o8 : List

i9 : apply({1,2,3}, {7,8,9}, (i,j) -> 1000*i+j)

o9 = {1007, 2008, 3009}

o9 : List

i10 : table({1,2,3},{7,8},(i,j) -> 1000*i+j)

o10 = {{1007, 1008}, {2007, 2008}, {3007, 3008}}

o10 : List

i11 : applyTable( {{1,2,3},{4,5}}, i -> i^2)

o11 = {{1, 4, 9}, {16, 25}}

o11 : List

i12 : select({1,2,3,4,5,6,7,8,9,10}, even)

o12 = {2, 4, 6, 8, 10}

o12 : List

i13 : select(2,{1,2,3,4,5,6,7,8,9,10}, even)

o13 = {2, 4}

o13 : List

i14 : any({1,2,3,4,5,6,7,8,9,10}, even)

o14 = true

i15 : all({1,2,3,4,5,6,7,8,9,10}, even)

o15 = false

i16 : position({1,3,5,7,8,9,11,13,15,16},even)

o16 = 4

i17 : fold((i,j) -> i*10+j, {7,3,5,4,2})

o17 = 73542

i18 : 
0.77user 0.04system 0:00.81elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
