-- -*- M2-comint -*- {* hash: 1990324495 *}

i1 : R = QQ[x,y,z];

i2 : p = matrix {{x,y,z}}

o2 = | x y z |

             1       3
o2 : Matrix R  <--- R

i3 : q = map(R^1,R^3,p)

o3 = | x y z |

             1       3
o3 : Matrix R  <--- R

i4 : degrees source p

o4 = {{1}, {1}, {1}}

o4 : List

i5 : degrees source q

o5 = {{0}, {0}, {0}}

o5 : List

i6 : 
0.79user 0.04system 0:00.84elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10845minor)pagefaults 0swaps
