-- -*- M2-comint -*- {* hash: -367936335 *}

i1 : f = map ZZ^3

o1 = | 1 0 0 |
     | 0 1 0 |
     | 0 0 1 |

              3        3
o1 : Matrix ZZ  <--- ZZ

i2 : g = id_(ZZ^3)

o2 = | 1 0 0 |
     | 0 1 0 |
     | 0 0 1 |

              3        3
o2 : Matrix ZZ  <--- ZZ

i3 : f === g

o3 = true

i4 : 
0.78user 0.02system 0:00.80elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10838minor)pagefaults 0swaps
