-- -*- M2-comint -*- {* hash: 2035228253 *}

i1 : matrix{{1,2,3},{4,5,6}}

o1 = | 1 2 3 |
     | 4 5 6 |

              2        3
o1 : Matrix ZZ  <--- ZZ

i2 : R = QQ[x,y,z];

i3 : matrix{{x,0,2},{1,2,y}}

o3 = | x 0 2 |
     | 1 2 y |

             2       3
o3 : Matrix R  <--- R

i4 : 
0.76user 0.03system 0:00.80elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10843minor)pagefaults 0swaps
