-- -*- M2-comint -*- {* hash: 1023093597 *}

i1 : member(c,{a,b,c,d,e})

o1 = true

i2 : member(f,(a,b,c,d,e))

o2 = false

i3 : member(3,set{1,2,5,6})

o3 = false

i4 : 
0.78user 0.03system 0:00.81elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
