-- -*- M2-comint -*- {* hash: 1052653853 *}

i1 : R = ZZ[a..f];

i2 : M = matrix{{a,b,c},{d,e,f}}

o2 = | a b c |
     | d e f |

             2       3
o2 : Matrix R  <--- R

i3 : minors(2,M)

o3 = ideal (- b*d + a*e, - c*d + a*f, - c*e + b*f)

o3 : Ideal of R

i4 : minors(2,M,Limit=>1)

o4 = ideal(- b*d + a*e)

o4 : Ideal of R

i5 : 
0.78user 0.04system 0:00.81elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10843minor)pagefaults 0swaps
