-- -*- M2-comint -*- {* hash: -898732303 *}

i1 : R=QQ[w,x,y,z];

i2 : I=ideal(x^2-y*w,x^3-z*w^2)

             2         3    2
o2 = ideal (x  - w*y, x  - w z)

o2 : Ideal of R

i3 : minimalPrimes I

                             2         2
o3 = {ideal (- x*y + w*z, - x  + w*y, y  - x*z), ideal (x, w)}

o3 : List

i4 : I = ideal(x^2+y^2)

            2    2
o4 = ideal(x  + y )

o4 : Ideal of R

i5 : minimalPrimes I

             2    2
o5 = {ideal(x  + y )}

o5 : List

i6 : I = monomialIdeal ideal"wxy,xz,yz"

o6 = monomialIdeal (w*x*y, x*z, y*z)

o6 : MonomialIdeal of R

i7 : minimalPrimes I

o7 = {monomialIdeal (x, y), monomialIdeal (w, z), monomialIdeal (x, z),
     ------------------------------------------------------------------------
     monomialIdeal (y, z)}

o7 : List

i8 : P = intersect(monomialIdeal(w,x,y),monomialIdeal(x,z),monomialIdeal(y,z))

o8 = monomialIdeal (x*y, w*z, x*z, y*z)

o8 : MonomialIdeal of R

i9 : minI = apply(flatten entries gens P, monomialIdeal @@ support)

o9 = {monomialIdeal (x, y), monomialIdeal (w, z), monomialIdeal (x, z),
     ------------------------------------------------------------------------
     monomialIdeal (y, z)}

o9 : List

i10 : dual radical I

o10 = monomialIdeal (x*y, w*z, x*z, y*z)

o10 : MonomialIdeal of R

i11 : P == oo

o11 = true

i12 : 
0.80user 0.03system 0:00.83elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10849minor)pagefaults 0swaps
