-- -*- M2-comint -*- {* hash: -1565994065 *}

i1 : R = ZZ/101[a,b,c];

i2 : I = monomialIdeal(a^3,b^3,c^3, a^2-b^2)

                     2   3   3
o2 = monomialIdeal (a , b , c )

o2 : MonomialIdeal of R

i3 : M = monomialIdeal vars R

o3 = monomialIdeal (a, b, c)

o3 : MonomialIdeal of R

i4 : J = monomialIdeal 0_R

o4 = 0

o4 : MonomialIdeal of R

i5 : R = ZZ[x,y]

o5 = R

o5 : PolynomialRing

i6 : monomialIdeal(2*x,3*y)

o6 = monomialIdeal (x, y)

o6 : MonomialIdeal of R

i7 : 
0.73user 0.06system 0:00.79elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+9341minor)pagefaults 0swaps
