-- -*- M2-comint -*- {* hash: 634468954 *}

i1 : m = matrix{{1,2,3},{4,5,6}}

o1 = | 1 2 3 |
     | 4 5 6 |

              2        3
o1 : Matrix ZZ  <--- ZZ

i2 : n = mutableMatrix m

o2 = | 1 2 3 |
     | 4 5 6 |

o2 : MutableMatrix

i3 : m2 = matrix n

o3 = | 1 2 3 |
     | 4 5 6 |

              2        3
o3 : Matrix ZZ  <--- ZZ

i4 : m2 - m == 0

o4 = true

i5 : n_(0,0) = 212314323

o5 = 212314323

i6 : n_(0,0)

o6 = 212314323

i7 : n

o7 = | 212314323 2 3 |
     | 4         5 6 |

o7 : MutableMatrix

i8 : numrows n

o8 = 2

i9 : numColumns n

o9 = 3

i10 : numcols n

o10 = 3

i11 : ring n

o11 = ZZ

o11 : Ring

i12 : mutableIdentity(RR_100,5)

o12 = | 1 . . . . |
      | . 1 . . . |
      | . . 1 . . |
      | . . . 1 . |
      | . . . . 1 |

o12 : MutableMatrix

i13 : mutableMatrix(QQ,3,5)

o13 = 0

o13 : MutableMatrix

i14 : randomMutableMatrix(4,4,.5,100)

o14 = | .   .   .  .  |
      | .   .   82 .  |
      | -79 44  .  .  |
      | .   -48 .  27 |

o14 : MutableMatrix

i15 : 
0.77user 0.07system 0:00.85elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
