-- -*- M2-comint -*- {* hash: -1086822532 *}

i1 : net "line 1\nline 2\nline 3\n"

o1 = line 1
     line 2
     line 3


i2 : peek oo

     +------+
o2 = |line 1|
     |line 2|
     |line 3|
     |      |
     +------+

i3 : net ""

o3 = 

i4 : peek oo

     ++
o4 = ||
     ++

i5 : net "\n"

o5 = 


i6 : peek oo

     ++
o6 = ||
     ||
     ++

i7 : net "\n\n\ta"

o7 = 

             a

i8 : peek oo

     +---------+
o8 = |         |
     |         |
     |        a|
     +---------+

i9 : 
0.77user 0.03system 0:00.81elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
