-- -*- M2-comint -*-

i1 : f = {{"hi there","foo"},{-3, 2^40}}

o1 = {{hi there, foo}, {-3, 1099511627776}}

o1 : List

i2 : netList f

     +--------+-------------+
o2 = |hi there|foo          |
     +--------+-------------+
     |-3      |1099511627776|
     +--------+-------------+

i3 : netList(f,Boxes=>false)

o3 = hi therefoo          
     -3      1099511627776

i4 : netList(f,Boxes=>true,HorizontalSpace=>1,VerticalSpace=>1)

     +----------+---------------+
     |          |               |
o4 = | hi there | foo           |
     |          |               |
     +----------+---------------+
     |          |               |
     | -3       | 1099511627776 |
     |          |               |
     +----------+---------------+

i5 : netList(f,Boxes=>true,Alignment=>Center)

     +--------+-------------+
o5 = |hi there|     foo     |
     +--------+-------------+
     |   -3   |1099511627776|
     +--------+-------------+

i6 : netList(f,Boxes=>true,BaseRow=>1)

     +--------+-------------+
     |hi there|foo          |
     +--------+-------------+
o6 = |-3      |1099511627776|
     +--------+-------------+

i7 : 
