-- -*- M2-comint -*- {* hash: 1843371894 *}

i1 : R = ZZ[a..f];

i2 : M = genericMatrix(R,a,2,3)

o2 = | a c e |
     | b d f |

             2       3
o2 : Matrix R  <--- R

i3 : permanents(2,M)

o3 = ideal (b*c + a*d, b*e + a*f, d*e + c*f)

o3 : Ideal of R

i4 : 
0.77user 0.04system 0:00.82elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10842minor)pagefaults 0swaps
