-- -*- M2-comint -*- {* hash: -1959517198 *}

i1 : R = ZZ/101[w..z];

i2 : M = module monomialCurveIdeal(R,{1,3,4});

i3 : poincare M

      2     3     4    5
o3 = T  + 3T  - 4T  + T

o3 : ZZ [T]

i4 : numerator reduceHilbert hilbertSeries M

      2     3     4    5
o4 = T  + 3T  - 4T  + T

o4 : ZZ [T]

i5 : R=ZZ/101[x, Degrees => {{1,1}}];

i6 : M = module ideal x^2;

i7 : poincare M

      2 2
o7 = T T
      0 1

o7 : ZZ [T , T ]
          0   1

i8 : numerator reduceHilbert hilbertSeries M

      2 2
o8 = T T
      0 1

o8 : ZZ [T , T ]
          0   1

i9 : 
0.81user 0.06system 0:00.88elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10841minor)pagefaults 0swaps
