-- -*- M2-comint -*- {* hash: 1520709395 *}

i1 : R = QQ[a..d]; f = a^2;

i3 : S = R/(a^2-b-1);

i4 : promote(2/3,S)

     2
o4 = -
     3

o4 : S

i5 : F = map(R,QQ);  F(2/3)

o5 : RingMap R <--- QQ

     2
o6 = -
     3

o6 : R

i7 : promote(f,S)

o7 = b + 1

o7 : S

i8 : G = map(S,R); G(f)

o8 : RingMap S <--- R

o9 = b + 1

o9 : S

i10 : 13_R

o10 = 13

o10 : R

i11 : use R;

i12 : I = ideal(a^2,a^3,a^4)

              2   3   4
o12 = ideal (a , a , a )

o12 : Ideal of R

i13 : promote(I,S)

                              2
o13 = ideal (b + 1, a*b + a, b  + 2b + 1)

o13 : Ideal of S

i14 : m = image matrix{{a^2,a^3,a^4}}

o14 = image | a2 a3 a4 |

                              1
o14 : R-module, submodule of R

i15 : promote(gens m,S)

o15 = | b+1 ab+a b2+2b+1 |

              1       3
o15 : Matrix S  <--- S

i16 : G m

o16 = image | b+1 ab+a b2+2b+1 |

                              1
o16 : S-module, submodule of S

i17 : m ** S

o17 = cokernel {2} | a  0  |
               {3} | -1 a  |
               {4} | 0  -1 |

                             3
o17 : S-module, quotient of S

i18 : 
0.78user 0.04system 0:00.83elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+11037minor)pagefaults 0swaps
