-- -*- M2-comint -*-

i1 : R = ZZ/101[a..d];

i2 : S = ZZ/101[s,t];

i3 : F = map(S,R,matrix{{s^4, s^3*t, s*t^3, t^4}})

               4   3      3   4
o3 = map(S,R,{s , s t, s*t , t })

o3 : RingMap S <--- R

i4 : pushForward1(F,S^1)

o4 = | bc-ad c3-bd2 ac2-b2d b3-a2c |

             1       4
o4 : Matrix R  <--- R

i5 : F = map(S,R,matrix{{s^4, s^3*t, s*t^3, t^4}})     

               4   3      3   4
o5 = map(S,R,{s , s t, s*t , t })

o5 : RingMap S <--- R

i6 : time pushForward1(F,S^1,MonomialOrder=>ProductOrder)
     -- used 0.012001 seconds

o6 = | bc-ad c3-bd2 ac2-b2d b3-a2c |

             1       4
o6 : Matrix R  <--- R

i7 : F = map(S,R,matrix{{s^4, s^3*t, s*t^3, t^4}})

               4   3      3   4
o7 = map(S,R,{s , s t, s*t , t })

o7 : RingMap S <--- R

i8 : pushForward1(F,S^1,DegreeLimit=>8)

o8 = | bc-ad |

             1       1
o8 : Matrix R  <--- R

i9 : pushForward1(F,S^1,StopBeforeComputation => true)

o9 = | bc-ad |

             1       1
o9 : Matrix R  <--- R

i10 : 
