-- -*- M2-comint -*- {* hash: 178631761 *}

i1 : R4 = ZZ/32003[a..d];

i2 : R5 = ZZ/32003[a..e];

i3 : R6 = ZZ/32003[a..f];

i4 : M = coker genericMatrix(R6,a,2,3)

o4 = cokernel | a c e |
              | b d f |

                              2
o4 : R6-module, quotient of R6

i5 : pdim M

o5 = 2

i6 : G = map(R6,R5,{a+b+c+d+e+f,b,c,d,e})

o6 = map(R6,R5,{a + b + c + d + e + f, b, c, d, e})

o6 : RingMap R6 <--- R5

i7 : F = map(R5,R4,random(R5^1, R5^{4:-1}))

o7 = map(R5,R4,{- 2136a + 9349b + 8735c - 5609d - 9489e, 13529a - 15802b - 371c - 545d - 2519e, - 11250a - 14212b - 1270c - 1415d + 626e, 1414a - 3327b - 4035c + 11874d - 13874e})

o7 : RingMap R5 <--- R4

i8 : P = pushForward(G,M)

o8 = cokernel | c -de               |
              | d bc-ad+bd+cd+d2+de |

                              2
o8 : R5-module, quotient of R5

i9 : pdim P

o9 = 1

i10 : Q = pushForward(F,P)

        3
o10 = R4

o10 : R4-module, free, degrees {0, 1, 0}

i11 : pdim Q

o11 = 0

i12 : P3 = QQ[a..d];

i13 : M = comodule monomialCurveIdeal(P3,{1,2,3})

o13 = cokernel | c2-bd bc-ad b2-ac |

                               1
o13 : P3-module, quotient of P3

i14 : P2 = QQ[a,b,c];

i15 : F = map(P3,P2,random(P3^1, P3^{-1,-1,-1}))

                 5     9     2     7    7     6     3     1    10     7     5
o15 = map(P3,P2,{-*a + -*b + -*c + -*d, -*a + -*b + -*c + -*d, --*a + -*b + -*c + 8d})
                 4     2     5     6    6     5     4     4     3     4     6

o15 : RingMap P3 <--- P2

i16 : N = pushForward(F,M)

o16 = cokernel {0} | 821503652433360ab-2378892593212200b2-180967843812504ac+659996719611660bc+20456077852224c2 1643007304866720a2-21543463552689000b2+502985806533000ac+3727516078503900bc+914776078031280c2 4618110968829401670197894687164320000b3-3163611576589491698363463849180648000b2c+59947856690696232009186202915649040ac2+125160281453177557124256750158202600bc2+123254365576028904442854898163719860c3                                       0                                                                                                                                                         |
               {1} | 1418396941154817a-5265014690542360b-171202052055577c                                      -6579999349220375a-29839829515772016b-7056057635649837c                                       1686927222636153255177394681421200005a2+2536043553776579117535040486969212200ab-388195627484498156269005416257189380b2-828317411634297959485490273243340420ac-1183265507822376924552857453091129228bc-952957461124128652576034889254455386c2 287958450810a3-400961287925a2b-2680942780560ab2+5244174813700b3-93738370860a2c+911678082564abc-1609862603460b2c+8536409703ac2-23117264574bc2-1516413743c3 |

                               2
o16 : P2-module, quotient of P2

i17 : hilbertPolynomial M

o17 = - 2*P  + 3*P
           0      1

o17 : ProjectiveHilbertPolynomial

i18 : hilbertPolynomial N

o18 = - 2*P  + 3*P
           0      1

o18 : ProjectiveHilbertPolynomial

i19 : ann N

                         3                2                    2  
o19 = ideal(287958450810a  - 400961287925a b - 2680942780560a*b  +
      -----------------------------------------------------------------------
                    3               2                                      2 
      5244174813700b  - 93738370860a c + 911678082564a*b*c - 1609862603460b c
      -----------------------------------------------------------------------
                     2                 2              3
      + 8536409703a*c  - 23117264574b*c  - 1516413743c )

o19 : Ideal of P2

i20 : 
0.83user 0.08system 0:00.95elapsed 96%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+11436minor)pagefaults 0swaps
