-- -*- M2-comint -*- {* hash: 1168097250 *}

i1 : R = ZZ[x,y]

o1 = R

o1 : PolynomialRing

i2 : f = random(R^2,R^{2:-1})

o2 = | 4x+3y 3x+9y |
     | 8x+y  6x+5y |

             2       2
o2 : Matrix R  <--- R

i3 : g = vars R ++ vars R

o3 = | x y 0 0 |
     | 0 0 x y |

             2       4
o3 : Matrix R  <--- R

i4 : (q,r) = quotientRemainder(f,g)

o4 = ({1} | 4 3 |, 0)
      {1} | 3 9 |
      {1} | 8 6 |
      {1} | 1 5 |

o4 : Sequence

i5 : g*q+r == f

o5 = true

i6 : f = f + map(target f, source f, id_(R^2))

o6 = | 4x+3y+1 3x+9y   |
     | 8x+y    6x+5y+1 |

             2       2
o6 : Matrix R  <--- R

i7 : (q,r) = quotientRemainder(f,g)

o7 = ({1} | 4 3 |, | 1 0 |)
      {1} | 3 9 |  | 0 1 |
      {1} | 8 6 |
      {1} | 1 5 |

o7 : Sequence

i8 : g*q+r == f

o8 = true

i9 : 
0.77user 0.03system 0:00.82elapsed 97%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10848minor)pagefaults 0swaps
