-- -*- M2-comint -*- {* hash: -783693573 *}

i1 : R = ZZ[x,y]

o1 = R

o1 : PolynomialRing

i2 : f = random(R^{2:1},R^2)

o2 = {-1} | 4x+3y 3x+9y |
     {-1} | 8x+y  6x+5y |

             2       2
o2 : Matrix R  <--- R

i3 : g = transpose (vars R ++ vars R)

o3 = {-1} | x 0 |
     {-1} | y 0 |
     {-1} | 0 x |
     {-1} | 0 y |

             4       2
o3 : Matrix R  <--- R

i4 : (q,r) = quotientRemainder'(f,g)

o4 = ({-1} | 4 3 3 9 |, 0)
      {-1} | 8 1 6 5 |

o4 : Sequence

i5 : q*g+r == f

o5 = true

i6 : f = f + map(target f, source f, id_(R^2))

o6 = {-1} | 4x+3y+1 3x+9y   |
     {-1} | 8x+y    6x+5y+1 |

             2       2
o6 : Matrix R  <--- R

i7 : (q,r) = quotientRemainder'(f,g)

o7 = ({-1} | 4 3 3 9 |, {-1} | 1 0 |)
      {-1} | 8 1 6 5 |  {-1} | 0 1 |

o7 : Sequence

i8 : q*g+r == f

o8 = true

i9 : 
0.75user 0.06system 0:00.82elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
