-- -*- M2-comint -*- {* hash: -1319459951 *}

i1 : realpath "."

o1 = /home/dan/src/M2/1.1/BUILD/Linux-x86_64/ubuntu64/Macaulay2/packages

i2 : p = temporaryFileName()

o2 = /tmp/M2-16974-1

i3 : q = temporaryFileName()

o3 = /tmp/M2-16974-2

i4 : symlinkFile(p,q)

i5 : readlink q

o5 = /tmp/M2-16974-1

i6 : realpath q

o6 = /tmp/M2-16974-2

i7 : p << "hi there" << close

o7 = /tmp/M2-16974-1

o7 : File

i8 : realpath q

o8 = /tmp/M2-16974-1

i9 : removeFile q

i10 : 
0.78user 0.02system 0:00.81elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10839minor)pagefaults 0swaps
