-- -*- M2-comint -*-

i1 : realpath "."

o1 = /home/dan/src/M2/BUILD/normal/Macaulay2/packages

i2 : p = temporaryFileName()

o2 = /tmp/M2-21045-1

i3 : q = temporaryFileName()

o3 = /tmp/M2-21045-2

i4 : symlinkFile(p,q)

i5 : readlink q

o5 = /tmp/M2-21045-1

i6 : realpath q

o6 = /tmp/M2-21045-2

i7 : p << "hi there" << close

o7 = /tmp/M2-21045-1

o7 : File

i8 : realpath q

o8 = /tmp/M2-21045-1

i9 : removeFile q

i10 : 
