-- -*- M2-comint -*- {* hash: 1097039681 *}

i1 : R = ZZ/101[x, Degrees => {2}];

i2 : I = ideal x^2;

o2 : Ideal of R

i3 : s = hilbertSeries I

           4
      1 - T
o3 = --------
           2
     (1 - T )

o3 : Expression of class Divide

i4 : reduceHilbert s

          2
     1 + T
o4 = ------
        1

o4 : Expression of class Divide

i5 : 
0.78user 0.03system 0:00.81elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10843minor)pagefaults 0swaps
