-- -*- M2-comint -*- {* hash: 418213266 *}

i1 : R = ZZ[a..f];

i2 : m = mutableMatrix genericMatrix(R,a,2,3)

o2 = | a c e |
     | b d f |

o2 : MutableMatrix

i3 : rowMult(m,0,c)

o3 = | ac c2 ce |
     | b  d  f  |

o3 : MutableMatrix

i4 : m

o4 = | ac c2 ce |
     | b  d  f  |

o4 : MutableMatrix

i5 : 
0.78user 0.01system 0:00.80elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
