-- -*- M2-comint -*- {* hash: 688961184 *}

i1 : R = ZZ[a..f];

i2 : m = mutableMatrix genericMatrix(R,a,2,3)

o2 = | a c e |
     | b d f |

o2 : MutableMatrix

i3 : rowAdd(m,0,c,1)

o3 = | bc+a cd+c cf+e |
     | b    d    f    |

o3 : MutableMatrix

i4 : m

o4 = | bc+a cd+c cf+e |
     | b    d    f    |

o4 : MutableMatrix

i5 : 
0.80user 0.02system 0:00.82elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
