-- -*- M2-comint -*- {* hash: 886543534 *}

i1 : rsort {4,2,3,1}

o1 = {4, 3, 2, 1}

o1 : List

i2 : R = QQ[a..d];

i3 : m = matrix{{a*b, c*d, a*d^3, b^3*c, 1_R}}

o3 = | ab cd ad3 b3c 1 |

             1       5
o3 : Matrix R  <--- R

i4 : rsort(m, DegreeOrder=>Ascending)

o4 = | b3c ad3 ab cd 1 |

             1       5
o4 : Matrix R  <--- R

i5 : 
0.78user 0.10system 0:00.89elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10849minor)pagefaults 0swaps
