-- -*- M2-comint -*-

i1 : setPrecision 200

o1 = 100

i2 : x = sqrt toRRR 2

o2 = .141421356237309504880168872420969807856967187537694807317667973799073*
     ------------------------------------------------------------------------
     10^1

o2 : RRR

i3 : precision x

o3 = 224

i4 : x^2-2

o4 = .-370920615068742138573173526154763951336756477875779100245303905891758*
     ------------------------------------------------------------------------
     10^-67

o4 : RRR

i5 : 
