-- -*- M2-comint -*- {* hash: -1752218336 *}

i1 : size2 4

o1 = 3

i2 : size2 3

o2 = 2

i3 : size2 4.

o3 = 3

i4 : size2 3.99999999

o4 = 2

i5 : size2 0

o5 = -1073741824

i6 : size2 0.

o6 = -1073741824

i7 : size2 (1/0.)

o7 = 1073741823

i8 : size2 (1/0.-1/0.)

o8 = 1073741823

i9 : 
0.76user 0.04system 0:00.80elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
