-- -*- M2-comint -*- {* hash: 1107141113 *}

i1 : kk = ZZ/101;

i2 : A = matrix"1,2,3,4;1,3,6,10;19,7,11,13" ** kk

o2 = | 1  2 3  4  |
     | 1  3 6  10 |
     | 19 7 11 13 |

              3        4
o2 : Matrix kk  <--- kk

i3 : b = matrix"1;1;1" ** kk

o3 = | 1 |
     | 1 |
     | 1 |

              3        1
o3 : Matrix kk  <--- kk

i4 : x = solve(A,b)

o4 = | 2  |
     | -1 |
     | 34 |
     | 0  |

              4        1
o4 : Matrix kk  <--- kk

i5 : A*x-b

o5 = 0

              3        1
o5 : Matrix kk  <--- kk

i6 : printingPrecision = 2;

i7 : A = matrix "1,2,3;1,3,6;19,7,11" ** RR

o7 = | 1  2 3  |
     | 1  3 6  |
     | 19 7 11 |

                3          3
o7 : Matrix RR    <--- RR
              53         53

i8 : b = matrix "1;1;1" ** RR

o8 = | 1 |
     | 1 |
     | 1 |

                3          1
o8 : Matrix RR    <--- RR
              53         53

i9 : x = solve(A,b)

o9 = | -.15 |
     | 1.1  |
     | -.38 |

                3          1
o9 : Matrix RR    <--- RR
              53         53

i10 : A*x-b

o10 = | 2.2e-16  |
      | -2.2e-16 |
      | 0        |

                 3          1
o10 : Matrix RR    <--- RR
               53         53

i11 : norm oo

o11 = 2.22044604925031e-16

o11 : RR (of precision 53)

i12 : n = 10;

i13 : A = random(CC^n,CC^n)

o13 = | .35+.46i .51+.19i .13+.31i  .76+.43i  .86+.33i .2+.92i   .83+.7i  
      | .081+.4i .67+.18i .44+.94i  .54+.64i  .43+.85i .42+.052i .42+.36i 
      | .12+.23i .52+.9i  .88+.84i  .094+.11i .12+.32i .61+.02i  .94+.69i 
      | .96+.1i  .52+.11i .88+.33i  .34+.65i  .99+.01i .57+.75i  .026+.11i
      | .56+.6i  .56+.61i .25+.093i .35+.83i  .56+.2i  .61+.17i  .63+.59i 
      | .21+.79i .39+.79i .38+.76i  .18+.035i .81+.36i .94+.11i  .57+.43i 
      | .97+.99i .54+.8i  .97+.93i  .17+.65i  .64+.88i .37+.51i  .81      
      | .21+.87i .44+.57i .07+.71i  .84+.45i  .31+.49i .53+.55i  .71+.25i 
      | .44+.14i .3+.43i  .54+.66i  .94+.09i  .29+.85i .83+.04i  .61+.74i 
      | .64+.94i .63i     .58+.04i  .99+.32i  .15+.12i .99i      .54+.39i 
      -----------------------------------------------------------------------
      .38+.52i  .44+.97i .37+.14i |
      .45+.32i  .14+.67i .33+.71i |
      .52+.78i  .75+.63i .4+.71i  |
      .69+.02i  .13+.24i .37+.1i  |
      .66+.13i  .6+.81i  .69+.9i  |
      .032+.25i .84+.6i  .51+.74i |
      .23+.025i .95+.67i .75+.06i |
      .96+.79i  .72+.69i .7+.99i  |
      .074+.43i .67+.65i .05+.93i |
      .41+.79i  .73+.15i .92+.55i |

                 10          10
o13 : Matrix CC     <--- CC
               53          53

i14 : b = random(CC^n,CC^2)

o14 = | .6+.37i  .76+.25i |
      | .48+.16i .01+.87i |
      | .42+.14i .68+.76i |
      | .51i     .32+.32i |
      | .72+.19i .29+.99i |
      | .66+.94i .66+.3i  |
      | .25+.25i .5+.028i |
      | .46+.56i .92+.13i |
      | .74+.43i .79+.8i  |
      | .78+.99i .59+.34i |

                 10          2
o14 : Matrix CC     <--- CC
               53          53

i15 : x = solve(A,b)

o15 = | -.82-3i   .29+6.4i  |
      | -4.2-6.3i 2.2+19i   |
      | -.34-.95i -.72+3.2i |
      | 5.2-2.5i  -14+.7i   |
      | 4.1+1.3i  -7.7-7.4i |
      | -.58+4.9i 7.7-8.4i  |
      | 4.8-1.6i  -10-2.4i  |
      | 3.2+1.6i  -5.4-8.3i |
      | -4.4+4.8i 13-6.2i   |
      | -4.6+3.4i 14-1.9i   |

                 10          2
o15 : Matrix CC     <--- CC
               53          53

i16 : norm ( matrix A * matrix x - matrix b )

o16 = 1.01085181470584e-14

o16 : RR (of precision 53)

i17 : A = random(RR^5, RR^5)

o17 = | .029 .59 .59 .4  .65 |
      | .99  .87 .18 .99 .92 |
      | .39  .54 .11 .75 .95 |
      | .75  .13 .8  .36 .19 |
      | .92  .36 .58 .99 .67 |

                 5          5
o17 : Matrix RR    <--- RR
               53         53

i18 : I = id_(target A)

o18 = | 1 0 0 0 0 |
      | 0 1 0 0 0 |
      | 0 0 1 0 0 |
      | 0 0 0 1 0 |
      | 0 0 0 0 1 |

                 5          5
o18 : Matrix RR    <--- RR
               53         53

i19 : A' = solve(A,I)

o19 = | -1.4 .7   1.1  1.9  -1.7 |
      | 1.4  1.9  -2.4 -.88 -.39 |
      | .89  -.6  -.37 .54  .33  |
      | 1.1  -.26 -2.8 -3.4 4.2  |
      | -1.2 -1.1 4.2  2.3  -2.4 |

                 5          5
o19 : Matrix RR    <--- RR
               53         53

i20 : norm(A*A' - I)

o20 = 8.88178419700125e-16

o20 : RR (of precision 53)

i21 : norm(A'*A - I)

o21 = 1.33226762955019e-15

o21 : RR (of precision 53)

i22 : A'' = I // A

o22 = | -1.4 .7   1.1  1.9  -1.7 |
      | 1.4  1.9  -2.4 -.88 -.39 |
      | .89  -.6  -.37 .54  .33  |
      | 1.1  -.26 -2.8 -3.4 4.2  |
      | -1.2 -1.1 4.2  2.3  -2.4 |

                 5          5
o22 : Matrix RR    <--- RR
               53         53

i23 : norm(A' - A'')

o23 = 0

o23 : RR (of precision 53)

i24 : 
0.80user 0.02system 0:00.82elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10844minor)pagefaults 0swaps
