-- -*- M2-comint -*- {* hash: 787165170 *}

i1 : sort {c,e,a,f,b,f}

o1 = {a, b, c, e, f, f}

o1 : List

i2 : sort {4,2,6,3,8,2}

o2 = {2, 2, 3, 4, 6, 8}

o2 : List

i3 : R = ZZ[a..d,MonomialOrder=>Lex];

i4 : sort{a*d, b^100, c^3*d}

       3    100
o4 = {c d, b   , a*d}

o4 : List

i5 : 
0.77user 0.04system 0:00.81elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10845minor)pagefaults 0swaps
