-- -*- M2-comint -*- {* hash: -846689352 *}

i1 : R = QQ[a..g];

i2 : I = ideal"ab2-c3,abc-def,ade-bfg"

               2    3
o2 = ideal (a*b  - c , a*b*c - d*e*f, a*d*e - b*f*g)

o2 : Ideal of R

i3 : G = gb(I, Syzygies=>true);

i4 : syz G

o4 = {3} | -abc+def 0        -ade+bfg -d2e2f+b2cfg |
     {3} | ab2-c3   -ade+bfg 0        c3de-b3fg    |
     {3} | 0        abc-def  ab2-c3   -bc4+b2def   |

             3       4
o4 : Matrix R  <--- R

i5 : syz gens I

o5 = {3} | -abc+def 0        -ade+bfg |
     {3} | ab2-c3   -ade+bfg 0        |
     {3} | 0        abc-def  ab2-c3   |

             3       3
o5 : Matrix R  <--- R

i6 : mingens image syz G

o6 = {3} | -abc+def 0        -ade+bfg |
     {3} | ab2-c3   -ade+bfg 0        |
     {3} | 0        abc-def  ab2-c3   |

             3       3
o6 : Matrix R  <--- R

i7 : 
0.77user 0.04system 0:00.81elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10840minor)pagefaults 0swaps
