-- -*- M2-comint -*- {* hash: 1629959205 *}

i1 : S = ZZ/10007[x, y, z];

i2 : R = ZZ/10007[t];

i3 : f = map(R,S,{t^3,t^4,t^5})

               3   4   5
o3 = map(R,S,{t , t , t })

o3 : RingMap R <--- S

i4 : target f

o4 = R

o4 : PolynomialRing

i5 : 
0.75user 0.06system 0:00.81elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10845minor)pagefaults 0swaps
