-- -*- M2-comint -*- {* hash: 653624764 *}

i1 : R = ZZ/32003[a..e];

i2 : f = matrix{{a^2, b^2, c^2, d^2, e^3, a*d-e^2}}

o2 = | a2 b2 c2 d2 e3 ad-e2 |

             1       6
o2 : Matrix R  <--- R

i3 : g = toDual(1,f)

o3 = {1} | abce |
     {1} | bcde |

             2       1
o3 : Matrix R  <--- R

i4 : ideal fromDual g == ideal f

o4 = false

i5 : g = toDual(2,f)

o5 = {6} | abce      |
     {6} | bcde      |
     {6} | abcd+bce2 |

             3       1
o5 : Matrix R  <--- R

i6 : ideal fromDual g == ideal f

o6 = true

i7 : g = toDual(3,f)

o7 = {11} | abce      |
     {11} | bcde      |
     {11} | abcd+bce2 |

             3       1
o7 : Matrix R  <--- R

i8 : ideal fromDual g == ideal f

o8 = true

i9 : 
0.90user 0.10system 0:01.01elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+12911minor)pagefaults 0swaps
