-- -*- M2-comint -*- {* hash: -303703866 *}

i1 : R=ZZ/32003[a..c];

i2 : I=intersect(ideal(a,b),ideal(b,c),ideal(c,a),ideal(a^2,b^3,c^4));

o2 : Ideal of R

i3 : topComponents I

o3 = ideal (b*c, a*c, a*b)

o3 : Ideal of R

i4 : 
0.82user 0.04system 0:00.86elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10907minor)pagefaults 0swaps
