-- -*- M2-comint -*- {* hash: 796135807 *}

i1 : ///-- We can compute $(x+y)^3$ as follows.
     R = QQ[x,y]
     (x+y)^3
     ///

o1 = -- We can compute $(x+y)^3$ as follows.
     R = QQ[x,y]
     (x+y)^3


i2 : tutorial oo

                                            +-----------+
o2 = {We can compute $(x+y)^3$ as follows., |R = QQ[x,y]|}
                                            +-----------+
                                            |(x+y)^3    |
                                            +-----------+

o2 : List

i3 : peek oo

o3 = {TEX{"We can compute $(x+y)^3$ as follows."}, TABLE{class => examples,
     ------------------------------------------------------------------------
     TR{TD{ExampleItem{"R = QQ[x,y]"}}}, TR{TD{ExampleItem{"(x+y)^3"}}}}}

i4 : 
0.78user 0.02system 0:00.80elapsed 100%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10842minor)pagefaults 0swaps
