-- -*- M2-comint -*- {* hash: 1086358260 *}

i1 : sin

o1 = sin

o1 : CompiledFunction

i2 : sin 1.2

o2 = .932039085967226

o2 : RR (of precision 53)

i3 : sin(1.2)

o3 = .932039085967226

o3 : RR (of precision 53)

i4 : sin(1.0+0.2)

o4 = .932039085967226

o4 : RR (of precision 53)

i5 : print(10 + 1)^2
121

i6 : append

o6 = append

o6 : CompiledFunction

i7 : append({a,b,c},d)

o7 = {a, b, c, d}

o7 : List

i8 : join

o8 = join

o8 : CompiledFunction

i9 : join({a,b},{c,d},{e,f},{g,h,i})

o9 = {a, b, c, d, e, f, g, h, i}

o9 : List

i10 : ap = append;

i11 : ap({a,b,c},d)

o11 = {a, b, c, d}

o11 : List

i12 : 
0.76user 0.04system 0:00.80elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10842minor)pagefaults 0swaps
