-- -*- M2-comint -*- {* hash: 1293132650 *}

i1 : class 33

o1 = ZZ

o1 : Ring

i2 : instance(33,ZZ)

o2 = true

i3 : instance(33,String)

o3 = false

i4 : instance(ZZ,Type)

o4 = true

i5 : instance(33,Type)

o5 = false

i6 : instance(33,Thing)

o6 = true

i7 : class ZZ

o7 = Ring

o7 : Type

i8 : parent class ZZ

o8 = Type

o8 : Type

i9 : 
0.77user 0.03system 0:00.80elapsed 99%CPU (0avgtext+0avgdata 0maxresident)k
0inputs+0outputs (0major+10842minor)pagefaults 0swaps
