-- -*- M2-comint -*- {* hash: 781960899 *}
--loading configuration for package "MapleInterface" from file /home/janko/.Macaulay2/init-MapleInterface.m2

i1 : A=random(QQ^3,QQ^3)

o1 = | 9/4 1/2 7/2 |
     | 6/7 1/2 3/2 |
     | 7/3 1/6 5/3 |

              3        3
o1 : Matrix QQ  <--- QQ

i2 : (perm,LR)=LRdecomposition(A,j->-j);

i3 : LR

o3 = | 7/3   1/6     5/3     |
     | 18/49 43/98   87/98   |
     | 27/28 133/172 415/344 |

              3        3
o3 : Matrix QQ  <--- QQ

i4 : P=transpose (id_(QQ^3))_perm

o4 = | 0 0 1 |
     | 0 1 0 |
     | 1 0 0 |

              3        3
o4 : Matrix QQ  <--- QQ

i5 : R=extractRightUpper(LR)

o5 = | 7/3 1/6   5/3     |
     | 0   43/98 87/98   |
     | 0   0     415/344 |

              3        3
o5 : Matrix QQ  <--- QQ

i6 : L=extractLeftLower(LR)

o6 = | 1     0       0 |
     | 18/49 1       0 |
     | 27/28 133/172 1 |

              3        3
o6 : Matrix QQ  <--- QQ

i7 : L*R==P*A

o7 = true

i8 : b=random(QQ^3,QQ^1);

              3        1
o8 : Matrix QQ  <--- QQ

i9 : y=forwardSubstitution(LR,P*b)

o9 = | 5/9    |
     | 39/49  |
     | 159/86 |

              3        1
o9 : Matrix QQ  <--- QQ

i10 : x=backwardSubstitution(LR,y)

o10 = | -952/1245 |
      | -534/415  |
      | 636/415   |

               3        1
o10 : Matrix QQ  <--- QQ

i11 : inverse(A)*b==x

o11 = true

i12 : 
