-- -*- M2 -*-

    i3 : errorDepth = 10

    o3 = 10

    i5 : load "/tmp/foo.m2"

    i6 : foo()
    {*dummy position*}[0]: error: hi			OOPS

    i7 : get "/tmp/foo.m2"

    o7 = foo = () -> (error "hi"; 2)


Here's another example of the same thing:


    i1 : load "/tmp/foo.m2"
    {*dummy position*}[4]: error: expected a symbol: null
    stdio:1:1:(3): error: expected a symbol: null

    i2 : get "/tmp/foo.m2"

    o2 = newPackage "foo"
	 export {,}

