-- -*- M2-comint -*- {* hash: 2068686618 *}
--loading configuration for package "PHCpack" from file /home/aleykin3/.Macaulay2/init-PHCpack.m2

i1 : QQ[x,y,z];

i2 : sys={y-x^2, z-x^3, (x+y+z-1)/x};

i3 : describe ring ideal sys --"there are denominators! i will call the conversion method."

o3 = frac QQ[x, y, z]

i4 : convertedSys = convertToPoly(sys);

i5 : printWidth = 300;

i6 : toString convertedSys

o6 = {y-x^2, z-x^3, -var_0^(-1)+z*var_0^(-1)+y*var_0^(-1)+x*var_0^(-1), var_0-x}

i7 : ring ideal convertedSys

o7 = P

o7 : PolynomialRing

i8 : describe oo --that this is a ring with negative exponents allowed is evident from the option "Inverses=>true".

o8 = QQ[x..z, var , Degrees => {4:1}, MonomialOrder => {MonomialSize => 32}, DegreeRank => 1, Inverses => true]
                 0                                     {GroupRevLex => 4  }
                                                       {Position => Up    }

i9 : P=QQ[x,y,z];

i10 : f=(x*y + z^2*y) / y

       2
o10 = z  + x

o10 : frac(P)

i11 : liftable(f,P)

o11 = true

i12 : lift(f,P)

       2
o12 = z  + x

o12 : P

i13 : QQ[x,y,z]

o13 = QQ[x, y, z]

o13 : PolynomialRing

i14 : denominator(x^2+y/z+z/x^3) --returns the common denominator, of course.

       3
o14 = x z

o14 : QQ[x, y, z]

i15 : 
